let config = {}
// 公共脚本key
config.commonScriptKey = "zijiefeiwuCommon";
// 业务脚本key
config.serviceScriptKey = "zijiefeiwuBus";
// appKey
config.appKey = "宁波字节飞舞科技"
// 分辨率 以竖屏标准看
config.screenWidth = 1080
config.screenHeight = 2400
config.youxiaoFBL = [{
    w: 1080,
    h: 1920
}, {
    w: 720,
    h: 1280
}]


// var r = images.findMultiColors(img, "#FF0000", [[30, 0, "#FF0000"], [38, 0, "#FF0000"], [49, 0, "#FF0000"]], {
//     region: [p.x + 装备属性明细.x, p.y - 装备属性明细.y偏移, 装备属性明细.x * -1, 装备属性明细.第一行h],
//     threshold: 30
// });
config.找色 = {
    '720_1280': {
        极品: [{
            color: "#FF0000"
        }, {
            color: "#FF0000",
            x: 30,
            y: 0
        }, {
            color: "#FF0000",
            x: 38,
            y: 0
        }, {
            color: "#FF0000",
            x: 49,
            y: 0
        }],
        拾取光柱: [{
            color: "#FFFF68"
        }, {
            color: "#FFFFFF",
            x: 0,
            y: 40
        }, {
            color: "#FFFFFF",
            x: 0,
            y: 60
        }],
        地牢: [{
            color: "#19407E"
        }, {
            color: "#BF7251",
            x: 21,
            y: -24
        }, {
            color: "#1E4CCB",
            x: 25,
            y: -27
        }],
        随机: [{
            color: "#7B2EC8"
        }, {
            color: "#C97747",
            x: 21,
            y: -21
        }, {
            color: "#7937D0",
            x: 26,
            y: -26
        }],
        判断蓝: {
            c0: "#6DB3F0",
            x1: 0,
            y1: -25,
            c1: "#133CA0",
            p: [373, 616, 3, 35]
        },
        逃跑: {
            c0: "#FF4246",
            x1: 0,
            y1: -43,
            c1: "#A5060D",
            p: [365, 590, 3, 100]
        },
        自愈: {
            c0: "#FF4246",
            x1: 0,
            y1: -63,
            c1: "#660611",
            p: [365, 570, 3, 100]
        },
        小退: {
            c0: "#FF4246",
            x1: 0,
            y1: -23,
            c1: "#BF0712",
            p: [365, 610, 3, 50]
        },
        大地图箭头: [
            {
                方向: "正上",
                箭头: "#FEEA6E",
                尾1: {
                    x: -5,
                    y: 16,
                    color: "#FEEA6E"
                },
                中间: {
                    x: 0,
                    y: 13,
                    color: "#FDDD6E"
                },
                尾2: {
                    x: 6,
                    y: 16,
                    color: "#FEEA6E"
                }
            }, {
                方向: "左上",
                箭头: "#FEEA6E",
                尾1: {
                    x: 7,
                    y: 15,
                    color: "#FEEA6E"
                },
                中间: {
                    x: 9,
                    y: 9,
                    color: "#FDDD6E"
                },
                尾2: {
                    x: 15,
                    y: 7,
                    color: "#FEEA6E"
                }
            }, {
                方向: "正左",
                箭头: "#FEEA6E",
                中间: {
                    x: 13,
                    y: 0,
                    color: "#FDDF6E"
                },
                尾1: {
                    x: 15,
                    y: -5,
                    color: "#FEEA6E"
                },
                尾2: {
                    x: 15,
                    y: 6,
                    color: "#FEEA6E"
                }
            }, {
                方向: "左下",
                箭头: "#FEEA6E",
                尾1: {
                    x: 7,
                    y: -14,
                    color: "#FEEA6E"
                },
                中间: {
                    x: 8,
                    y: -9,
                    color: "#FDDD6E"
                },
                尾2: {
                    x: 15,
                    y: -7,
                    color: "#FEEA6E"
                }
            }, {
                方向: "正下",
                箭头: "#FEEA6E",
                尾1: {
                    x: -5,
                    y: -15,
                    color: "#FEEA6E"
                },
                中间: {
                    x: 0,
                    y: -12,
                    color: "#FDDD6E"
                },
                尾2: {
                    x: 5,
                    y: -15,
                    color: "#FEEA6E"
                }
            }, {
                方向: "右下",
                箭头: "#FEEA6E",
                尾1: {
                    x: -13,
                    y: -6,
                    color: "#FEEA6E"
                },
                中间: {
                    x: -7,
                    y: -8,
                    color: "#FDDC6E"
                },
                尾2: {
                    x: -6,
                    y: -13,
                    color: "#FEEA6E"
                }
            }, {
                方向: "正右",
                箭头: "#FEEA6E",
                中间: {
                    x: -12,
                    y: 0,
                    color: "#FDDD6E"
                },
                尾1: {
                    x: -15,
                    y: -6,
                    color: "#FEEA6E"
                },
                尾2: {
                    x: -15,
                    y: 6,
                    color: "#FEEA6E"
                }
            }, {
                方向: "右上",
                箭头: "#FEEA6E",
                中间: {
                    x: -7,
                    y: 9,
                    color: "#FDDD6E"
                },
                尾1: {
                    x: -14,
                    y: 6,
                    color: "#FEEA6E"
                },
                尾2: {
                    x: -6,
                    y: 14,
                    color: "#FEEA6E"
                }
            }
        ],
        扫描宝宝: [
            [0, 0, 617, 720],
            [663, 0, 617, 720],
            [617, 0, 43, 240],
            [617, 250, 43, 470],
        ],
        扫描拾取: {
            c0: "#FFFF68",
            x1: 0,
            y1: 40,
            c1: "#FFFFFF",
            x2: 0,
            y2: 60,
            c2: "#FFFFFF"
        },
        血量变动: {
            c0: "#FFFFFF",
            x1: 11,
            y1: 0,
            c1: "#FFFFFF",
            x2: 22,
            y2: 0,
            c2: "#FFFFFF",
            x3: 32,
            y3: 0,
            c3: "#EFEFEE",
            x4: 48,
            y4: -7,
            c4: "#FF3500",
        }
    },
    '1080_2248': {
        极品: [{
            color: "#FF0000"
        }, {
            color: "#FF0000",
            x: 44,
            y: 0
        }, {
            color: "#FF0000",
            x: 57,
            y: 0
        }, {
            color: "#FF0000",
            x: 73,
            y: 0
        }],
        地牢: [{
            color: "#2942B0"
        }, {
            color: "#274BBC",
            x: 27,
            y: -22
        }, {
            color: "#AE6946",
            x: 42,
            y: -42
        }],
        随机: [{
            color: "#7B2EC8"
        }, {
            color: "#C97747",
            x: 21,
            y: -21
        }, {
            color: "#7937D0",
            x: 26,
            y: -26
        }],
        判断蓝: {
            c0: "#77B8F4",
            x1: 0,
            y1: -30,
            c1: "#133EA1",
            p: [720, 930, 6, 45]
        },
        逃跑: {
            c0: "#FF4245",
            x1: 0,
            y1: -50,
            c1: "#B50816",
            p: [710, 910, 5, 100]
        },
        自愈: {
            c0: "#FF4245",
            x1: 0,
            y1: -95,
            c1: "#650611",
            p: [710, 860, 5, 110]
        },
        小退: {
            c0: "#FF4245",
            x1: 0,
            y1: -25,
            c1: "#A70914",
            p: [710, 910, 5, 100]
        },
        大地图箭头: [
            {
                方向: "正上",
                箭头: "#FEEA6E",
                尾1: {
                    x: -9,
                    y: 23,
                    color: "#FEEA6E"
                },
                中间: {
                    x: 0,
                    y: 19,
                    color: "#FDDE6E"
                },
                尾2: {
                    x: 8,
                    y: 23,
                    color: "#FEEA6E"
                }
            }, {
                方向: "左上",
                箭头: "#FEEA6E",
                尾1: {
                    x: 10,
                    y: 21,
                    color: "#FEEA6E"
                },
                中间: {
                    x: 13,
                    y: 13,
                    color: "#FDDC6E"
                },
                尾2: {
                    x: 21,
                    y: 10,
                    color: "#FEEA6E"
                }
            }, {
                方向: "正左",
                箭头: "#FEEA6E",
                尾1: {
                    x: 21,
                    y: -6,
                    color: "#FEEA6E"
                },
                中间: {
                    x: 18,
                    y: 1,
                    color: "#FDDC6E"
                },
                尾2: {
                    x: 21,
                    y: 8,
                    color: "#FEEA6E"
                }
            }, {
                方向: "左下",
                箭头: "#FEEA6E",
                尾1: {
                    x: 11,
                    y: -23,
                    color: "#FEEA6E"
                },
                中间: {
                    x: 14,
                    y: -13,
                    color: "#FDDB6E"
                },
                尾2: {
                    x: 23,
                    y: -11,
                    color: "#FEEA6E"
                }
            }, {
                方向: "正下",
                箭头: "#FEEA6E",
                尾1: {
                    x: -8,
                    y: -22,
                    color: "#FEEA6E"
                },
                中间: {
                    x: 1,
                    y: -18,
                    color: "#FDDD6E"
                },
                尾2: {
                    x: 9,
                    y: -22,
                    color: "#FEEA6E"
                }
            }, {
                方向: "右下",
                箭头: "#FEEA6E",
                尾1: {
                    x: -21,
                    y: -10,
                    color: "#FEEA6E"
                },
                中间: {
                    x: -13,
                    y: -13,
                    color: "#FDDD6E"
                },
                尾2: {
                    x: -10,
                    y: -23,
                    color: "#FEEA6E"
                }
            }, {
                方向: "正右",
                箭头: "#FEEA6E",
                尾1: {
                    x: -21,
                    y: -8,
                    color: "#FEEA6E"
                },
                中间: {
                    x: -16,
                    y: 2,
                    color: "#FDDD6E"
                },
                尾2: {
                    x: -21,
                    y: 10,
                    color: "#FEEA6E"
                }
            }, {
                方向: "右上",
                箭头: "#FEEA6E",
                尾1: {
                    x: -24,
                    y: 10,
                    color: "#FEEA6E"
                },
                中间: {
                    x: -14,
                    y: 13,
                    color: "#FDDD6E"
                },
                尾2: {
                    x: -11,
                    y: 23,
                    color: "#FEEA6E"
                }
            }
        ],
        扫描宝宝: [
            [0, 0, 1091, 1080],
            [1155, 0, 1093, 1080],
            [1091, 0, 65, 383],
            [1091, 392, 65, 688],
        ],
        扫描拾取: {
            c0: "#FFFF82",
            x1: 0,
            y1: 60,
            c1: "#FFFFFF",
            x2: 0,
            y2: 102,
            c2: "#FFFFFF"
        },
        血量变动: {
            c0: "#FFFFFF",
            x1: 11,
            y1: 0,
            c1: "#FFFFFF",
            x2: 28,
            y2: 0,
            c2: "#FFFFFF",
            x3: 54,
            y3: 0,
            c3: "#FFFFFF",
            x4: 69,
            y4: 0,
            c4: "#FF3400",
        }
    }
}
config.地图标识 = {
    "牛魔寺庙入口": {
        pic: "ditu_niumo0.png",
        范围: {
            '720_1280': {
                x1: 200,
                x2: 270,
                y1: 90,
                y2: 135
            },
            '1080_2248': {
            }
        }
    },
    "牛魔寺庙一层": {
        pic: "ditu_niumo1.png",
        范围: {
            '720_1280': {
                x1: 370,
                x2: 450,
                y1: 230,
                y2: 320
            },
            '1080_2248': {
            }
        }
    },
    "牛魔寺庙二层": {
        pic: "ditu_niumo2.png",
        范围: {
            '720_1280': {
                x1: 480,
                x2: 560,
                y1: 250,
                y2: 330
            },
            '1080_2248': {
            }
        }
    },
    "牛魔寺庙三层": {
        pic: "ditu_niumo3.png",
        范围: {
            '720_1280': {
                x1: 380,
                x2: 460,
                y1: 245,
                y2: 330
            },
            '1080_2248': {
            }
        }
    },
    "牛魔寺庙四层": {
        pic: "ditu_niumo4.png",
        范围: {
            '720_1280': {
                x1: 200,
                x2: 300,
                y1: 315,
                y2: 415
            },
            '1080_2248': {
            }
        }
    },
    "地牢一层东": {
        pic: "ditu_wugong_dong.png",
        范围: {
            '720_1280': {
                x1: 100,
                x2: 180,
                y1: 450,
                y2: 520
            },
            '1080_2248': {
                x1: 180,
                x2: 250,
                y1: 695,
                y2: 770
            }
        }
    },
    "地牢一层西1": {
        pic: "ditu_wugong_xi1.png",
        范围: {
            '720_1280': {
                x1: 420,
                x2: 500,
                y1: 210,
                y2: 300
            },
            '1080_2248': {
                x1: 300,
                x2: 390,
                y1: 140,
                y2: 210
            }
        }
    },
    "地牢一层北2": {
        pic: "ditu_wugong_bei2.png",
        范围: {
            '720_1280': {
                x1: 760,
                x2: 875,
                y1: 180,
                y2: 280
            },
            '1080_2248': {
                x1: 305,
                x2: 400,
                y1: 140,
                y2: 200
            }
        }
    },
    "黑暗地带": {
        pic: "ditu_wugong_heiandidai.png",
        范围: {
            '720_1280': {
                x1: 600,
                x2: 680,
                y1: 130,
                y2: 210
            },
            '1080_2248': {
                x1: 240,
                x2: 340,
                y1: 140,
                y2: 200
            }
        }
    },
    "幽名圣域": {
        pic: "ditu_wugong_youmingshengyu.png",
        范围: {
            '720_1280': {
                x1: 170,
                x2: 230,
                y1: 90,
                y2: 140
            },
            '1080_2248': {
                x1: 240,
                x2: 340,
                y1: 140,
                y2: 200
            }
        }
    },
    "传奇部落": {
        pic: "ditu_wugong_chuanqibuluo.png",
        范围: {
            '720_1280': {
                x1: 620,
                x2: 720,
                y1: 400,
                y2: 470
            },
            '1080_2248': {
                x1: 245,
                x2: 345,
                y1: 140,
                y2: 200
            }
        }
    },
    "邪恶势力": {
        pic: "ditu_wugong_xieeshili.png",
        范围: {
            '720_1280': {
                x1: 140,
                x2: 240,
                y1: 75,
                y2: 150
            },
            '1080_2248': {
                x1: 245,
                x2: 345,
                y1: 140,
                y2: 200
            }
        }
    },
    "一线天": {
        pic: "ditu_wugong_yixiantian.png",
        范围: {
            '720_1280': {
                x1: 150,
                x2: 250,
                y1: 100,
                y2: 140
            },
            '1080_2248': {
                x1: 210,
                x2: 310,
                y1: 140,
                y2: 200
            }
        }
    },
    "恐怖空间": {
        pic: "ditu_wugong_kongbukongjian.png",
        范围: {
            '720_1280': {
                x1: 110,
                x2: 200,
                y1: 80,
                y2: 150
            },
            '1080_2248': {
                x1: 190,
                x2: 280,
                y1: 140,
                y2: 200
            }
        }
    },
    "死亡棺材": {
        pic: "ditu_wugong_shiwangguancai.png",
        范围: {
            '720_1280': {
                x1: 150,
                x2: 240,
                y1: 80,
                y2: 150
            },
            '1080_2248': {
                x1: 250,
                x2: 340,
                y1: 140,
                y2: 200
            }
        }
    },
    "生死之间": {
        pic: "ditu_wugong_shensizhijian.png",
        范围: {
            '720_1280': {
                x1: 110,
                x2: 200,
                y1: 80,
                y2: 150
            },
            '1080_2248': {
                x1: 190,
                x2: 280,
                y1: 140,
                y2: 200
            }
        }
    },
    "兽人古墓一层": {
        pic: "ditu_kuloudong_1.png",
        范围: {
            '720_1280': {
                x1: 370,
                x2: 450,
                y1: 510,
                y2: 600
            },
            '1080_2248': {
            }
        }
    },
    "兽人古墓二层": {
        pic: "ditu_kuloudong_2.png",
        范围: {
            '720_1280': {
                x1: 520,
                x2: 600,
                y1: 270,
                y2: 350
            },
            '1080_2248': {
            }
        }
    },
    "兽人古墓三层": {
        pic: "ditu_kuloudong_3.png",
        范围: {
            '720_1280': {
                x1: 650,
                x2: 720,
                y1: 420,
                y2: 500
            },
            '1080_2248': {
            }
        }
    },
    "石墓一层": {
        pic: "ditu_shimu_1.png",
        范围: {
            '720_1280': {
                x1: 160,
                x2: 210,
                y1: 90,
                y2: 140
            },
            '1080_2248': {
            }
        }
    },
    "石墓二层": {
        pic: "ditu_shimu_2.png",
        范围: {
            '720_1280': {
                x1: 160,
                x2: 210,
                y1: 90,
                y2: 140
            },
            '1080_2248': {
            }
        }
    },
    "石墓三层": {
        pic: "ditu_shimu_3.png",
        范围: {
            '720_1280': {
                x1: 160,
                x2: 210,
                y1: 90,
                y2: 140
            },
            '1080_2248': {
            }
        }
    },
    "石墓四层": {
        pic: "ditu_shimu_4.png",
        范围: {
            '720_1280': {
                x1: 160,
                x2: 210,
                y1: 90,
                y2: 140
            },
            '1080_2248': {
            }
        }
    },
    "石墓五层": {
        pic: "ditu_shimu_5.png",
        范围: {
            '720_1280': {
                x1: 160,
                x2: 210,
                y1: 90,
                y2: 140
            },
            '1080_2248': {
            }
        }
    },
}
config.地图跳转表 = {
    "苍月": {
        "回老兵": [
            [
                ["苍月大城", "苍月老兵"],
            ]
        ],
        "骨魔洞一层": [
            [
                ["苍月大城", "骨魔洞一层"],
                ["骨魔洞一层", "打怪点", 0]
            ]
        ],
        "骨魔洞二层": [
            [
                ["苍月大城", "骨魔洞一层"],
                ["骨魔洞一层", "骨魔洞二层"],
                ["骨魔洞二层", "打怪点", 0]
            ]
        ],
        "骨魔洞三层": [
            [
                ["苍月大城", "骨魔洞一层"],
                ["骨魔洞一层", "骨魔洞二层"],
                ["骨魔洞二层", "骨魔洞三层"],
                ["骨魔洞三层", "打怪点", 0]
            ]
        ],
        "牛魔寺庙一层": [
            [
                ["苍月大城", "牛魔寺庙入口"],
                ["牛魔寺庙入口", "牛魔寺庙一层"],
                ["牛魔寺庙一层", "打怪点", 0]
            ]
        ],
        "牛魔寺庙二层": [
            [
                ["苍月大城", "牛魔寺庙入口"],
                ["牛魔寺庙入口", "牛魔寺庙一层"],
                ["牛魔寺庙一层", "打怪点", 0]
            ]
        ],
        "牛魔寺庙三层": [
            [
                ["苍月大城", "牛魔寺庙入口"],
                ["牛魔寺庙入口", "牛魔寺庙一层"],
                ["牛魔寺庙一层", "打怪点", 0]
            ]
        ],
        "牛魔寺庙四层": [
            [
                ["苍月大城", "牛魔寺庙入口"],
                ["牛魔寺庙入口", "牛魔寺庙一层"],
                ["牛魔寺庙一层", "打怪点", 0]
            ]
        ],
    },
    "骨魔洞一层": {
        "骨魔洞二层": [
            [
                ["骨魔洞一层", "骨魔洞二层"],
                ["骨魔洞二层", "打怪点", 0]
            ]
        ],
        "骨魔洞三层": [
            [
                ["骨魔洞一层", "骨魔洞二层"],
                ["骨魔洞二层", "骨魔洞三层"],
                ["骨魔洞三层", "打怪点", 0]
            ]
        ],
        "骨魔洞四层": [
            [
                ["骨魔洞一层", "骨魔洞二层"],
                ["骨魔洞二层", "骨魔洞三层"],
                ["骨魔洞三层", "骨魔洞四层"],
                ["骨魔洞四层", "打怪点", 0]
            ]
        ],
        "回老兵": [
            [
                ["骨魔洞一层", "苍月岛"],
                ["苍月大城", "苍月老兵"],
            ]
        ],
    },
    "骨魔洞二层": {
        "骨魔洞一层": [
            [
                ["骨魔洞二层", "骨魔洞一层"],
                ["骨魔洞一层", "打怪点", 0]
            ]
        ],
        "骨魔洞三层": [
            [
                ["骨魔洞二层", "骨魔洞三层"],
                ["骨魔洞三层", "打怪点", 0]
            ]
        ],
        "骨魔洞四层": [
            [
                ["骨魔洞二层", "骨魔洞三层"],
                ["骨魔洞三层", "骨魔洞四层"],
                ["骨魔洞四层", "打怪点", 0]
            ]
        ],
        "回老兵": [
            [
                ["骨魔洞二层", "骨魔洞一层"],
                ["骨魔洞一层", "苍月岛"],
                ["苍月大城", "苍月老兵"],
            ]
        ],
    },
    "骨魔洞三层": {
        "骨魔洞一层": [
            [
                ["骨魔洞三层", "骨魔洞二层"],
                ["骨魔洞二层", "骨魔洞一层"],
                ["骨魔洞一层", "打怪点", 0]
            ]
        ],
        "骨魔洞二层": [
            [
                ["骨魔洞三层", "骨魔洞二层"],
                ["骨魔洞二层", "打怪点", 0]
            ]
        ],
        "回老兵": [
            [

                ["骨魔洞三层", "骨魔洞二层"],
                ["骨魔洞二层", "骨魔洞一层"],
                ["骨魔洞一层", "苍月岛"],
                ["苍月大城", "苍月老兵"],
            ]
        ],
    },
    "牛魔寺庙入口": {
        "回老兵": [
            [
                ["牛魔寺庙入口", "苍月岛"],
                ["苍月大城", "苍月老兵"],
            ]
        ],
        "牛魔寺庙一层": [
            [
                ["牛魔寺庙入口", "牛魔寺庙一层"],
                ["牛魔寺庙一层", "打怪点", 0]
            ]
        ],
        "牛魔寺庙二层": [
            [
                ["牛魔寺庙入口", "牛魔寺庙一层"],
                ["牛魔寺庙一层", "打怪点", 0]
            ]
        ],
        "牛魔寺庙三层": [
            [
                ["牛魔寺庙入口", "牛魔寺庙一层"],
                ["牛魔寺庙一层", "打怪点", 0]
            ]
        ],
        "牛魔寺庙四层": [
            [
                ["牛魔寺庙入口", "牛魔寺庙一层"],
                ["牛魔寺庙一层", "打怪点", 0]
            ]
        ],
    },
    "牛魔寺庙一层": {
        "回老兵": [
            [
                ["牛魔寺庙一层", "牛魔寺庙入口"],
                ["牛魔寺庙入口", "苍月岛"],
                ["苍月大城", "苍月老兵"],
            ]
        ],
        "牛魔寺庙二层": [
            [
                ["牛魔寺庙一层", "牛魔寺庙二层"],
                ["牛魔寺庙二层", "打怪点", 0]
            ]
        ],
        "牛魔寺庙三层": [
            [
                ["牛魔寺庙一层", "牛魔寺庙二层"],
                ["牛魔寺庙二层", "打怪点", 0]
            ]
        ],
        "牛魔寺庙四层": [
            [
                ["牛魔寺庙一层", "牛魔寺庙二层"],
                ["牛魔寺庙二层", "打怪点", 0]
            ]
        ],
        "下一层": {
            入口: {
                '720_1280': {
                    x: 370,
                    y: 257
                },
                '1080_2248': {
                }
            },
            进门: [
                ["牛魔寺庙一层", "牛魔寺庙二层"],
                ["牛魔寺庙二层", "打怪点", 0]
            ]
        },
    },
    "牛魔寺庙二层": {
        "回老兵": [
            [
                ["牛魔寺庙二层", "牛魔寺庙一层"],
                ["牛魔寺庙一层", "牛魔寺庙入口"],
                ["牛魔寺庙入口", "苍月岛"],
                ["苍月大城", "苍月老兵"],
            ]
        ],
        "牛魔寺庙一层": [
            [
                ["牛魔寺庙二层", "牛魔寺庙一层"],
                ["牛魔寺庙一层", "打怪点", 0]
            ]
        ],
        "牛魔寺庙三层": [
            [
                ["牛魔寺庙二层", "牛魔寺庙三层"],
                ["牛魔寺庙三层", "打怪点", 0]
            ]
        ],
        "牛魔寺庙四层": [
            [
                ["牛魔寺庙二层", "牛魔寺庙三层"],
                ["牛魔寺庙三层", "打怪点", 0]
            ]
        ],
        "下一层": {
            入口: {
                '720_1280': {
                    x: 761,
                    y: 530
                },
                '1080_2248': {
                }
            },
            进门: [
                ["牛魔寺庙二层", "牛魔寺庙三层"],
                ["牛魔寺庙三层", "打怪点", 0]
            ]
        },
    },
    "牛魔寺庙三层": {
        "回老兵": [
            [
                ["牛魔寺庙三层", "牛魔寺庙二层"],
                ["牛魔寺庙二层", "牛魔寺庙一层"],
                ["牛魔寺庙一层", "牛魔寺庙入口"],
                ["牛魔寺庙入口", "苍月岛"],
                ["苍月大城", "苍月老兵"],
            ]
        ],
        "牛魔寺庙一层": [
            [
                ["牛魔寺庙三层", "牛魔寺庙二层"],
                ["牛魔寺庙二层", "牛魔寺庙一层"],
                ["牛魔寺庙一层", "打怪点", 0]
            ]
        ],
        "牛魔寺庙二层": [
            [
                ["牛魔寺庙三层", "牛魔寺庙二层"],
                ["牛魔寺庙二层", "打怪点", 0]
            ]
        ],
        "牛魔寺庙四层": [
            [
                ["牛魔寺庙三层", "牛魔寺庙四层"],
                ["牛魔寺庙四层", "打怪点", 0]
            ]
        ],
        "下一层": {
            入口: {
                '720_1280': {
                    x: 838,
                    y: 555
                },
                '1080_2248': {
                }
            },
            进门: [
                ["牛魔寺庙三层", "牛魔寺庙四层"],
                ["牛魔寺庙四层", "打怪点", 0]
            ]
        },
    },
    "牛魔寺庙四层": {
        "回老兵": [
            [
                ["牛魔寺庙四层", "牛魔寺庙三层"],
                ["牛魔寺庙三层", "牛魔寺庙二层"],
                ["牛魔寺庙二层", "牛魔寺庙一层"],
                ["牛魔寺庙一层", "牛魔寺庙入口"],
                ["牛魔寺庙入口", "苍月岛"],
                ["苍月大城", "苍月老兵"],
            ]
        ],
        "牛魔寺庙一层": [
            [
                ["牛魔寺庙四层", "牛魔寺庙三层"],
                ["牛魔寺庙三层", "牛魔寺庙二层"],
                ["牛魔寺庙二层", "牛魔寺庙一层"],
                ["牛魔寺庙一层", "打怪点", 0]
            ]
        ],
        "牛魔寺庙二层": [
            [
                ["牛魔寺庙四层", "牛魔寺庙三层"],
                ["牛魔寺庙三层", "牛魔寺庙二层"],
                ["牛魔寺庙二层", "打怪点", 0]
            ]
        ],
        "牛魔寺庙三层": [
            [
                ["牛魔寺庙四层", "牛魔寺庙三层"],
                ["牛魔寺庙三层", "打怪点", 0]
            ]
        ],
    },
    "盟重": {
        "回老兵": [
            [
                ["盟重大城", "盟重老兵"],
            ]
        ],
        "阴森石屋": [
            [
                ["盟重大城", "地牢一层东"],
                ["地牢一层东", "阴森石屋"],
            ]
        ],
        "铁灯笼屋": [
            [
                ["盟重大城", "地牢一层东"],
                ["地牢一层东", "打怪点", 0]
            ]
        ],
        "地牢一层东": [
            [
                ["盟重大城", "地牢一层东"],
                ["地牢一层东", "打怪点", 0]
            ]
        ],
        "地牢一层北1": [
            [
                ["盟重大城", "地牢一层东"],
                ["地牢一层东", "打怪点", 0]
            ]
        ],
        "地牢一层西1": [
            [
                ["盟重大城", "地牢一层东"],
                ["地牢一层东", "打怪点", 0]
            ]
        ],
        "地牢一层北2": [
            [
                ["盟重大城", "地牢一层东"],
                ["地牢一层东", "打怪点", 0]
            ]
        ],
        "石墓小溪": [
            [
                ["盟重大城", "地牢一层东"],
                ["地牢一层东", "打怪点", 0]
            ]
        ],
        "黑暗地带": [
            [
                ["盟重大城", "地牢一层东"],
                ["地牢一层东", "打怪点", 0]
            ]
        ],
        "传奇部落": [
            [
                ["盟重大城", "地牢一层东"],
                ["地牢一层东", "打怪点", 0]
            ]
        ],
        "邪恶势力": [
            [
                ["盟重大城", "地牢一层东"],
                ["地牢一层东", "打怪点", 0]
            ]
        ],
        "一线天": [
            [
                ["盟重大城", "地牢一层东"],
                ["地牢一层东", "打怪点", 0]
            ]
        ],
        "死亡棺材": [
            [
                ["盟重大城", "地牢一层东"],
                ["地牢一层东", "打怪点", 0]
            ]
        ],
        "恐怖空间": [
            [
                ["盟重大城", "地牢一层东"],
                ["地牢一层东", "打怪点", 0]
            ]
        ],
        "生死之间": [
            [
                ["盟重大城", "地牢一层东"],
                ["地牢一层东", "打怪点", 0]
            ]
        ],
        "石墓入口": [
            [
                ["盟重大城", "石墓入口"]
            ]
        ],
        "石墓一层": [
            [
                ["盟重大城", "石墓入口"]
            ],
            [
                ["石墓入口", "石墓一层"],
                ["石墓一层", "打怪点", 0]
            ]
        ],
        "石墓二层": [
            [
                ["盟重大城", "石墓入口"]
            ],
            [
                ["石墓入口", "石墓一层"],
                ["石墓一层", "打怪点", 0]
            ]
        ],
        "石墓三层": [
            [
                ["盟重大城", "石墓入口"]
            ],
            [
                ["石墓入口", "石墓一层"],
                ["石墓一层", "打怪点", 0]
            ]
        ],
        "石墓四层": [
            [
                ["盟重大城", "石墓入口"]
            ],
            [
                ["石墓入口", "石墓一层"],
                ["石墓一层", "打怪点", 0]
            ]
        ],
        "石墓五层": [
            [
                ["盟重大城", "石墓入口"]
            ],
            [
                ["石墓入口", "石墓一层"],
                ["石墓一层", "打怪点", 0]
            ]
        ],
        "石墓阵": [
            [
                ["盟重大城", "石墓入口"]
            ],
            [
                ["石墓入口", "石墓一层"],
                ["石墓一层", "打怪点", 0]
            ]
        ],
        "武馆教头": [
            [
                ["盟重大城", "武馆教头"]
            ]
        ],
        "连接通道九": [
            [
                ["盟重大城", "地牢一层东"],
                ["地牢一层东", "连接通道九"],
                ["连接通道九", "打怪点", 0]
            ]
        ],
        "连接通道八": [
            [
                ["盟重大城", "地牢一层东"],
                ["地牢一层东", "连接通道九"],
                ["连接通道九", "连接通道八"],
                ["连接通道八", "打怪点", 0]
            ]
        ],
    },
    "石墓入口": {
        "回老兵": [
            [
                ["石墓入口", "盟重省"],
                ["盟重大城", "盟重老兵"],
            ]
        ],
        "石墓一层": [
            [
                ["石墓入口", "石墓一层"],
                ["石墓一层", "打怪点", 0],
            ]
        ],
        "石墓二层": [
            [
                ["石墓入口", "石墓一层"],
                ["石墓一层", "打怪点", 0],
            ]
        ],
        "石墓三层": [
            [
                ["石墓入口", "石墓一层"],
                ["石墓一层", "打怪点", 0],
            ]
        ],
        "石墓四层": [
            [
                ["石墓入口", "石墓一层"],
                ["石墓一层", "打怪点", 0],
            ]
        ],
        "石墓五层": [
            [
                ["石墓入口", "石墓一层"],
                ["石墓一层", "打怪点", 0],
            ]
        ],
        "石墓阵": [
            [
                ["石墓入口", "石墓一层"],
                ["石墓一层", "打怪点", 0],
            ]
        ],
    },
    "石墓一层": {
        "回老兵": [
            [
                ["石墓一层", "石墓入口"],
            ],
            [
                ["石墓入口", "盟重省"],
                ["盟重大城", "盟重老兵"],
            ]
        ],
        "石墓入口": [
            [
                ["石墓一层", "石墓入口"],
            ]
        ],
        "石墓二层": [
            [
                ["石墓一层", "石墓二层"],
                ["石墓二层", "打怪点", 0],
            ]
        ],
        "石墓三层": [
            [
                ["石墓一层", "石墓二层"],
                ["石墓二层", "打怪点", 0],
            ]
        ],
        "石墓四层": [
            [
                ["石墓一层", "石墓二层"],
                ["石墓二层", "打怪点", 0],
            ]
        ],
        "石墓五层": [
            [
                ["石墓一层", "石墓二层"],
                ["石墓二层", "打怪点", 0],
            ]
        ],
        "石墓阵": [
            [
                ["石墓一层", "石墓二层"],
                ["石墓二层", "打怪点", 0],
            ]
        ],
        "下一层": {
            入口: {
                '720_1280': {
                    x: 852,
                    y: 372
                }
            },
            进门: [
                ["石墓一层", "石墓二层"],
                ["石墓二层", "打怪点", 0],
            ]
        },
    },
    "石墓二层": {
        "回老兵": [
            [
                ["石墓二层", "石墓一层"],
                ["石墓一层", "石墓入口"],
            ],
            [
                ["石墓入口", "盟重省"],
                ["盟重大城", "盟重老兵"],
            ]
        ],
        "石墓入口": [
            [
                ["石墓二层", "石墓一层"],
                ["石墓一层", "石墓入口"],
            ]
        ],
        "石墓一层": [
            [
                ["石墓二层", "石墓一层"],
                ["石墓一层", "打怪点", 0],
            ]
        ],
        "石墓三层": [
            [
                ["石墓二层", "石墓三层"],
                ["石墓三层", "打怪点", 0],
            ]
        ],
        "石墓四层": [
            [
                ["石墓二层", "石墓三层"],
                ["石墓三层", "打怪点", 0],
            ]
        ],
        "石墓五层": [
            [
                ["石墓二层", "石墓三层"],
                ["石墓三层", "打怪点", 0],
            ]
        ],
        "石墓阵": [
            [
                ["石墓二层", "石墓三层"],
                ["石墓三层", "打怪点", 0],
            ]
        ],
        "下一层": {
            入口: {
                '720_1280': {
                    x: 188,
                    y: 326
                }
            },
            进门: [
                ["石墓二层", "石墓三层"],
                ["石墓三层", "打怪点", 0],
            ]
        },
    },
    "石墓三层": {
        "回老兵": [
            [
                ["石墓三层", "石墓二层"],
                ["石墓二层", "石墓一层"],
                ["石墓一层", "石墓入口"],
            ],
            [
                ["石墓入口", "盟重省"],
                ["盟重大城", "盟重老兵"],
            ]
        ],
        "石墓入口": [
            [
                ["石墓三层", "石墓二层"],
                ["石墓二层", "石墓一层"],
                ["石墓一层", "石墓入口"],
            ]
        ],
        "石墓一层": [
            [
                ["石墓三层", "石墓二层"],
                ["石墓二层", "石墓一层"],
                ["石墓一层", "打怪点", 0],
            ]
        ],
        "石墓二层": [
            [
                ["石墓三层", "石墓二层"],
                ["石墓二层", "打怪点", 0],
            ]
        ],
        "石墓四层": [
            [
                ["石墓三层", "石墓四层"],
                ["石墓四层", "打怪点", 0],
            ]
        ],
        "石墓五层": [
            [
                ["石墓三层", "石墓四层"],
                ["石墓四层", "打怪点", 0],
            ]
        ],
        "石墓阵": [
            [
                ["石墓三层", "石墓四层"],
                ["石墓四层", "打怪点", 0],
            ]
        ],
        "下一层": {
            入口: {
                '720_1280': {
                    x: 823,
                    y: 396,
                }
            },
            进门: [
                ["石墓三层", "石墓四层"],
                ["石墓四层", "打怪点", 0],
            ]
        },
    },
    "石墓四层": {
        "回老兵": [
            [
                ["石墓四层", "石墓三层"],
                ["石墓三层", "石墓二层"],
                ["石墓二层", "石墓一层"],
                ["石墓一层", "石墓入口"],
            ],
            [
                ["石墓入口", "盟重省"],
                ["盟重大城", "盟重老兵"],
            ]
        ],
        "石墓入口": [
            [
                ["石墓四层", "石墓三层"],
                ["石墓三层", "石墓二层"],
                ["石墓二层", "石墓一层"],
                ["石墓一层", "石墓入口"],
            ]
        ],
        "石墓一层": [
            [
                ["石墓四层", "石墓三层"],
                ["石墓三层", "石墓二层"],
                ["石墓二层", "石墓一层"],
                ["石墓一层", "打怪点", 0],
            ]
        ],
        "石墓二层": [
            [
                ["石墓四层", "石墓三层"],
                ["石墓三层", "石墓二层"],
                ["石墓二层", "打怪点", 0],
            ]
        ],
        "石墓三层": [
            [
                ["石墓四层", "石墓三层"],
                ["石墓三层", "打怪点", 0],
            ]
        ],
        "石墓五层": [
            [
                ["石墓四层", "石墓五层"],
                ["石墓五层", "打怪点", 0],
            ]

        ],
        "石墓阵": [
            [
                ["石墓四层", "石墓五层"],
                ["石墓五层", "打怪点", 0],
            ]
        ],
        "下一层": {
            入口: {
                '720_1280': {
                    x: 151,
                    y: 338,
                }
            },
            进门: [
                ["石墓四层", "石墓五层"],
                ["石墓五层", "打怪点", 0],
            ]
        },
    },
    "石墓五层": {
        "回老兵": [
            [
                ["石墓五层", "石墓四层"],
                ["石墓四层", "石墓三层"],
                ["石墓三层", "石墓二层"],
                ["石墓二层", "石墓一层"],
                ["石墓一层", "石墓入口"],
            ],
            [
                ["石墓入口", "盟重省"],
                ["盟重大城", "盟重老兵"],
            ]
        ],
        "石墓入口": [
            [
                ["石墓五层", "石墓四层"],
                ["石墓四层", "石墓三层"],
                ["石墓三层", "石墓二层"],
                ["石墓二层", "石墓一层"],
                ["石墓一层", "石墓入口"],
            ]
        ],
        "石墓一层": [
            [
                ["石墓五层", "石墓四层"],
                ["石墓四层", "石墓三层"],
                ["石墓三层", "石墓二层"],
                ["石墓二层", "石墓一层"],
                ["石墓一层", "打怪点", 0],
            ]
        ],
        "石墓二层": [
            [
                ["石墓五层", "石墓四层"],
                ["石墓四层", "石墓三层"],
                ["石墓三层", "石墓二层"],
                ["石墓二层", "打怪点", 0],
            ]
        ],
        "石墓三层": [
            [
                ["石墓五层", "石墓四层"],
                ["石墓四层", "石墓三层"],
                ["石墓三层", "打怪点", 0],
            ]
        ],
        "石墓四层": [
            [
                ["石墓五层", "石墓四层"],
                ["石墓四层", "打怪点", 0],
            ]
        ],
        "石墓阵": [
            [
                ["石墓阵", "打怪点", 0],
            ]
        ],
    },
    "地牢一层东": {
        "回老兵": [
            [
                ["地牢一层东", "盟重省"],
                ["盟重大城", "盟重老兵"],
            ]
        ],
        "阴森石屋": [
            [
                ["地牢一层东", "阴森石屋"],
            ]
        ],
        "连接通道九": [
            [
                ["地牢一层东", "连接通道九"],
                ["连接通道九", "打怪点", 0]
            ]
        ],
        "地牢一层北1": [
            [
                ["地牢一层东", "阴森石屋"]
            ],
            [
                ["阴森石屋", "地牢一层北1"],
                ["地牢一层北1", "打怪点", 0]
            ]
        ],
        "铁灯笼屋": [
            [
                ["地牢一层东", "铁灯笼屋"],
            ]
        ],
        "地牢一层西1": [
            [
                ["地牢一层东", "铁灯笼屋"],
            ]
        ],
        "地牢一层北2": [
            [
                ["地牢一层东", "铁灯笼屋"],
            ]
        ],
        "黑暗地带": [
            [
                ["地牢一层东", "铁灯笼屋"],
            ]
        ],
        "传奇部落": [
            [
                ["地牢一层东", "铁灯笼屋"],
            ]
        ],
        "邪恶势力": [
            [
                ["地牢一层东", "铁灯笼屋"],
            ]
        ],
        "一线天": [
            [
                ["地牢一层东", "铁灯笼屋"],
            ]
        ],
        "死亡棺材": [
            [
                ["地牢一层东", "铁灯笼屋"],
            ]
        ],
        "恐怖空间": [
            [
                ["地牢一层东", "铁灯笼屋"],
            ]
        ],
        "生死之间": [
            [
                ["地牢一层东", "铁灯笼屋"],
            ]
        ],
        "下一层": {
            入口: {
                '720_1280': {
                    x: 232,
                    y: 138
                },
                '1080_2248': {
                    x: 329,
                    y: 231
                }
            },
            进门: [
                ["地牢一层东", "铁灯笼屋"]
            ]
        },
    },
    "地牢一层北1": {
        "回老兵": [
            [
                ["地牢一层北1", "阴森石屋"],
            ],
            [
                ["阴森石屋", "地牢一层东"],
                ["地牢一层东", "盟重省"],
                ["盟重大城", "盟重老兵"],
            ]
        ],
        "阴森石屋": [
            [
                ["地牢一层北1", "阴森石屋"],
            ]
        ],
        "地牢一层东": [
            [
                ["阴森石屋", "地牢一层东"],
                ["地牢一层东", "打怪点", 0],
            ]
        ],
    },
    "铁灯笼屋": {
        "回老兵": [
            [
                ["铁灯笼屋", "地牢一层东"],
                ["地牢一层东", "盟重省"],
                ["盟重大城", "盟重老兵"],
            ]
        ],
        "地牢一层东": [
            [
                ["铁灯笼屋", "地牢一层东"],
                ["地牢一层东", "打怪点", 0],
            ]
        ],
        "地牢一层西1": [
            [
                ["铁灯笼屋", "地牢一层西1"],
                ["地牢一层西1", "打怪点", 0],
            ]
        ],
        "地牢一层北2": [
            [
                ["铁灯笼屋", "地牢一层西1"],
                ["地牢一层西1", "打怪点", 0],
            ]
        ],
        "黑暗地带": [
            [
                ["铁灯笼屋", "地牢一层西1"],
                ["地牢一层西1", "打怪点", 0],
            ]
        ],
        "传奇部落": [
            [
                ["铁灯笼屋", "地牢一层西1"],
                ["地牢一层西1", "打怪点", 0],
            ]
        ],
        "邪恶势力": [
            [
                ["铁灯笼屋", "地牢一层西1"],
                ["地牢一层西1", "打怪点", 0],
            ]
        ],
        "一线天": [
            [
                ["铁灯笼屋", "地牢一层西1"],
                ["地牢一层西1", "打怪点", 0],
            ]
        ],
        "死亡棺材": [
            [
                ["铁灯笼屋", "地牢一层西1"],
                ["地牢一层西1", "打怪点", 0],
            ]
        ],
        "恐怖空间": [
            [
                ["铁灯笼屋", "地牢一层西1"],
                ["地牢一层西1", "打怪点", 0],
            ]
        ],
        "生死之间": [
            [
                ["铁灯笼屋", "地牢一层西1"],
                ["地牢一层西1", "打怪点", 0],
            ]
        ],
        "下一层": {
            进门: [
                ["铁灯笼屋", "地牢一层西1"],
                ["地牢一层西1", "打怪点", 0],
            ]
        },
    },
    "阴森石屋": {
        "回老兵": [
            [
                ["阴森石屋", "地牢一层东"],
                ["地牢一层东", "盟重省"],
                ["盟重大城", "盟重老兵"],
            ]
        ],
        "地牢一层东": [
            [
                ["阴森石屋", "地牢一层东"],
                ["地牢一层东", "打怪点", 0],
            ]
        ],
        "地牢一层北1": [
            [
                ["阴森石屋", "地牢一层北1"],
                ["地牢一层北1", "打怪点", 0]
            ]
        ],
    },
    "阴森石路": {
        "回老兵": [
            [
                ["阴森石路", "地牢一层北1"],
                ["地牢一层北1", "阴森石屋"],
            ], [
                ["阴森石屋", "地牢一层东"],
                ["地牢一层东", "盟重省"],
                ["盟重大城", "盟重老兵"],
            ]
        ],
        "地牢一层北1": [
            [
                ["阴森石路", "地牢一层北1"],
                ["地牢一层北1", "打怪点", 0]
            ]
        ],
    },
    "紫水晶屋": {
        "回老兵": [
            [
                ["紫水晶屋", "地牢一层北1"],
                ["地牢一层北1", "阴森石屋"],
            ]
        ],
        "地牢一层北2": [
            [
                ["紫水晶屋", "地牢一层北2"],
                ["地牢一层北2", "打怪点", 0],
            ]
        ],
        "石墓小溪": [
            [
                ["紫水晶屋", "地牢一层北2"],
                ["地牢一层北2", "打怪点", 0],
            ]
        ],
    },
    "地牢一层西1": {
        "回老兵": [
            [
                ["地牢一层西1", "铁灯笼屋"],
            ],
            [
                ["铁灯笼屋", "地牢一层东"],
                ["地牢一层东", "盟重省"],
                ["盟重大城", "盟重老兵"],
            ]
        ],
        "铁灯笼屋": [
            [
                ["地牢一层西1", "铁灯笼屋"],
            ]
        ],
        "地牢一层东": [
            [
                ["地牢一层西1", "铁灯笼屋"],
            ]
        ],
        "阴森石路": [
            [
                ["地牢一层西1", "阴森石路"],
            ]
        ],
        "紫水晶屋": [
            [
                ["地牢一层西1", "地牢一层北2"],
                ["地牢一层北2", "打怪点", 0],
            ]
        ],
        "地牢一层北2": [
            [
                ["地牢一层西1", "地牢一层北2"],
                ["地牢一层北2", "打怪点", 0],
            ]
        ],
        "黑暗地带": [
            [
                ["地牢一层西1", "地牢一层北2"],
                ["地牢一层北2", "打怪点", 0],
            ]
        ],
        "传奇部落": [
            [
                ["地牢一层西1", "地牢一层北2"],
                ["地牢一层北2", "打怪点", 0],
            ]
        ],
        "邪恶势力": [
            [
                ["地牢一层西1", "地牢一层北2"],
                ["地牢一层北2", "打怪点", 0],
            ]
        ],
        "一线天": [
            [
                ["地牢一层西1", "地牢一层北2"],
                ["地牢一层北2", "打怪点", 0],
            ]
        ],
        "死亡棺材": [
            [
                ["地牢一层西1", "地牢一层北2"],
                ["地牢一层北2", "打怪点", 0],
            ]
        ],
        "恐怖空间": [
            [
                ["地牢一层西1", "地牢一层北2"],
                ["地牢一层北2", "打怪点", 0],
            ]
        ],
        "生死之间": [
            [
                ["地牢一层西1", "地牢一层北2"],
                ["地牢一层北2", "打怪点", 0],
            ]
        ],
        "下一层": {
            入口: {
                '720_1280': {
                    x: 256,
                    y: 144
                },
                '1080_2248': {
                    x: 384,
                    y: 229,
                }
            },
            进门: [
                ["地牢一层西1", "地牢一层北2"],
                ["地牢一层北2", "打怪点", 0],
            ]
        },
    },
    "地牢一层北2": {
        "回老兵": [
            [
                ["地牢一层北2", "地牢一层西1"],
                ["地牢一层西1", "铁灯笼屋"],
            ],
            [
                ["铁灯笼屋", "地牢一层东"],
                ["地牢一层东", "盟重省"],
                ["盟重大城", "盟重老兵"],
            ]
        ],
        "地牢一层东": [
            [
                ["地牢一层北2", "地牢一层西1"],
                ["地牢一层西1", "打怪点", 0],
            ]
        ],
        "地牢一层西1": [
            [
                ["地牢一层北2", "地牢一层西1"],
                ["地牢一层西1", "打怪点", 0],
            ]
        ],
        "石墓小溪": [
            [
                ["地牢一层北2", "石墓小溪"],
            ]
        ],
        "黑暗地带": [
            [
                ["地牢一层北2", "石墓小溪"],
            ]
        ],
        "传奇部落": [
            [
                ["地牢一层北2", "石墓小溪"],
            ]
        ],
        "邪恶势力": [
            [
                ["地牢一层北2", "石墓小溪"],
            ]
        ],
        "一线天": [
            [
                ["地牢一层北2", "石墓小溪"],
            ]
        ],
        "死亡棺材": [
            [
                ["地牢一层北2", "石墓小溪"],
            ]
        ],
        "恐怖空间": [
            [
                ["地牢一层北2", "石墓小溪"],
            ]
        ],
        "生死之间": [
            [
                ["地牢一层北2", "石墓小溪"],
            ]
        ],
        "下一层": {
            入口: {
                '720_1280': {
                    x: 327,
                    y: 414
                },
                '1080_2248': {
                    x: 459,
                    y: 659,
                }
            },
            进门: [
                ["地牢一层北2", "石墓小溪"],
            ]
        },
    },
    "石墓小溪": {
        "回老兵": [
            [
                ["石墓小溪", "地牢一层北2"],
                ["地牢一层北2", "地牢一层西1"],
                ["地牢一层西1", "铁灯笼屋"],
            ],
            [
                ["铁灯笼屋", "地牢一层东"],
                ["地牢一层东", "盟重省"],
                ["盟重大城", "盟重老兵"],
            ]
        ],
        "地牢一层东": [
            [
                ["石墓小溪", "地牢一层北2"],
                ["地牢一层北2", "打怪点", 0],
            ]
        ],
        "地牢一层北2": [
            [
                ["石墓小溪", "地牢一层北2"],
                ["地牢一层北2", "打怪点", 0],
            ]
        ],
        "黑暗地带": [
            [
                ["石墓小溪", "黑暗地带"],
                ["黑暗地带", "打怪点", 0],
            ]
        ],
        "传奇部落": [
            [
                ["石墓小溪", "黑暗地带"],
                ["黑暗地带", "打怪点", 0],
            ]
        ],
        "邪恶势力": [
            [
                ["石墓小溪", "黑暗地带"],
                ["黑暗地带", "打怪点", 0],
            ]
        ],
        "一线天": [
            [
                ["石墓小溪", "黑暗地带"],
                ["黑暗地带", "打怪点", 0],
            ]
        ],
        "死亡棺材": [
            [
                ["石墓小溪", "黑暗地带"],
                ["黑暗地带", "打怪点", 0],
            ]
        ],
        "恐怖空间": [
            [
                ["石墓小溪", "黑暗地带"],
                ["黑暗地带", "打怪点", 0],
            ]
        ],
        "生死之间": [
            [
                ["石墓小溪", "黑暗地带"],
                ["黑暗地带", "打怪点", 0],
            ]
        ],
        "下一层": {
            进门: [
                ["石墓小溪", "黑暗地带"],
                ["黑暗地带", "打怪点", 0],
            ]
        },
    },
    "黑暗地带": {
        "回老兵": [
            [
                ["黑暗地带", "石墓小溪"],
            ],
            [
                ["石墓小溪", "地牢一层北2"],
                ["地牢一层北2", "地牢一层西1"],
                ["地牢一层西1", "铁灯笼屋"],
            ],
            [
                ["铁灯笼屋", "地牢一层东"],
                ["地牢一层东", "盟重省"],
                ["盟重大城", "盟重老兵"],
            ]
        ],
        "地牢一层东": [
            [
                ["黑暗地带", "石墓小溪"],
            ]
        ],
        "石墓小溪": [
            [
                ["黑暗地带", "石墓小溪"],
            ]
        ],
        "地牢一层北2": [
            [
                ["黑暗地带", "石墓小溪"],
            ]
        ],
        "传奇部落": [
            [
                ["黑暗地带", "传奇部落"],
                ["传奇部落", "打怪点", 0],
            ]
        ],
        "邪恶势力": [
            [
                ["黑暗地带", "传奇部落"],
                ["传奇部落", "打怪点", 0],
            ]
        ],
        "一线天": [
            [
                ["黑暗地带", "传奇部落"],
                ["传奇部落", "打怪点", 0],
            ]
        ],
        "死亡棺材": [
            [
                ["黑暗地带", "传奇部落"],
                ["传奇部落", "打怪点", 0],
            ]
        ],
        "恐怖空间": [
            [
                ["黑暗地带", "传奇部落"],
                ["传奇部落", "打怪点", 0],
            ]
        ],
        "生死之间": [
            [
                ["黑暗地带", "传奇部落"],
                ["传奇部落", "打怪点", 0],
            ]
        ],
        "下一层": {
            入口: {
                '720_1280': {
                    x: 150,
                    y: 435
                },
                '1080_2248': {
                    x: 223,
                    y: 652,
                }
            },
            进门: [
                ["黑暗地带", "传奇部落"],
                ["传奇部落", "打怪点", 0],
            ]
        },
    },
    "幽名圣域": {
        "回老兵": [
            [
                ["幽名圣域", "黑暗地带"],
                ["黑暗地带", "打怪点", 0],
            ]
        ],
        "地牢一层东": [
            [
                ["幽名圣域", "黑暗地带"],
                ["黑暗地带", "打怪点", 0],
            ]
        ],
        "恐怖空间": [
            [
                ["幽名圣域", "恐怖空间"],
                ["恐怖空间", "打怪点", 0],
            ]
        ],
        "下一层": {
            入口: {
                '720_1280': {
                    x: 779,
                    y: 212
                },
                '1080_2248': {
                    x: 1182,
                    y: 307,
                }
            },
            进门: [
                ["幽名圣域", "恐怖空间"],
                ["恐怖空间", "打怪点", 0],
            ]
        },
    },
    "传奇部落": {
        "回老兵": [
            [
                ["传奇部落", "黑暗地带"],
                ["黑暗地带", "石墓小溪"],
            ],
            [
                ["石墓小溪", "地牢一层北2"],
                ["地牢一层北2", "地牢一层西1"],
                ["地牢一层西1", "铁灯笼屋"],
            ],
            [
                ["铁灯笼屋", "地牢一层东"],
                ["地牢一层东", "盟重省"],
                ["盟重大城", "盟重老兵"],
            ]
        ],
        "黑暗地带": [
            [
                ["传奇部落", "黑暗地带"],
                ["黑暗地带", "打怪点", 0],
            ]
        ],
        "地牢一层东": [
            [
                ["传奇部落", "黑暗地带"],
                ["黑暗地带", "打怪点", 0],
            ]
        ],
        "地牢一层北2": [
            [
                ["传奇部落", "黑暗地带"],
                ["黑暗地带", "打怪点", 0],
            ]
        ],
        "邪恶势力": [
            [
                ["传奇部落", "邪恶势力"],
                ["邪恶势力", "打怪点", 0],
            ]
        ],
        "一线天": [
            [
                ["传奇部落", "邪恶势力"],
                ["邪恶势力", "打怪点", 0],
            ]
        ],
        "死亡棺材": [
            [
                ["传奇部落", "邪恶势力"],
                ["邪恶势力", "打怪点", 0],
            ]
        ],
        "恐怖空间": [
            [
                ["传奇部落", "邪恶势力"],
                ["邪恶势力", "打怪点", 0],
            ]
        ],
        "生死之间": [
            [
                ["传奇部落", "邪恶势力"],
                ["邪恶势力", "打怪点", 0],
            ]
        ],
        "下一层": {
            入口: {
                '720_1280': {
                    x: 268,
                    y: 220
                },
                '1080_2248': {
                    x: 385,
                    y: 340,
                }
            },
            进门: [
                ["传奇部落", "邪恶势力"],
                ["邪恶势力", "打怪点", 0],
            ]
        },
    },
    "邪恶势力": {
        "回老兵": [
            [
                ["邪恶势力", "传奇部落"],
                ["传奇部落", "黑暗地带"],
                ["黑暗地带", "石墓小溪"],
            ],
            [
                ["石墓小溪", "地牢一层北2"],
                ["地牢一层北2", "地牢一层西1"],
                ["地牢一层西1", "铁灯笼屋"],
            ],
            [
                ["铁灯笼屋", "地牢一层东"],
                ["地牢一层东", "盟重省"],
                ["盟重大城", "盟重老兵"],
            ]
        ],
        "传奇部落": [
            [
                ["邪恶势力", "传奇部落"],
                ["传奇部落", "打怪点", 0],
            ]
        ],
        "地牢一层东": [
            [
                ["邪恶势力", "传奇部落"],
                ["传奇部落", "打怪点", 0],
            ]
        ],
        "地牢一层北2": [
            [
                ["邪恶势力", "传奇部落"],
                ["传奇部落", "打怪点", 0],
            ]
        ],
        "一线天": [
            [
                ["邪恶势力", "一线天"],
                ["一线天", "打怪点", 0],
            ]
        ],
        "死亡棺材": [
            [
                ["邪恶势力", "一线天"],
                ["一线天", "打怪点", 0],
            ]
        ],
        "恐怖空间": [
            [
                ["邪恶势力", "一线天"],
                ["一线天", "打怪点", 0],
            ]
        ],
        "生死之间": [
            [
                ["邪恶势力", "一线天"],
                ["一线天", "打怪点", 0],
            ]
        ],
        "下一层": {
            入口: {
                '720_1280': {
                    x: 757,
                    y: 476
                },
                '1080_2248': {
                    x: 1134,
                    y: 717,
                }
            },
            进门: [
                ["邪恶势力", "一线天"],
                ["一线天", "打怪点", 0],
            ]
        },
    },
    "一线天": {
        "回老兵": [
            [
                ["一线天", "邪恶势力"],
                ["邪恶势力", "传奇部落"],
                ["传奇部落", "黑暗地带"],
                ["黑暗地带", "石墓小溪"],
            ],
            [
                ["石墓小溪", "地牢一层北2"],
                ["地牢一层北2", "地牢一层西1"],
                ["地牢一层西1", "铁灯笼屋"],
            ],
            [
                ["铁灯笼屋", "地牢一层东"],
                ["地牢一层东", "盟重省"],
                ["盟重大城", "盟重老兵"],
            ]
        ],
        "地牢一层东": [
            [
                ["一线天", "邪恶势力"],
                ["邪恶势力", "打怪点", 0],
            ]
        ],
        "地牢一层北2": [
            [
                ["一线天", "邪恶势力"],
                ["邪恶势力", "打怪点", 0],
            ]
        ],
        "邪恶势力": [
            [
                ["一线天", "邪恶势力"],
                ["邪恶势力", "打怪点", 0],
            ]
        ],
        "死亡棺材": [
            [
                ["一线天", "死亡棺材"],
                ["死亡棺材", "打怪点", 0],
            ]
        ],
        "恐怖空间": [
            [
                ["一线天", "恐怖空间"],
                ["恐怖空间", "打怪点", 0],
            ]
        ],
        "生死之间": [
            [
                ["一线天", "生死之间"],
                ["生死之间", "打怪点", 0],
            ]
        ],
        // "下一层": {
        //     入口: {
        //         x: 680,
        //         y: 543
        //     },
        //     进门: [
        //         ["一线天", "死亡棺材"],
        //         ["死亡棺材", "打怪点", 0],
        //     ]
        // },
    },
    "恐怖空间": {
        "回老兵": [
            [
                ["恐怖空间", "一线天"],
                ["一线天", "邪恶势力"],
                ["邪恶势力", "传奇部落"],
                ["传奇部落", "黑暗地带"],
                ["黑暗地带", "石墓小溪"],
            ],
            [
                ["石墓小溪", "地牢一层北2"],
                ["地牢一层北2", "地牢一层西1"],
                ["地牢一层西1", "铁灯笼屋"],
            ],
            [
                ["铁灯笼屋", "地牢一层东"],
                ["地牢一层东", "盟重省"],
                ["盟重大城", "盟重老兵"],
            ]
        ],
        "一线天": [
            [
                ["恐怖空间", "一线天"],
                ["一线天", "打怪点", 0],
            ]
        ],
        "地牢一层东": [
            [
                ["恐怖空间", "一线天"],
                ["一线天", "打怪点", 0],
            ]
        ],
    },
    "生死之间": {
        "回老兵": [
            [
                ["生死之间", "一线天"],
                ["一线天", "邪恶势力"],
                ["邪恶势力", "传奇部落"],
                ["传奇部落", "黑暗地带"],
                ["黑暗地带", "石墓小溪"],
            ],
            [
                ["石墓小溪", "地牢一层北2"],
                ["地牢一层北2", "地牢一层西1"],
                ["地牢一层西1", "铁灯笼屋"],
            ],
            [
                ["铁灯笼屋", "地牢一层东"],
                ["地牢一层东", "盟重省"],
                ["盟重大城", "盟重老兵"],
            ]
        ],
        "一线天": [
            [
                ["生死之间", "一线天"],
                ["一线天", "打怪点", 0],
            ]
        ],
        "地牢一层东": [
            [
                ["生死之间", "一线天"],
                ["一线天", "打怪点", 0],
            ]
        ],
    },
    "死亡棺材": {
        "回老兵": [
            [
                ["死亡棺材", "一线天"],
                ["一线天", "邪恶势力"],
                ["邪恶势力", "传奇部落"],
                ["传奇部落", "黑暗地带"],
                ["黑暗地带", "石墓小溪"],
            ],
            [
                ["石墓小溪", "地牢一层北2"],
                ["地牢一层北2", "地牢一层西1"],
                ["地牢一层西1", "铁灯笼屋"],
            ],
            [
                ["铁灯笼屋", "地牢一层东"],
                ["地牢一层东", "盟重省"],
                ["盟重大城", "盟重老兵"],
            ]
        ],
        "一线天": [
            [
                ["死亡棺材", "一线天"],
                ["一线天", "打怪点", 0],
            ]
        ],
        "地牢一层东": [
            [
                ["生死之间", "一线天"],
                ["一线天", "打怪点", 0],
            ]
        ],
    },
    "比奇": {
        "比奇野外": [
            [
                ["比奇野外", "打怪点", 0],
            ]
        ],
        "兽人古墓一层": [
            [
                ["比奇大城", "兽人古墓一层"],
                ["兽人古墓一层", "打怪点", 0]
            ]
        ],
        "兽人古墓二层": [
            [
                ["比奇大城", "兽人古墓一层"],
                ["兽人古墓一层", "兽人古墓二层"],
                ["兽人古墓二层", "打怪点", 0]
            ]
        ],
        "兽人古墓三层": [
            [
                ["比奇大城", "兽人古墓一层"],
                ["兽人古墓一层", "兽人古墓二层"],
                ["兽人古墓二层", "兽人古墓三层"],
                ["兽人古墓三层", "打怪点", 0]
            ]
        ],
        "回老兵": [
            [
                ["比奇大城", "比奇老兵"],
            ]
        ],
        "沃玛森林": [
            [
                ["比奇大城", "沃玛森林"]
            ]
        ],
        "沃玛寺庙入口": [
            [
                ["比奇大城", "沃玛森林"],
                ["沃玛森林", "沃玛寺庙入口"]
            ]
        ],
        "沃玛寺庙一层": [
            [
                ["比奇大城", "沃玛森林"],
                ["沃玛森林", "沃玛寺庙入口"]
            ],
            [
                ["沃玛寺庙入口", "沃玛寺庙一层"],
                ["沃玛寺庙一层", "打怪点", 0],
            ]
        ],
        "沃玛寺庙二层": [
            [
                ["比奇大城", "沃玛森林"],
                ["沃玛森林", "沃玛寺庙入口"],
            ],
            [
                ["沃玛寺庙入口", "沃玛寺庙一层"],
                ["沃玛寺庙一层", "沃玛寺庙二层"],
                ["沃玛寺庙二层", "打怪点", 0],
            ]
        ],
    },
    "比奇野外": {
        "回老兵": [
            [
                ["比奇大城", "比奇老兵"],
            ]
        ]
    },
    "兽人古墓一层": {
        "兽人古墓二层": [
            [
                ["兽人古墓一层", "兽人古墓二层"],
                ["兽人古墓二层", "打怪点", 0]
            ]
        ],
        "兽人古墓三层": [
            [
                ["兽人古墓一层", "兽人古墓二层"],
                ["兽人古墓二层", "兽人古墓三层"],
                ["兽人古墓三层", "打怪点", 0]
            ]
        ],
        "回老兵": [
            [
                ["兽人古墓一层", "比奇省"],
                ["比奇大城", "比奇老兵"],
            ]
        ]
    },
    "兽人古墓二层": {
        "兽人古墓一层": [
            [
                ["兽人古墓二层", "兽人古墓一层"],
                ["兽人古墓一层", "打怪点", 0]
            ]
        ],
        "兽人古墓三层": [
            [
                ["兽人古墓二层", "兽人古墓三层"],
                ["兽人古墓三层", "打怪点", 0]
            ]
        ],
        "回老兵": [
            [
                ["兽人古墓二层", "兽人古墓一层"],
                ["兽人古墓一层", "比奇省"],
                ["比奇大城", "比奇老兵"],
            ]
        ]
    },
    "兽人古墓三层": {
        "兽人古墓二层": [
            [
                ["兽人古墓三层", "兽人古墓二层"],
                ["兽人古墓二层", "打怪点", 0]
            ]
        ],
        "兽人古墓一层": [
            [
                ["兽人古墓三层", "兽人古墓二层"],
                ["兽人古墓二层", "兽人古墓一层"],
                ["兽人古墓一层", "打怪点", 0]
            ]
        ],
        "回老兵": [
            [
                ["兽人古墓三层", "兽人古墓二层"],
                ["兽人古墓二层", "兽人古墓一层"],
                ["兽人古墓一层", "比奇省"],
                ["比奇大城", "比奇老兵"],
            ]
        ]
    },
    "沃玛森林": {
        "回老兵": [
            [
                ["沃玛森林", "比奇省"],
                ["比奇大城", "比奇老兵"]
            ]
        ],
        "沃玛寺庙入口": [
            [
                ["沃玛森林", "沃玛寺庙入口"]
            ]
        ],
        "沃玛寺庙一层": [
            [
                ["沃玛森林", "沃玛寺庙入口"],
            ],
            [
                ["沃玛寺庙入口", "沃玛寺庙一层"],
                ["沃玛寺庙一层", "打怪点", 0],
            ]
        ],
        "沃玛寺庙二层": [
            [
                ["沃玛森林", "沃玛寺庙入口"],
            ],
            [
                ["沃玛寺庙入口", "沃玛寺庙一层"],
                ["沃玛寺庙一层", "沃玛寺庙二层"],
                ["沃玛寺庙二层", "打怪点", 0],
            ]
        ],
    },
    "沃玛寺庙入口": {
        "回老兵": [
            [
                ["沃玛寺庙入口", "沃玛森林"],
                ["沃玛森林", "比奇省"],
                ["比奇大城", "比奇老兵"]
            ]
        ],
        "沃玛森林": [
            [
                ["沃玛寺庙入口", "沃玛森林"]
            ]
        ],
        "沃玛寺庙一层": [
            [
                ["沃玛寺庙入口", "沃玛寺庙一层"],
                ["沃玛寺庙一层", "打怪点", 0],
            ]
        ],
        "沃玛寺庙二层": [
            [
                ["沃玛寺庙入口", "沃玛寺庙一层"],
                ["沃玛寺庙一层", "沃玛寺庙二层"],
                ["沃玛寺庙二层", "打怪点", 0],
            ]
        ],
    },
    "沃玛寺庙一层": {
        "回老兵": [
            [
                ["沃玛寺庙一层", "沃玛寺庙入口"],
            ],
            [
                ["沃玛寺庙入口", "沃玛森林"],
                ["沃玛森林", "比奇省"],
                ["比奇大城", "比奇老兵"]
            ]
        ],
        "沃玛寺庙二层": [
            [
                ["沃玛寺庙一层", "沃玛寺庙二层"],
                ["沃玛寺庙二层", "打怪点", 0],
            ]
        ],
    },
    "沃玛寺庙二层": {
        "回老兵": [
            [
                ["沃玛寺庙二层", "沃玛寺庙一层"],
                ["沃玛寺庙一层", "沃玛寺庙入口"],
            ],
            [
                ["沃玛寺庙入口", "沃玛森林"],
                ["沃玛森林", "比奇省"],
                ["比奇大城", "比奇老兵"]
            ]
        ],
        "沃玛寺庙一层": [
            [
                ["沃玛寺庙二层", "沃玛寺庙一层"],
                ["沃玛寺庙一层", "打怪点", 0],
            ]
        ],
    },
    "连接通道九": {
        "回老兵": [
            ["连接通道九", "地牢一层东"],
            ["地牢一层东", "盟重省"],
            ["盟重大城", "盟重老兵"],
        ],
        "地牢一层东": [
            ["地牢一层东", "打怪点", 0]
        ]
    }
}
config.沿途打怪点 = ["兽人古墓一层", "兽人古墓二层", "兽人古墓三层", "沃玛寺庙入口", "沃玛寺庙一层", "沃玛寺庙二层",
    "地牢一层东", "地牢一层北1", "地牢一层西1", "黑暗地带", "地牢一层北2", "传奇部落", "邪恶势力", "一线天", "死亡棺材", "生死之间", "恐怖空间",
    "连接通道九", "连接通道八", "连接通道七", "连接通道六", "骨魔洞一层", "骨魔洞二层", "骨魔洞三层", "石墓三层", "石墓四层", "石墓五层",
    "牛魔寺庙一层", "牛魔寺庙二层", "牛魔寺庙三层", "牛魔寺庙四层", "牛魔寺庙五层"]
config.地图路由 = {
    "土城": config.地图跳转表["盟重"],
    "盟重省": config.地图跳转表["盟重"],
    "红名村": config.地图跳转表["盟重"],
    "沙巴克": config.地图跳转表["盟重"],
    "祖玛寺庙": config.地图跳转表["盟重"],
    "地牢一层东": config.地图跳转表["地牢一层东"],
    "地牢一层北1": config.地图跳转表["地牢一层北1"],
    "地牢一层西1": config.地图跳转表["地牢一层西1"],
    "地牢一层北2": config.地图跳转表["地牢一层北2"],
    "黑暗地带": config.地图跳转表["黑暗地带"],
    "传奇部落": config.地图跳转表["传奇部落"],
    "邪恶势力": config.地图跳转表["邪恶势力"],
    "一线天": config.地图跳转表["一线天"],
    "死亡棺材": config.地图跳转表["死亡棺材"],
    "生死之间": config.地图跳转表["生死之间"],
    "恐怖空间": config.地图跳转表["恐怖空间"],
    "幽名圣域": config.地图跳转表["幽名圣域"],

    "铁灯笼屋": config.地图跳转表["铁灯笼屋"],
    "阴森石屋": config.地图跳转表["阴森石屋"],
    "阴森石路": config.地图跳转表["阴森石路"],
    "紫水晶屋": config.地图跳转表["紫水晶屋"],
    "石墓小溪": config.地图跳转表["石墓小溪"],

    "连接通道九": config.地图跳转表["连接通道九"],
    "连接通道八": config.地图跳转表["连接通道八"],
    "连接通道七": config.地图跳转表["连接通道七"],
    "连接通道六": config.地图跳转表["连接通道六"],
    "石墓入口": config.地图跳转表["石墓入口"],
    "石墓一层": config.地图跳转表["石墓一层"],
    "石墓二层": config.地图跳转表["石墓二层"],
    "石墓三层": config.地图跳转表["石墓三层"],
    "石墓四层": config.地图跳转表["石墓四层"],
    "石墓五层": config.地图跳转表["石墓五层"],



    "苍月岛": config.地图跳转表["苍月"],
    "苍月岛渔村": config.地图跳转表["苍月"],
    "骨魔洞一层": config.地图跳转表["骨魔洞一层"],
    "骨魔洞二层": config.地图跳转表["骨魔洞二层"],
    "骨魔洞三层": config.地图跳转表["骨魔洞三层"],
    "牛魔寺庙入口": config.地图跳转表["牛魔寺庙入口"],
    "牛魔寺庙一层": config.地图跳转表["牛魔寺庙一层"],
    "牛魔寺庙二层": config.地图跳转表["牛魔寺庙二层"],
    "牛魔寺庙三层": config.地图跳转表["牛魔寺庙三层"],
    "牛魔寺庙四层": config.地图跳转表["牛魔寺庙四层"],
    "牛魔寺庙五层": config.地图跳转表["牛魔寺庙五层"],


    "比奇省": config.地图跳转表["比奇"],
    "比奇城": config.地图跳转表["比奇"],
    "银杏山谷": config.地图跳转表["比奇"],
    "边界村": config.地图跳转表["比奇"],
    "兽人古墓一层": config.地图跳转表["兽人古墓一层"],
    "兽人古墓二层": config.地图跳转表["兽人古墓二层"],
    "兽人古墓三层": config.地图跳转表["兽人古墓三层"],
    "沃玛森林": config.地图跳转表["沃玛森林"],
    "沃玛寺庙入口": config.地图跳转表["沃玛寺庙入口"],
    "沃玛寺庙一层": config.地图跳转表["沃玛寺庙一层"],
    "沃玛寺庙二层": config.地图跳转表["沃玛寺庙二层"],




}
config.禁止小退 = [
    "比奇省", "比奇城", "银杏山谷", "边界村", "盟重省", "红名村", "沙巴克", "土城", "祖玛寺庙"
]
config.城市对应 = {
    "比奇": ["比奇省", "比奇城", "银杏山谷", "边界村", "兽人古墓一层", "兽人古墓二层", "兽人古墓三层"],
    "盟重": ["盟重省", "红名村", "沙巴克", "土城", "祖玛寺庙"],
}
config.需存仓库装备 = [
    "炼狱", "魔杖", "银蛇", "井中月", "血饮", "无极棍", "裁决", "骨玉", "龙纹", "幽灵项链",
    "生命", "思贝儿", "心灵手镯", "龙之", "红宝石", "铂金", "绿色", "铃铛", "祝福",
    "灵魂项链", "骑士", "三眼", "力量", "紫碧", "泰坦", "组队", "100"] //这里100 是雪霜读出来的可能性最大
config.怪物集合 = {
    "兽人古墓": ["骷髅战士", "骷髅", "骷髅战将", "洞蛆", "掷斧骷髅"]
}
config.zuobiao = {
    石墓阵: {
        右: {
            x: 37,
            y: 16
        },
        左: {
            x: 13,
            y: 37
        },
        上: {
            x: 17,
            y: 12
        },
        下: {
            x: 37,
            y: 35
        }
    },
    走一格像素: {
        '720_1280': {
            x: 64,
            y: 43
        },
        '1080_2248': {
            x: 89,
            y: 60
        }
    },
    人物血条范围: {
        '720_1280': {
            x1: 618,
            x2: 661,
            y1: 243,
            y2: 249
        },
        '1080_2248': {
            x1: 1091,
            x2: 1155,
            y1: 384,
            y2: 391
        }
    },
    人物身边怪物: {
        '720_1280': [
            [618, 202, 50, 5], // 正上方
            [555, 202, 50, 5], // 左上方
            [681, 202, 50, 5], // 右上方

            [618, 287, 50, 5], // 正下方
            [555, 287, 50, 5], // 左下方
            [681, 287, 50, 5], // 右下方

            [555, 245, 50, 5], // 正左方
            [681, 245, 50, 5], // 正右方
        ],
        '1080_2248': [
            [1090, 327, 65, 8], // 正上方
            [1006, 327, 65, 8], // 左上方
            [1175, 327, 65, 8], // 右上方

            [1090, 440, 65, 8], // 正下方
            [1006, 440, 65, 8], // 左下方
            [1175, 440, 65, 8], // 右下方

            [1006, 384, 65, 8], // 正左方
            [1175, 384, 65, 8], // 正右方
        ],
    },
    截图回传: {
        '720_1280': {
            x1: 337,
            x2: 927,
            y1: 66,
            y2: 436,
        },
        '1080_2248': {
            x1: 662,
            x2: 1502,
            y1: 88,
            y2: 700,
        }
    },
    验证码: {
        '720_1280': {
            出现范围: {
                x1: 440,
                x2: 920,
                y1: 351,
                y2: 555
            },
            截图范围: {
                x1: 409,
                y1: 132,
                x2: 852,
                y2: 576
            },
            找色: [
                {
                    c1: "#7FDAFF",
                    x2: 0,
                    y2: -20,
                    c2: "#327FC6",
                    x3: 0,
                    y3: 33,
                    c3: "#FF0000",
                },
                {
                    c1: "#CBF1FF",
                    x2: 0,
                    y2: -20,
                    c2: "#68B3FF",
                    x3: 0,
                    y3: 33,
                    c3: "#FF0000",
                },
                {
                    c1: "#D0F2FF",
                    x2: 0,
                    y2: -20,
                    c2: "#69B4FF",
                    x3: 0,
                    y3: 33,
                    c3: "#FF0000",
                }
            ],
            云码偏移: 52,
            拖动条中心: {
                x: 455,
                y: 480,
            },
            刷新按钮: {
                x: 629,
                y: 532,
            }
        },
        '1080_2248': {
            出现范围: {
                x1: 816,
                x2: 1552,
                y1: 616,
                y2: 848
            },
            截图范围: {
                x1: 777,
                y1: 197,
                x2: 1443,
                y2: 871
            },
            找色: [
                {
                    c1: "#FF0000",
                    x2: 0,
                    y2: -58,
                    c2: "#88DEFF",
                    x3: 0,
                    y3: -89,
                    c3: "#337FC7",
                },
                {
                    c1: "#FF0000",
                    x2: 0,
                    y2: -62,
                    c2: "#B5E8FF",
                    x3: 0,
                    y3: -90,
                    c3: "#66B2FF",
                }
            ],
            云码偏移: 78,
            拖动条中心: {
                x: 848,
                y: 725,
            }
        }
    },
    好友顺序: {
        '720_1280': {
            x: 1005,
            y: [152, 222, 292, 358, 428, 496]
        },
        '1080_2248': {
            x: 1670,
            y: [235, 334, 433, 529, 644, 761]
        },
    },
    身边怪物范围: {
        '720_1280': {
            x1: 550,
            y1: 250,
            x2: 730,
            y2: 365
        },
        '1080_2248': {
            x1: 983,
            y1: 384,
            x2: 1261,
            y2: 533
        }
    },
    人物中心: {
        '720_1280': {
            x: 639,
            y: 296
        },
        '1080_2248': {
            x: 1123,
            y: 458
        }
    },
    人物血量所在格数: {
        '720_1280': {
            x: 9,
            y: 4
        },
        '1080_2248': {
        }
    },
    人物血量中心: {
        '720_1280': {
            x: 640,
            y: 246
        },
        '1080_2248': {
            x: 1092,
            y: 377
        }
    },
    人物血量左上: {
        '720_1280': {
            x: 619,
            y: 245
        },
        '1080_2248': {
            x: 1123,
            y: 380
        }
    },
    扫描拾取身边范围: {
        '720_1280': {
            x1: 280,
            x2: 915,
            y1: 0,
            y2: 560
        },
        '1080_2248': {
            x1: 510,
            x2: 1616,
            y1: 0,
            y2: 840
        }
    },
    扫描拾取全屏范围: {
        '720_1280': {
            x1: 0,
            x2: 1280,
            y1: 0,
            y2: 720
        },
        '1080_2248': {
            x1: 0,
            x2: 2248,
            y1: 0,
            y2: 950
        }
    },
    扫描拾取限制范围: {
        '720_1280': {
            x1: 480,
            x2: 886,
            y1: 500,
            y2: 720
        },
        '1080_2248': {
            x1: 905,
            x2: 1485,
            y1: 750,
            y2: 1080
        }
    },
    遥感中心位置: {
        '720_1280': {
            x: 134,
            y: 542
        },
        '1080_2248': {
            x: 288,
            y: 811
        }
    },
    锁定怪物100血范围: {
        '720_1280': {
            x1: 612,
            x2: 652,
            y1: 29,
            y2: 53
        },
        '1080_2248': {
            x1: 1050,
            x2: 1200,
            y1: 35,
            y2: 90
        }
    },
    中间怪物Btn范围: {
        '720_1280': {
            x1: 524,
            x2: 564,
            y1: 10,
            y2: 50
        },
        '1080_2248': {
            x1: 945,
            x2: 1016,
            y1: 9,
            y2: 80
        }
    },
    大范围扫描怪物名: {
        '720_1280': {
            x1: 280,
            y1: 55,
            x2: 915,
            y2: 555
        },
        '1080_2248': {
            x1: 450,
            x2: 1620,
            y1: 80,
            y2: 890
        }
    },
    人物点击范围: {
        '720_1280': {
            左边: [
                {
                    x1: 290,
                    x2: 350,
                    y1: 195,
                    y2: 345,
                    click: {
                        x: 320,
                        y: 352
                    }
                },
                {
                    x1: 355,
                    x2: 410,
                    y1: 195,
                    y2: 345,
                    click: {
                        x: 384,
                        y: 352
                    }
                },
                {
                    x1: 420,
                    x2: 475,
                    y1: 195,
                    y2: 345,
                    click: {
                        x: 450,
                        y: 352
                    }
                },
                {
                    x1: 480,
                    x2: 540,
                    y1: 195,
                    y2: 345,
                    click: {
                        x: 510,
                        y: 352
                    }
                },
                {
                    x1: 545,
                    x2: 600,
                    y1: 195,
                    y2: 345,
                    click: {
                        x: 575,
                        y: 352
                    }
                },
                {
                    x1: 285,
                    x2: 600,
                    y1: 195,
                    y2: 345,
                    click: {
                        x: 450,
                        y: 352
                    }
                }
            ],
            右边: [
                {
                    x1: 870,
                    x2: 920,
                    y1: 195,
                    y2: 345,
                    click: {
                        x: 895,
                        y: 352
                    }
                },
                {
                    x1: 800,
                    x2: 860,
                    y1: 195,
                    y2: 345,
                    click: {
                        x: 830,
                        y: 352
                    }
                },
                {
                    x1: 740,
                    x2: 795,
                    y1: 195,
                    y2: 345,
                    click: {
                        x: 770,
                        y: 352
                    }
                },
                {
                    x1: 675,
                    x2: 730,
                    y1: 195,
                    y2: 345,
                    click: {
                        x: 700,
                        y: 352
                    }
                },
                {
                    x1: 675,
                    x2: 920,
                    y1: 195,
                    y2: 345,
                    click: {
                        x: 700,
                        y: 333
                    }
                }
            ],
            上边: [
                {
                    x1: 610,
                    x2: 670,
                    y1: 100,
                    y2: 235,
                    click: {
                        x: 637,
                        y: 205
                    }
                },
                {
                    x1: 610,
                    x2: 670,
                    y1: 60,
                    y2: 220,
                    click: {
                        x: 637,
                        y: 166
                    }
                }
            ],
            下边: [
                {
                    x1: 610,
                    x2: 670,
                    y1: 325,
                    y2: 440,
                    click: {
                        x: 640,
                        y: 429
                    }
                },
                {
                    x1: 610,
                    x2: 670,
                    y1: 365,
                    y2: 480,
                    click: {
                        x: 640,
                        y: 468
                    }
                },
                {
                    x1: 610,
                    x2: 670,
                    y1: 275,
                    y2: 385,
                    click: {
                        x: 640,
                        y: 384
                    }
                },
                {
                    x1: 610,
                    x2: 670,
                    y1: 400,
                    y2: 555,
                    click: {
                        x: 637,
                        y: 540
                    }
                },
                {
                    x1: 610,
                    x2: 670,
                    y1: 280,
                    y2: 510,
                    click: {
                        x: 637,
                        y: 410
                    }
                }
            ],
        },
        '1080_2248': {
            左边: [
                {
                    x1: 998,
                    x2: 1071,
                    y1: 327,
                    y2: 552,
                    click: {
                        x: 1035,
                        y: 520
                    }
                },
                {
                    x1: 908,
                    x2: 981,
                    y1: 327,
                    y2: 552,
                    click: {
                        x: 945,
                        y: 520
                    }
                },
                {
                    x1: 819,
                    x2: 892,
                    y1: 327,
                    y2: 552,
                    click: {
                        x: 857,
                        y: 520
                    }
                },
                {
                    x1: 729,
                    x2: 802,
                    y1: 327,
                    y2: 552,
                    click: {
                        x: 765,
                        y: 520
                    }
                },
                {
                    x1: 640,
                    x2: 713,
                    y1: 327,
                    y2: 552,
                    click: {
                        x: 676,
                        y: 520
                    }
                },
                {
                    x1: 550,
                    x2: 623,
                    y1: 327,
                    y2: 552,
                    click: {
                        x: 585,
                        y: 520
                    }
                }
            ],
            右边: [
                {
                    x1: 1175,
                    x2: 1248,
                    y1: 327,
                    y2: 552,
                    click: {
                        x: 1213,
                        y: 520
                    }
                },
                {
                    x1: 1265,
                    x2: 1338,
                    y1: 327,
                    y2: 552,
                    click: {
                        x: 1300,
                        y: 520
                    }
                },
                {
                    x1: 1354,
                    x2: 1427,
                    y1: 327,
                    y2: 552,
                    click: {
                        x: 1391,
                        y: 520
                    }
                },
                {
                    x1: 1444,
                    x2: 1517,
                    y1: 327,
                    y2: 552,
                    click: {
                        x: 1479,
                        y: 520
                    }
                },
                {
                    x1: 1533,
                    x2: 1606,
                    y1: 327,
                    y2: 552,
                    click: {
                        x: 1570,
                        y: 520
                    }
                }
            ],
            上边: [
                {
                    x1: 1087,
                    x2: 1159,
                    y1: 76,
                    y2: 193,
                    click: {
                        x: 1120,
                        y: 162
                    }
                },
                {
                    x1: 1087,
                    x2: 1159,
                    y1: 148,
                    y2: 372,
                    click: {
                        x: 1125,
                        y: 328
                    }
                }
            ],
            下边: [
                {
                    x1: 1087,
                    x2: 1159,
                    y1: 387,
                    y2: 612,
                    click: {
                        x: 1121,
                        y: 568
                    }
                },
                {
                    x1: 1087,
                    x2: 1159,
                    y1: 447,
                    y2: 671,
                    click: {
                        x: 1121,
                        y: 652
                    }
                },
                {
                    x1: 1087,
                    x2: 1159,
                    y1: 506,
                    y2: 731,
                    click: {
                        x: 1121,
                        y: 715
                    }
                },
                {
                    x1: 1087,
                    x2: 1159,
                    y1: 566,
                    y2: 790,
                    click: {
                        x: 1121,
                        y: 780
                    }
                }
            ],
        }
    },
    人物点击范围全部: {
        '720_1280': [
            {
                x1: 290,
                x2: 350,
                y1: 195,
                y2: 345,
                click: {
                    x: 320,
                    y: 352
                }
            },
            {
                x1: 355,
                x2: 410,
                y1: 195,
                y2: 345,
                click: {
                    x: 384,
                    y: 352
                }
            },
            {
                x1: 420,
                x2: 475,
                y1: 195,
                y2: 345,
                click: {
                    x: 450,
                    y: 352
                }
            },
            {
                x1: 480,
                x2: 540,
                y1: 195,
                y2: 345,
                click: {
                    x: 510,
                    y: 352
                }
            },
            {
                x1: 545,
                x2: 600,
                y1: 195,
                y2: 345,
                click: {
                    x: 575,
                    y: 352
                }
            },
            {
                x1: 285,
                x2: 600,
                y1: 195,
                y2: 345,
                click: {
                    x: 450,
                    y: 352
                }
            },
            {
                x1: 870,
                x2: 920,
                y1: 195,
                y2: 345,
                click: {
                    x: 895,
                    y: 352
                }
            },
            {
                x1: 800,
                x2: 860,
                y1: 195,
                y2: 345,
                click: {
                    x: 830,
                    y: 352
                }
            },
            {
                x1: 740,
                x2: 795,
                y1: 195,
                y2: 345,
                click: {
                    x: 770,
                    y: 352
                }
            },
            {
                x1: 675,
                x2: 730,
                y1: 195,
                y2: 345,
                click: {
                    x: 700,
                    y: 352
                }
            },
            {
                x1: 675,
                x2: 920,
                y1: 195,
                y2: 345,
                click: {
                    x: 700,
                    y: 333
                }
            },
            {
                x1: 610,
                x2: 670,
                y1: 100,
                y2: 235,
                click: {
                    x: 637,
                    y: 205
                }
            },
            {
                x1: 610,
                x2: 670,
                y1: 60,
                y2: 220,
                click: {
                    x: 637,
                    y: 166
                }
            },
            {
                x1: 610,
                x2: 670,
                y1: 325,
                y2: 440,
                click: {
                    x: 640,
                    y: 429
                }
            },
            {
                x1: 610,
                x2: 670,
                y1: 365,
                y2: 480,
                click: {
                    x: 640,
                    y: 468
                }
            },
            {
                x1: 610,
                x2: 670,
                y1: 275,
                y2: 385,
                click: {
                    x: 640,
                    y: 384
                }
            },
            {
                x1: 610,
                x2: 670,
                y1: 400,
                y2: 555,
                click: {
                    x: 637,
                    y: 540
                }
            },
            {
                x1: 610,
                x2: 670,
                y1: 280,
                y2: 510,
                click: {
                    x: 637,
                    y: 410
                }
            }
        ],
        '1080_2248': []
    },
    怪物点击范围偏移: {
        '720_1280': [
            {
                text: "左边",
                info: {
                    x1: -80,
                    x2: -15,
                    y1: -75,
                    y2: 108,
                    click: {
                        x: -44,
                        y: 100
                    }
                }
            },
            {
                text: "左上",
                info: {
                    x1: -80,
                    x2: -15,
                    y1: -108,
                    y2: 75,
                    click: {
                        x: -44,
                        y: 0
                    }
                }
            },
            {
                text: "左下",
                info: {
                    x1: -80,
                    x2: -15,
                    y1: 15,
                    y2: 160,
                    click: {
                        x: -44,
                        y: 134
                    }
                }
            },
            {
                text: "右边",//Y轴为文字的位置
                info: {
                    x1: 51,
                    x2: 100,
                    y1: -108,
                    y2: 108,
                    click: {
                        x: 80,
                        y: 100
                    }
                }
            },
            {
                text: "右上",
                info: {
                    x1: 51,
                    x2: 100,
                    y1: -108,
                    y2: 75,
                    click: {
                        x: 80,
                        y: 0
                    }
                }
            },
            {
                text: "右下",
                info: {
                    x1: 51,
                    x2: 100,
                    y1: 15,
                    y2: 160,
                    click: {
                        x: 80,
                        y: 134
                    }
                }
            },
            {
                text: "上边",//Y轴为文字的位置
                info: {
                    x1: 0,
                    x2: 42,
                    y1: -160,
                    y2: -15,
                    click: {
                        x: 20,
                        y: -34
                    }
                }
            },
            {
                text: "下边",//Y轴为脚的位置
                info: {
                    x1: 0,
                    x2: 42,
                    y1: 15,
                    y2: 160,
                    click: {
                        x: 20,
                        y: 136
                    }
                }
            },
        ],
        '1080_2248': [
            {
                text: "左上",
                info: {
                    x1: -100,
                    x2: -18,
                    y1: -88,//上面空一格
                    y2: 88,//下面空一格
                    click: {
                        x: -53,
                        y: 62
                    }
                }
            },
            {
                text: "左边",
                info: {
                    x1: -100,
                    x2: -18,
                    y1: -15,//上面空0格
                    y2: 150,//下面空二格,允许第三格有血条
                    click: {
                        x: -53,
                        y: 138
                    }
                }
            },
            {
                text: "左下",
                info: {
                    x1: -100,
                    x2: -18,
                    y1: 15,//下面一格
                    y2: 200,//下面三格
                    click: {
                        x: -53,
                        y: 155
                    }
                }
            },
            {
                text: "右上",
                info: {
                    x1: 62,
                    x2: 140,
                    y1: -88,//上面空一格
                    y2: 88,//下面空一格
                    click: {
                        x: 111,
                        y: 62
                    }
                }
            },
            {
                text: "右边",//Y轴为文字的位置
                info: {
                    x1: 62,
                    x2: 140,
                    y1: -15,//上面空0格
                    y2: 150,//下面空二格,允许第三格有血条
                    click: {
                        x: 111,
                        y: 138
                    }
                }
            },
            {
                text: "右下",
                info: {
                    x1: 62,
                    x2: 140,
                    y1: 15,//下面一格
                    y2: 200,//下面三格
                    click: {
                        x: 111,
                        y: 155
                    }
                }
            },
            {
                text: "上边",//空三格
                info: {
                    x1: -5,
                    x2: 65,
                    y1: -200,
                    y2: -15,
                    click: {
                        x: 25,
                        y: -170
                    }
                }
            },
            {
                text: "下边",//空三格
                info: {
                    x1: -5,
                    x2: 65,
                    y1: 15,
                    y2: 200,
                    click: {
                        x: 25,
                        y: 170
                    }
                }
            },
        ]
    },
    左攻击面板: {
        '720_1280': {
            展开: {
                x: [10, 15],
                y: [210, 226]
            },
            切换: {
                x: [16, 26],
                y: [208, 228]
            },
            血量坐标: [
                {
                    x1: 96,
                    y1: 147,
                    x2: 233,
                    y2: 147,
                    c1: "#FA0100",
                    c2: "#FA4500",
                },
                {
                    x1: 96,
                    y1: 188,
                    x2: 233,
                    y2: 188,
                    c1: "#FA0100",
                    c2: "#FA4500",
                },
                {
                    x1: 96,
                    y1: 230,
                    x2: 233,
                    y2: 230,
                    c1: "#FA0100",
                    c2: "#FA4500",
                },
                {
                    x1: 96,
                    y1: 271,
                    x2: 233,
                    y2: 271,
                    c1: "#FA0100",
                    c2: "#FA4500",
                },
                {
                    x1: 96,
                    y1: 312,
                    x2: 233,
                    y2: 312,
                    c1: "#FA0100",
                    c2: "#FA4500",
                }
            ],
            选择怪物: {
                x: [14, 24],
                y: [280, 302]
            },
            选择怪物攻击: {
                x: [142, 182],
                y: [130, 142]
            },
            怪物集合: {
                x: [45, 239],
                y: [115, 325],
                h: 40,//文字左上距离血条的高度
                找色: [{
                    color: "#FF2300"
                }, {
                    color: "#FF4500",
                    x: 63,
                    y: 0
                }, {
                    color: "#C73600",
                    x: 72,
                    y: 0
                }],
                // 找色: [{
                //     color: "#6E3818"
                // }, {
                //     color: "#FF2300",
                //     x: 95,
                //     y: 8
                // }, {
                //     color: "#E73F00",
                //     x: 166,
                //     y: 8
                // }, {
                //     color: "#5D1A02",
                //     x: 168,
                //     y: 8
                // }],
                找色非满血: [{
                    color: "#C70000"
                }, {
                    color: "#FA0100",
                    x: 2,
                    y: 0
                }]
            },
            文字区域: {
                x1: 105,
                x2: 222,
                y1: 115,
                y2: 304
            },
            X血量中心: 165,
            Y轴顺序: [
                {
                    y1: 118,
                    y2: 155
                }, {
                    y1: 155,
                    y2: 197
                }, {
                    y1: 197,
                    y2: 238
                }, {
                    y1: 238,
                    y2: 279
                }, {
                    y1: 279,
                    y2: 326
                }
            ]
        },
        '1080_2248': {
            展开: {
                x: [100, 108],
                y: [305, 340]
            },
            切换: {
                x: [104, 131],
                y: [315, 334]
            },
            血量坐标: [
                {
                    x1: 233,
                    y1: 220,
                    x2: 440,
                    y2: 220,
                    c1: "#F90100",
                    c2: "#EC4100",
                },
                {
                    x1: 233,
                    y1: 282,
                    x2: 440,
                    y2: 282,
                    c1: "#F90100",
                    c2: "#EC4100",
                },
                {
                    x1: 233,
                    y1: 344,
                    x2: 440,
                    y2: 344,
                    c1: "#F90100",
                    c2: "#EC4100",
                },
                {
                    x1: 233,
                    y1: 407,
                    x2: 440,
                    y2: 407,
                    c1: "#F90100",
                    c2: "#EC4100",
                },
                {
                    x1: 233,
                    y1: 468,
                    x2: 440,
                    y2: 468,
                    c1: "#F90100",
                    c2: "#EC4100",
                }
            ],
            选择怪物: {
                x: [105, 132],
                y: [400, 450]
            },
            选择怪物攻击: {
                x: [310, 360],
                y: [190, 210]
            },
            怪物集合: {
                x: [155, 450],
                y: [170, 488],
                h: 70,//文字左上距离血条的高度
                找色: [{
                    color: "#FF2300"
                }, {
                    color: "#FF4500",
                    x: 93,
                    y: 0
                }, {
                    color: "#BB3200",
                    x: 108,
                    y: 0
                }],
                找色非满血: [{
                    color: "#C30000"
                }, {
                    color: "#ED0100",
                    x: 2,
                    y: 0
                }]
            },
            文字区域: {
                x1: 240,
                x2: 432,
                y1: 170,
                y2: 465
            },
            X血量中心: 340,
            Y轴顺序: [
                {
                    y1: 170,
                    y2: 235
                }, {
                    y1: 235,
                    y2: 296
                }, {
                    y1: 296,
                    y2: 357
                }, {
                    y1: 357,
                    y2: 418
                }, {
                    y1: 418,
                    y2: 488
                }
            ]
        }
    },
    设置面板: {
        '720_1280': {
            随机保护: {
                x: [268, 305],
                y: [429, 459]
            },
            血量加药: {
                x: [262, 305],
                y: [222, 260]
            },
            高亮显血自己: {
                x: [268, 305],
                y: [268, 305]
            },
            高亮显血组队: {
                x: [268, 305],
                y: [305, 340]
            },
        },
        '1080_2248': {
            随机保护: {
                x: [560, 630],
                y: [635, 700]
            },
        }
    },
    存取范围: {
        '720_1280': {
            仓库: {
                x: 12,
                y: 30,
                w: 500,
                h: 340,
                中心: {
                    x: 230,
                    y: 230
                }
            },
            包袱: {
                x: 670,
                y: 8,
                w: 485,
                h: 303,
                中心: {
                    x: 894,
                    y: 160
                }
            }
        },
        '1080_2248': {
            仓库: {
                x: 90,
                y: 35,
                w: 800,
                h: 550,
                中心: {
                    x: 524,
                    y: 260
                }
            },
            包袱: {
                x: 1075,
                y: 0,
                w: 800,
                h: 500,
                中心: {
                    x: 1500,
                    y: 240
                }
            }
        }
    },
    按钮集合: {
        '720_1280': {
            拾取: {
                x: [940, 960],
                y: [360, 370],
                默认: {
                    c1: "#E1EAFF",
                    x2: 14,
                    y2: 6,
                    c2: "#5674BD",
                    x3: 29,
                    y3: 23,
                    c3: "#557798",
                },
                激活: {
                    c1: "#F6FFFF",
                    x2: 14,
                    y2: 6,
                    c2: "#6EB9EB",
                    x3: 29,
                    y3: 23,
                    c3: "#92F1FC",
                }
            },
            宠物: {
                x: [940, 963],
                y: [276, 295],
            },
            普攻: {
                x: [1170, 1221],
                y: [580, 620]
            },
            组队: {
                x: [1153, 1179],
                y: [270, 296]
            },
            好友: {
                x: [1007, 1033],
                y: [270, 296]
            },
            打符: {
                x: [1211, 1246],
                y: [440, 470]
            },
            自愈: {
                x: [996, 1030],
                y: [450, 484]
            },
            隐身: {
                x: [1110, 1158],
                y: [470, 499]
            },
            打防: {
                x: [950, 991],
                y: [532, 576]
            },
            打魔: {
                x: [1145, 1188],
                y: [351, 395]
            },
            施毒: {
                x: [1021, 1068],
                y: [620, 660]
            },
            背包: {
                x: [1050, 1200],
                y: [150, 260]
            },
            角色: {
                x: [950, 1100],
                y: [150, 260]
            },
            小退: {
                x: [1198, 1276],
                y: [246, 329]
            },
            铺范围: {
                x: [878, 952],
                y: [626, 696]
            },
            召唤宝宝: {
                x: [1044, 1089],
                y: [529, 571]
            },
            技能冷却: {
                c1: "#FFFFFF",
                x2: 0,
                y2: 15,
                c2: "#FFFFFF",
                x3: 12,
                y3: 15,
                c3: "#FFFFFF",
            },
            模式: {
                x: [1225, 1254],
                y: [206, 225],
                找色: [{
                    color: "#F1F0EE"
                }, {
                    color: "#706452",
                    x: 8,
                    y: -9
                }, {
                    color: "#69666A",
                    x: 9,
                    y: 10
                }, {
                    color: "#625E5C",
                    x: 18,
                    y: 1
                }]
            },
            模式2: {
                x: [1225, 1254],
                y: [206, 225],
                找色: [{
                    color: "#F1F0EE"
                }, {
                    color: "#F1F0EE",
                    x: 8,
                    y: -9
                }, {
                    color: "#69666A",
                    x: 9,
                    y: 10
                }, {
                    color: "#625E5C",
                    x: 18,
                    y: 1
                }]
            },
            金令范围: {
                x1: 820,
                x2: 905,
                y1: 470,
                y2: 555,
            },
            充值范围: {
                x1: 415,
                x2: 478,
                y1: 615,
                y2: 673,
            },
            左第一个怪: {
                x: [58, 74],
                y: [126, 144]
            },
            左上箭头: {
                x: [18, 22],
                y: [50, 60]
            },
            分身派遣: {
                x: [130, 270],
                y: [460, 520]
            },
            分身派遣2: {
                x: [327, 367],
                y: [484, 504]
            },
            分身领取奖励: {
                x: [526, 645],
                y: [499, 558]
            },
            分身确定修炼: {
                x: [657, 798],
                y: [404, 472]
            },
            分身加时按钮: {
                x: [645, 760],
                y: [500, 555]
            },
            铺: {
                x: [910, 925],
                y: [660, 670]
            },
            铺关闭: {
                x: [1145, 1155],
                y: [64, 72]
            },
            捆药绳: {
                x: [550, 600],
                y: [415, 435]
            },
            购买物品: {
                x: [810, 850],
                y: [585, 595]
            },
            购买确定: {
                x: [700, 750],
                y: [430, 440]
            },
            万年雪霜包: {
                x: [260, 290],
                y: [90, 100]
            }
        },
        '1080_2248': {
            拾取: {
                x: [1542, 1642],
                y: [506, 596],
                默认: {
                    c1: "#E1EAFF",
                    x2: 14,
                    y2: 6,
                    c2: "#5674BD",
                    x3: 34,
                    y3: 8,
                    c3: "#5573BD",
                },
                激活: {
                    c1: "#F5FFFF",
                    x2: 17,
                    y2: 9,
                    c2: "#6EB9EB",
                    x3: 28,
                    y3: 17,
                    c3: "#66B5E9",
                }
            },
            宠物: {
                x: [1653, 1679],
                y: [412, 438],
            },
            普攻: {
                x: [1993, 2048],
                y: [880, 926]
            },
            组队: {
                x: [1973, 2004],
                y: [411, 442]
            },
            好友: {
                x: [1760, 1790],
                y: [408, 441]
            },
            打符: {
                x: [2062, 2100],
                y: [654, 700]
            },
            自愈: {
                x: [1732, 1773],
                y: [690, 730]
            },
            隐身: {
                x: [1914, 1985],
                y: [714, 755]
            },
            打防: {
                x: [1672, 1718],
                y: [807, 850]
            },
            打魔: {
                x: [1968, 2011],
                y: [539, 570]
            },
            施毒: {
                x: [1789, 1828],
                y: [940, 980]
            },
            背包: {
                x: [1867, 1893],
                y: [300, 335]
            },
            角色: {
                x: [1758, 1785],
                y: [305, 333]
            },
            小退: {
                x: [2074, 2107],
                y: [408, 440]
            },
            铺范围: {
                x: [1486, 1590],
                y: [950, 1040]
            },
            召唤宝宝: {
                x: [1820, 1870],
                y: [811, 854]
            },
            技能冷却: {
                c1: "#FFFFFF",
                x2: -18,
                y2: 0,
                c2: "#FFFFFF",
                x3: -18,
                y3: -24,
                c3: "#FFFFFF",
            },
            模式: {
                // x: [1225, 1254],
                // y: [206, 225],
                // 找色: [{
                //     color: "#F1F0EE"
                // }, {
                //     color: "#706452",
                //     x: 8,
                //     y: -9
                // }, {
                //     color: "#69666A",
                //     x: 9,
                //     y: 10
                // }, {
                //     color: "#625E5C",
                //     x: 18,
                //     y: 1
                // }]
            },
            模式2: {
                x: [2040, 2150],
                y: [270, 375],
                点击: {
                    x: 2094,
                    y: 325
                },
                找色: [{
                    color: "#F1F0EE"
                }, {
                    color: "#F1F0EE",
                    x: 13,
                    y: -14
                }, {
                    color: "#625E5C",
                    x: 28,
                    y: 1
                }, {
                    color: "#636265",
                    x: 15,
                    y: 14
                }]
            },
            金令范围: {
                x1: 1388,
                x2: 1520,
                y1: 705,
                y2: 840,
            },
            充值范围: {
                x1: 784,
                x2: 883,
                y1: 920,
                y2: 1015,
            },
            左上箭头: {
                x: [110, 117],
                y: [70, 88]
            },
            分身派遣: {
                x: [352, 573],
                y: [690, 785]
            },
            分身领取奖励: {
                x: [956, 1132],
                y: [760, 830]
            },
            分身确定修炼: {
                x: [1143, 1365],
                y: [600, 705]
            },
            分身加时按钮: {
                x: [1135, 1300],
                y: [760, 835]
            },
            铺: {
                x: [1526, 1550],
                y: [990, 1008]
            },
            铺关闭: {
                x: [1877, 1896],
                y: [92, 110]
            },
            捆药绳: {
                x: [868, 918],
                y: [624, 657]
            },
            购买物品: {
                x: [1346, 1457],
                y: [873, 897]
            },
            购买确定: {
                x: [1203, 1297],
                y: [644, 666]
            },
            万年雪霜包: {
                x: [460, 550],
                y: [133, 152]
            }
        },
    },
    苍月安全区坐标范围: {
        x1: 125,
        x2: 145,
        y1: 318,
        y2: 338
    },
    盟重安全区坐标范围: {
        x1: 321,
        x2: 340,
        y1: 321,
        y2: 340
    },
    比奇安全区坐标范围: {
        x1: 322,
        x2: 336,
        y1: 257,
        y2: 278
    },
    比奇老兵坐标: {
        x: 330,
        y: 270
    },
    比奇小贩坐标: {
        x: 326,
        y: 266
    },
    盟重小贩坐标: {
        x: 329,
        y: 325
    },
    苍月小贩坐标: {
        x: 137,
        y: 326
    },
    丢东西范围: {
        '720_1280': {
            x: [690, 720],
            y: [430, 500]
        },
        '1080_2248': {
            x: [1000, 1330],
            y: [664, 820]
        }
    },
    比奇小贩按钮: {
        '720_1280': {
            x1: 764,
            x2: 900,
            y1: 414,
            y2: 446
        },
        '1080_2248': {
            x1: 1365,
            x2: 1448,
            y1: 628,
            y2: 650
        }
    },
    比奇小贩面板: {
        购买物品: {
            '720_1280': {
                x1: 80,
                x2: 170,
                y1: 88,
                y2: 105
            },
            '1080_2248': {
                x1: 237,
                x2: 308,
                y1: 133,
                y2: 153
            }
        },
        出售物品: {
            '720_1280': {
                x1: 317,
                x2: 405,
                y1: 88,
                y2: 105
            },
            '1080_2248': {
                x1: 599,
                x2: 664,
                y1: 130,
                y2: 152
            }
        },
        普通修理: {
            '720_1280': {
                x1: 80,
                x2: 170,
                y1: 144,
                y2: 162
            },
            '1080_2248': {
                x1: 239,
                x2: 310,
                y1: 213,
                y2: 238
            }
        },
        特殊修理: {
            '720_1280': {
                x1: 317,
                x2: 405,
                y1: 144,
                y2: 162
            },
            '1080_2248': {
                x1: 595,
                x2: 663,
                y1: 214,
                y2: 239
            }
        },
        保存物品: {
            '720_1280': {
                x1: 80,
                x2: 170,
                y1: 202,
                y2: 217
            },
            '1080_2248': {
                x1: 240,
                x2: 300,
                y1: 300,
                y2: 327
            }
        }
    },
    药品格子面板: {
        '720_1280': {
            x1: 497,
            x2: 873,
            y1: 567,
            y2: 609,
            arr: [
                {
                    x1: 487,
                    x2: 553,
                    y1: 555,
                    y2: 620
                }, {
                    x1: 553,
                    x2: 618,
                    y1: 555,
                    y2: 620
                }, {
                    x1: 618,
                    x2: 685,
                    y1: 555,
                    y2: 620
                }, {
                    x1: 685,
                    x2: 750,
                    y1: 555,
                    y2: 620
                }, {
                    x1: 750,
                    x2: 816,
                    y1: 555,
                    y2: 620
                }, {
                    x1: 816,
                    x2: 880,
                    y1: 555,
                    y2: 620
                },
            ]
        },
        '1080_2248': {
            x1: 907,
            x2: 1478,
            y1: 847,
            y2: 921,
            arr: [
                {
                    x1: 902,
                    x2: 995,
                    y1: 842,
                    y2: 922
                }, {
                    x1: 995,
                    x2: 1093,
                    y1: 842,
                    y2: 922
                }, {
                    x1: 1093,
                    x2: 1192,
                    y1: 842,
                    y2: 922
                }, {
                    x1: 1192,
                    x2: 1292,
                    y1: 842,
                    y2: 922
                }, {
                    x1: 1292,
                    x2: 1392,
                    y1: 842,
                    y2: 922
                }, {
                    x1: 1392,
                    x2: 1492,
                    y1: 842,
                    y2: 922
                },
            ]
        }
    },
    聊天框面板: {
        '720_1280': {
            x1: 472,
            x2: 887,
            y1: 610,
            y2: 697
        },
        '1080_2248': {
            x1: 886,
            x2: 1492,
            y1: 922,
            y2: 1040
        }
    },
    聊天框最后一行: {
        '720_1280': {
            x1: 492,
            x2: 880,
            y1: 667,
            y2: 700,
        },
        '1080_2248': {
            x1: 888,
            x2: 1488,
            y1: 1007,
            y2: 1038
        }
    },
    打怪点偏移: {
        '720_1280': {
            x: 1142,
            y: 45
        },
        '1080_2248': {
            x: 1708,
            y: 76
        }
    },
    比奇大地图偏移: {
        '720_1280': {
            比奇大城: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                比奇老兵: {
                    x: [-80, -120],
                    y: [456, 476]
                },
                兽人古墓一层: {
                    x: [-80, -120],
                    y: [120, 140]
                },
                沃玛森林: {
                    x: [-80, -120],
                    y: [165, 185]
                },
            },
            沃玛森林: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                丛林迷宫: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                封魔谷: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                沃玛寺庙入口: {
                    x: [-80, -120],
                    y: [210, 230]
                },
                比奇省: {
                    x: [-80, -120],
                    y: [255, 275]
                }
            },
            比奇野外: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                打怪点: [
                    {
                        x: 567,
                        y: 348
                    },
                    {
                        x: 535,
                        y: 367,
                    },
                    {
                        x: 538,
                        y: 421,
                    },
                    {
                        x: 566,
                        y: 508,
                    },

                    {
                        x: 589,
                        y: 567,
                    },
                    {
                        x: 725,
                        y: 557,
                    },
                    {
                        x: 792,
                        y: 547,
                    },
                    {
                        x: 843,
                        y: 491,
                    },
                    {
                        x: 867,
                        y: 373,
                    },
                    {
                        x: 812,
                        y: 183,
                    },
                    {
                        x: 692,
                        y: 189,
                    },
                    {
                        x: 595,
                        y: 169,
                    },
                    {
                        x: 669,
                        y: 247,
                    },
                    {
                        x: 647,
                        y: 291,
                    },
                    {
                        x: 589,
                        y: 332,
                    }
                ]
            },
            沃玛寺庙入口: {
                是否沿途打怪: false,
                是否是断点: true,
                是否需要随机: false,
                沃玛森林: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                沃玛寺庙一层: {
                    x: [-80, -120],
                    y: [165, 185]
                }
            },
            沃玛寺庙一层: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                沃玛寺庙入口: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                沃玛寺庙二层: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: [-465, -460],
                        y: [402, 410],
                        坐标范围: {
                            点击次数: 5
                        }
                    },
                    {
                        x: [-605, -610],
                        y: [150, 155],
                        坐标范围: {
                            点击次数: 5
                        }
                    },
                    {
                        x: [-955, -945],
                        y: [260, 270],
                        坐标范围: {
                            点击次数: 5
                        }
                    },
                    {
                        x: [-636, -616],
                        y: [233, 253],
                        坐标范围: {
                            点击次数: 5
                        }
                    }
                ]
            },
            沃玛寺庙二层: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                沃玛寺庙一层: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                沃玛寺庙: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: [-580, -600],
                        y: [273, 293],
                        坐标范围: {
                            点击次数: 3
                        }
                    },
                    {
                        x: [-498, -492],
                        y: [523, 529],
                        坐标范围: {
                            点击次数: 5
                        }
                    },
                    {
                        x: [-630, -624],
                        y: [507, 513],
                        坐标范围: {
                            点击次数: 5
                        }
                    },
                    {
                        x: [-935, -931],
                        y: [503, 509],
                        坐标范围: {
                            点击次数: 25
                        }
                    }
                ]
            },
            兽人古墓一层: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                比奇省: {
                    x: [-80, -120],
                    y: [120, 140]
                },
                兽人古墓二层: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: 420,
                        y: 533,
                    },
                    {
                        x: 543,
                        y: 535,
                    },
                    {
                        x: 619,
                        y: 412,
                    },
                    {
                        x: 856,
                        y: 408,
                    },
                    {
                        x: 887,
                        y: 364,
                    },
                    {
                        x: 830,
                        y: 227,
                    },
                    {
                        x: 579,
                        y: 204,
                    },
                    {
                        x: 466,
                        y: 115,
                    },
                    {
                        x: 299,
                        y: 178,
                    },
                    {
                        x: 316,
                        y: 262,
                    },
                    {
                        x: 344,
                        y: 462,
                    },
                    {
                        x: 496,
                        y: 427,
                    }
                ]
            },
            兽人古墓二层: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                兽人古墓一层: {
                    x: [-80, -120],
                    y: [120, 140],
                },
                兽人古墓三层: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: 296,
                        y: 473,
                    },
                    // {
                    //     x: 527,
                    //     y: 451,
                    // },
                    {
                        x: 506,
                        y: 342,
                    },
                    {
                        x: 616,
                        y: 422,
                    },
                    {
                        x: 800,
                        y: 533,
                    },
                    {
                        x: 763,
                        y: 358,
                    },
                    {
                        x: 710,
                        y: 282,
                    },
                    {
                        x: 807,
                        y: 170,
                    },
                    {
                        x: 647,
                        y: 159,
                    },
                    {
                        x: 434,
                        y: 126,
                    },
                    {
                        x: 388,
                        y: 219,
                    },
                    {
                        x: 267,
                        y: 415,
                    },
                ]
            },
            兽人古墓三层: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                兽人古墓二层: {
                    x: [-80, -120],
                    y: [120, 140]
                },
                打怪点: [
                    {
                        x: [-830, -930],
                        y: [235, 275],
                        坐标范围: {
                            x: [265, 320],
                            y: [254, 320],
                            点击次数: 5
                        }
                    },
                    {
                        x: [-600, -700],
                        y: [300, 350],
                        坐标范围: {
                            x: [265, 320],
                            y: [254, 320],
                            点击次数: 5
                        }
                    },
                    {
                        x: [-500, -585],
                        y: [410, 470],
                        坐标范围: {
                            x: [265, 320],
                            y: [254, 320],
                            点击次数: 5
                        }
                    },
                    {
                        x: [-800, -855],
                        y: [400, 450],
                        坐标范围: {
                            x: [265, 320],
                            y: [254, 320],
                            点击次数: 5
                        }
                    },
                ]
            },
            僵尸洞: {
                第一层: {
                    比奇老兵: {
                        x: [-80, -120],
                        y: [456, 476]
                    },
                    废墟入口: {
                        x: [-80, -120],
                        y: [303, 323]
                    }
                }
            }
        }

    },
    盟重大地图偏移: {
        '720_1280': {
            盟重大城: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                盟重老兵: {
                    x: [-80, -120],
                    y: [415, 435]
                },
                地牢一层东: {
                    x: [-80, -120],
                    y: [163, 183]
                },
                石墓入口: {
                    x: [-80, -120],
                    y: [251, 271]
                },
                武馆教头: {
                    x: [-80, -120],
                    y: [512, 532]
                },
            },
            石墓入口: {
                是否沿途打怪: false,
                是否是断点: true,
                是否需要随机: false,
                盟重省: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                石墓一层: {
                    x: [-80, -120],
                    y: [165, 185]
                },
            },
            石墓一层: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                石墓入口: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                石墓二层: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: 691,
                        y: 214,
                    },
                    {
                        x: 852,
                        y: 372,
                    }
                ]
            },
            石墓二层: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                石墓一层: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                石墓三层: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: 752,
                        y: 176,
                    },
                    {
                        x: 624,
                        y: 135,
                    },
                    {
                        x: 426,
                        y: 147,
                    },
                    {
                        x: 187,
                        y: 328,
                    },
                    {
                        x: 405,
                        y: 441,
                    },
                    {
                        x: 622,
                        y: 415,
                    },
                    {
                        x: 739,
                        y: 160,
                    },
                    {
                        x: 603,
                        y: 276,
                    },
                    {
                        x: 508,
                        y: 368,
                    },
                    {
                        x: 419,
                        y: 276,
                    },
                    {
                        x: 628,
                        y: 131,
                    },
                    {
                        x: 424,
                        y: 156,
                    },
                    {
                        x: 188,
                        y: 326,
                    },
                ]
            },
            石墓三层: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                石墓二层: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                石墓四层: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: 428,
                        y: 157,
                    },
                    {
                        x: 624,
                        y: 135,
                    },
                    {
                        x: 428,
                        y: 299,
                    },
                    {
                        x: 571,
                        y: 317,
                    },
                    {
                        x: 712,
                        y: 204,
                    },
                    {
                        x: 811,
                        y: 282,
                    },
                    {
                        x: 822,
                        y: 395,
                    },
                    {
                        x: 442,
                        y: 521,
                    },
                    {
                        x: 486,
                        y: 364,
                    },
                    {
                        x: 816,
                        y: 270,
                    },
                    {
                        x: 823,
                        y: 396,
                    }
                ]
            },
            石墓四层: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                石墓三层: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                石墓五层: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: 513,
                        y: 546,
                    },
                    {
                        x: 152,
                        y: 338,
                    },
                    {
                        x: 288,
                        y: 303,
                    },
                    {
                        x: 416,
                        y: 259,
                    },
                    {
                        x: 297,
                        y: 227,
                    },
                    {
                        x: 523,
                        y: 152,
                    },
                    {
                        x: 711,
                        y: 210,
                    },
                    {
                        x: 524,
                        y: 324,
                    },
                    {
                        x: 404,
                        y: 520,
                    },
                    {
                        x: 567,
                        y: 410,
                    },
                    {
                        x: 627,
                        y: 450,
                    },
                    {
                        x: 672,
                        y: 340,
                    },
                    {
                        x: 810,
                        y: 289,
                    },
                    {
                        x: 592,
                        y: 517,
                    },
                    {
                        x: 151,
                        y: 338,
                    }
                ]
            },
            石墓五层: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                石墓四层: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                打怪点偏移: {
                    x: 1137,
                    y: 39
                },
                打怪点: [
                    {
                        x: 278,
                        y: 423,
                    },
                    {
                        x: 553,
                        y: 491,
                    },
                    {
                        x: 872,
                        y: 324,
                    },
                    {
                        x: 663,
                        y: 203,
                    },
                    {
                        x: 421,
                        y: 159,
                    },
                    {
                        x: 468,
                        y: 182,
                    },
                    {
                        x: 513,
                        y: 208,
                    },
                    {
                        x: 664,
                        y: 203,
                    },
                    {
                        x: 640,
                        y: 306,
                    },
                    {
                        x: 339,
                        y: 218,
                    },
                    {
                        x: 276,
                        y: 176,
                    },
                    {
                        x: 215,
                        y: 216,
                    },
                    {
                        x: 377,
                        y: 421,
                    },
                    {
                        x: 464,
                        y: 291,
                    },
                ]
            },
            石墓阵: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                打怪点: [
                    {
                        x: 283,
                        y: 188
                    },
                ]
            },
            地牢一层东: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                连接通道九: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                盟重省: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                铁灯笼屋: {
                    x: [-80, -120],
                    y: [210, 230]
                },
                阴森石屋: {
                    x: [-80, -120],
                    y: [260, 280]
                },
                打怪点: [
                    {
                        x: [-755, -800],
                        y: [247, 287],
                        坐标范围: {
                            x: [60, 101],
                            y: [90, 124],
                            点击次数: 8
                        }
                    },
                    {
                        x: [-900, -902],
                        y: [96, 98],
                        坐标范围: {
                            x: [31, 47],
                            y: [22, 34],
                            点击次数: 2
                        }
                    },
                    {
                        x: [-967, -971],
                        y: [447, 451],
                        坐标范围: {
                            x: [31, 47],
                            y: [22, 34],
                            点击次数: 2
                        }
                    },

                    {
                        x: [-433, -437],
                        y: [273, 277],
                        坐标范围: {
                            x: [178, 202],
                            y: [100, 129],
                            点击次数: 4
                        }
                    },
                    {
                        x: [-463, -467],
                        y: [120, 124],
                        坐标范围: {
                            x: [143, 173],
                            y: [39, 75],
                            点击次数: 5
                        }
                    },
                ]
            },
            连接通道九: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                连接通道八: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                地牢一层东: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: [-567, -547],
                        y: [439, 453],
                        坐标范围: {
                            x: [52, 70],
                            y: [74, 88],
                            点击次数: 1
                        }
                    },
                    {
                        x: [-772, -753],
                        y: [111, 139],
                        坐标范围: {
                            x: [29, 39],
                            y: [2, 20],
                            点击次数: 1
                        }
                    }
                ]
            },
            连接通道八: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                连接通道七: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                连接通道九: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: [-969, -942],
                        y: [341, 356],
                        坐标范围: {
                            x: [3, 20],
                            y: [73, 100],
                            点击次数: 5
                        }
                    },
                    {
                        x: [-297, -279],
                        y: [253, 264],
                        坐标范围: {
                            x: [130, 144],
                            y: [52, 77],
                            点击次数: 5
                        }
                    },
                    {
                        x: [-537, -490],
                        y: [221, 236],
                        坐标范围: {
                            x: [78, 106],
                            y: [35, 73],
                            点击次数: 5
                        }
                    }
                ]
            },
            连接通道七: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                连接通道六: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                连接通道八: {
                    x: [-80, -120],
                    y: [165, 185]
                }
            },
            连接通道六: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                连接通道七: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                连接通道九: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: [-957, -944],
                        y: [306, 318],
                        坐标范围: {
                            x: [4, 25],
                            y: [69, 88],
                            点击次数: 3
                        }
                    },
                    {
                        x: [-385, -347],
                        y: [452, 482],
                        坐标范围: {
                            x: [105, 145],
                            y: [107, 141],
                            点击次数: 3
                        }
                    },
                    {
                        x: [-830, -835],
                        y: [421, 429],
                        坐标范围: {
                            x: [105, 145],
                            y: [107, 141],
                            点击次数: 2
                        }
                    },
                    {
                        x: [-840, -827],
                        y: [296, 316],
                        坐标范围: {
                            x: [56, 89],
                            y: [62, 93],
                            点击次数: 3
                        }
                    },
                    {
                        x: [-485, -494],
                        y: [195, 205],
                        坐标范围: {
                            x: [56, 89],
                            y: [62, 93],
                            点击次数: 3
                        }
                    }
                ]
            },
            阴森石屋: {
                地牢一层东: {
                    x: [-80, -120],
                    y: [117, 137]
                },
                地牢一层北1: {
                    x: [-80, -120],
                    y: [163, 183]
                }
            },
            阴森石路: {
                地牢一层西2: {
                    x: [-80, -120],
                    y: [120, 140]
                },
                黑暗地带: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                地牢一层西1: {
                    x: [-80, -120],
                    y: [200, 220]
                },
                地牢一层北1: {
                    x: [-80, -120],
                    y: [260, 280]
                },
            },
            铁灯笼屋: {
                是否沿途打怪: false,
                是否是断点: true,
                是否需要随机: false,
                地牢一层东: {
                    x: [-80, -120],
                    y: [117, 137]
                },
                地牢一层西1: {
                    x: [-80, -120],
                    y: [163, 183]
                }
            },
            紫水晶屋: {
                是否沿途打怪: false,
                是否是断点: true,
                是否需要随机: false,
                地牢一层北2: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                地牢一层北1: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                地牢一层西2: {
                    x: [-80, -120],
                    y: [205, 225]
                }
            },
            石墓小溪: {
                地牢一层北2: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                黑暗地带: {
                    x: [-80, -120],
                    y: [165, 185]
                },
            },
            地牢一层北1: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                紫水晶屋: {
                    x: [-80, -120],
                    y: [120, 140]
                },
                阴森石屋: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                阴森石路: {
                    x: [-80, -120],
                    y: [210, 230]
                },
                打怪点: [
                    {
                        x: 326,
                        y: 255,
                    },
                    {
                        x: 340,
                        y: 342,
                    },
                    {
                        x: 224,
                        y: 488,
                    },
                    {
                        x: 409,
                        y: 409,
                    },
                    {
                        x: 685,
                        y: 429,
                    },
                    {
                        x: 700,
                        y: 320,
                    },
                    {
                        x: 562,
                        y: 228,
                    },
                    {
                        x: 546,
                        y: 325,
                    },
                    {
                        x: 407,
                        y: 409,
                    },
                    {
                        x: 220,
                        y: 485,
                    },
                    {
                        x: 328,
                        y: 252,
                    },
                ]
            },
            地牢一层西1: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                铁灯笼屋: {
                    x: [-80, -120],
                    y: [120, 140]
                },
                地牢一层北2: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                阴森石路: {
                    x: [-80, -120],
                    y: [210, 230]
                },
                打怪点: [
                    {
                        x: 457,
                        y: 332,
                    },
                    {
                        x: 260,
                        y: 415,
                    },
                    {
                        x: 480,
                        y: 447,
                    },
                    {
                        x: 632,
                        y: 464,
                    },
                    {
                        x: 593,
                        y: 358,
                    },
                    {
                        x: 691,
                        y: 175,
                    },
                    {
                        x: 475,
                        y: 200,
                    },
                    {
                        x: 257,
                        y: 151,
                    },
                ]
            },
            地牢一层北2: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                地牢一层西1: {
                    x: [-80, -120],
                    y: [120, 140]
                },
                石墓小溪: { //注意和石墓阵冲突
                    x: [-80, -120],
                    y: [165, 185]
                },
                紫水晶屋: {
                    x: [-80, -120],
                    y: [210, 230]
                },
                打怪点: [
                    {
                        x: 786,
                        y: 271,
                    },
                    {
                        x: 822,
                        y: 395,
                    },
                    {
                        x: 612,
                        y: 157,
                    },
                    {
                        x: 321,
                        y: 455,
                    },
                    {
                        x: 316,
                        y: 156,
                    },
                ]
            },
            地牢一层西2: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                紫水晶屋: {
                    x: [-80, -120],
                    y: [120, 140]
                },
                阴森石路: { //注意和石墓阵冲突
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: 696,
                        y: 210,
                    },
                    {
                        x: 227,
                        y: 166,
                    },
                    {
                        x: 266,
                        y: 483,
                    },
                    {
                        x: 528,
                        y: 417,
                    },
                ]
            },
            黑暗地带: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                阴森石路: {
                    x: [-80, -120],
                    y: [120, 140]
                },
                石墓小溪: { //注意和石墓阵冲突
                    x: [-80, -120],
                    y: [165, 185]
                },
                传奇部落: {
                    x: [-80, -120],
                    y: [210, 230]
                },
                生死之间: {
                    x: [-80, -120],
                    y: [255, 275]
                },
                幽名圣域: {
                    x: [-80, -120],
                    y: [300, 320]
                },
                打怪点: [
                    {
                        x: 276,
                        y: 155,
                    },
                    {
                        x: 688,
                        y: 184,
                    },
                    {
                        x: 720,
                        y: 536,
                    },
                    {
                        x: 327,
                        y: 548,
                    },
                    {
                        x: 339,
                        y: 250,
                    },
                    {
                        x: 698,
                        y: 320,
                    },
                    {
                        x: 650,
                        y: 479,
                    },
                ]
            },
            幽名圣域: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                黑暗地带: {
                    x: [-80, -120],
                    y: [120, 140]
                },
                恐怖空间: { //注意和石墓阵冲突
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: 309,
                        y: 230,
                    },
                    {
                        x: 222,
                        y: 461,
                    },
                    {
                        x: 824,
                        y: 535,
                    },
                    {
                        x: 587,
                        y: 221,
                    },
                    {
                        x: 779,
                        y: 212,
                    }
                ]
            },
            传奇部落: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                黑暗地带: {
                    x: [-80, -120],
                    y: [120, 140]
                },
                邪恶势力: { //注意和石墓阵冲突
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: 702,
                        y: 525,
                    },
                    {
                        x: 772,
                        y: 232,
                    },
                    {
                        x: 273,
                        y: 212,
                    },
                    {
                        x: 249,
                        y: 532,
                    },
                ]
            },
            邪恶势力: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                传奇部落: {
                    x: [-80, -120],
                    y: [120, 140]
                },
                一线天: { //注意和石墓阵冲突
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: 540,
                        y: 524,
                    },
                    {
                        x: 242,
                        y: 388,
                    },
                    {
                        x: 507,
                        y: 189,
                    },
                    {
                        x: 814,
                        y: 516,
                    },
                ]
            },
            一线天: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                邪恶势力: {
                    x: [-80, -120],
                    y: [120, 140]
                },
                恐怖空间: { //注意和石墓阵冲突
                    x: [-80, -120],
                    y: [165, 185]
                },
                死亡棺材: {
                    x: [-80, -120],
                    y: [200, 220]
                },
                生死之间: {
                    x: [-80, -120],
                    y: [260, 280]
                },
                打怪点: [
                    {
                        x: 217,
                        y: 303,
                    },
                    {
                        x: 423,
                        y: 145,
                    },
                    {
                        x: 781,
                        y: 213,
                    },
                    {
                        x: 819,
                        y: 331,
                    },
                    {
                        x: 261,
                        y: 545,
                    },
                    {
                        x: 356,
                        y: 252,
                    },
                ]
            },
            死亡棺材: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                一线天: {
                    x: [-80, -120],
                    y: [120, 140]
                },
                打怪点: [
                    {
                        x: 224,
                        y: 166,
                    },
                    {
                        x: 436,
                        y: 356,
                    },
                    {
                        x: 853,
                        y: 354,
                    },
                ]
            },
            恐怖空间: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                一线天: {
                    x: [-80, -120],
                    y: [120, 140]
                },
                幽名圣域: { //注意和石墓阵冲突
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: 752,
                        y: 164,
                    },
                    {
                        x: 662,
                        y: 392,
                    },
                    {
                        x: 670,
                        y: 516,
                    },
                    // {
                    //     x: 353,
                    //     y: 264,
                    // },
                    {
                        x: 530,
                        y: 350,
                    },
                ]
            },
            生死之间: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                黑暗地带: {
                    x: [-80, -120],
                    y: [120, 140]
                },
                一线天: { //注意和石墓阵冲突
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: 386,
                        y: 164,
                    },
                    {
                        x: 724,
                        y: 354,
                    },
                    {
                        x: 637,
                        y: 512,
                    },
                    {
                        x: 391,
                        y: 411,
                    },
                    {
                        x: 242,
                        y: 371,
                    },
                ]
            },
        },
        '1080_2248': {
            盟重大城: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                盟重老兵: {
                    x: [-120, -160],
                    y: [610, 630]
                },
                地牢一层东: {
                    x: [-120, -160],
                    y: [237, 257]
                },
                石墓入口: {
                    x: [-120, -160],
                    y: [379, 396]
                },
                武馆教头: {
                    x: [-120, -160],
                    y: [754, 774]
                },
            },
            地牢一层东: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                连接通道九: {
                    x: [-120, -160],
                    y: [170, 190]
                },
                盟重省: {
                    x: [-120, -160],
                    y: [238, 258]
                },
                铁灯笼屋: {
                    x: [-120, -160],
                    y: [308, 328]
                },
                阴森石屋: {
                    x: [-120, -160],
                    y: [374, 394]
                },
                打怪点: [
                    {
                        x: 589,
                        y: 464,
                    },
                    {
                        x: 339,
                        y: 220,
                    },
                    {
                        x: 252,
                        y: 732,
                    },
                    {
                        x: 660,
                        y: 784,
                    },
                    {
                        x: 1032,
                        y: 519,
                    },
                    {
                        x: 950,
                        y: 281,
                    }
                ]
            },
            阴森石屋: {
                地牢一层东: { //1
                    x: [-120, -160],
                    y: [167, 187]
                },
                地牢一层北1: { //2
                    x: [-120, -160],
                    y: [237, 257]
                }
            },
            铁灯笼屋: {
                是否沿途打怪: false,
                是否是断点: true,
                是否需要随机: false,
                地牢一层东: {
                    x: [-120, -160],
                    y: [167, 187]
                },
                地牢一层西1: {
                    x: [-120, -160],
                    y: [237, 257]
                }
            },
            阴森石路: {
                地牢一层西2: {
                    x: [-80, -120],
                    y: [120, 140]
                },
                黑暗地带: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                地牢一层西1: {
                    x: [-80, -120],
                    y: [200, 220]
                },
                地牢一层北1: {
                    x: [-80, -120],
                    y: [260, 280]
                },
            },
            紫水晶屋: {
                是否沿途打怪: false,
                是否是断点: true,
                是否需要随机: false,
                地牢一层北2: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                地牢一层北1: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                地牢一层西2: {
                    x: [-80, -120],
                    y: [205, 225]
                }
            },
            石墓小溪: {
                地牢一层北2: {
                    x: [-120, -160],
                    y: [167, 187]
                },
                黑暗地带: {
                    x: [-120, -160],
                    y: [237, 257]
                },
            },
            地牢一层北1: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                紫水晶屋: {
                    x: [-80, -120],
                    y: [120, 140]
                },
                阴森石屋: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                阴森石路: {
                    x: [-80, -120],
                    y: [210, 230]
                },
                打怪点: [
                    {
                        x: 326,
                        y: 255,
                    },
                    {
                        x: 340,
                        y: 342,
                    },
                    {
                        x: 224,
                        y: 488,
                    },
                    {
                        x: 409,
                        y: 409,
                    },
                    {
                        x: 685,
                        y: 429,
                    },
                    {
                        x: 700,
                        y: 320,
                    },
                    {
                        x: 562,
                        y: 228,
                    },
                    {
                        x: 546,
                        y: 325,
                    },
                    {
                        x: 407,
                        y: 409,
                    },
                    {
                        x: 220,
                        y: 485,
                    },
                    {
                        x: 328,
                        y: 252,
                    },
                ]
            },
            地牢一层西1: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                铁灯笼屋: {
                    x: [-120, -160],
                    y: [167, 187]
                },
                地牢一层北2: {
                    x: [-120, -160],
                    y: [237, 257]
                },
                阴森石路: {
                    x: [-120, -160],
                    y: [308, 328]
                },
                打怪点: [
                    {
                        x: 589,
                        y: 444,
                    },
                    {
                        x: 384,
                        y: 229,
                    },
                    {
                        x: 996,
                        y: 281,
                    },
                    {
                        x: 1023,
                        y: 508,
                    },
                    {
                        x: 946,
                        y: 694,
                    },
                    {
                        x: 396,
                        y: 625,
                    }
                ]
            },
            地牢一层北2: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                地牢一层西1: {
                    x: [-120, -160],
                    y: [167, 187]
                },
                石墓小溪: { //注意和石墓阵冲突
                    x: [-120, -160],
                    y: [237, 257]
                },
                紫水晶屋: {
                    x: [-120, -160],
                    y: [308, 328]
                },
                打怪点: [
                    {
                        x: 1118,
                        y: 467,
                    },
                    {
                        x: 910,
                        y: 249,
                    },
                    {
                        x: 459,
                        y: 659,
                    },
                    {
                        x: 498,
                        y: 236,
                    },
                ]
            },
            地牢一层西2: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                紫水晶屋: {
                    x: [-80, -120],
                    y: [120, 140]
                },
                阴森石路: { //注意和石墓阵冲突
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: 696,
                        y: 210,
                    },
                    {
                        x: 227,
                        y: 166,
                    },
                    {
                        x: 266,
                        y: 483,
                    },
                    {
                        x: 528,
                        y: 417,
                    },
                ]
            },
            黑暗地带: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                阴森石路: {
                    x: [-120, -160],
                    y: [167, 187]
                },
                石墓小溪: { //注意和石墓阵冲突
                    x: [-120, -160],
                    y: [237, 257]
                },
                传奇部落: {
                    x: [-120, -160],
                    y: [308, 328]
                },
                生死之间: {
                    x: [-120, -160],
                    y: [378, 398]
                },
                幽名圣域: {
                    x: [-120, -160],
                    y: [448, 468]
                },
                打怪点: [
                    {
                        x: 394,
                        y: 228,
                    },
                    {
                        x: 1137,
                        y: 266,
                    },
                    {
                        x: 781,
                        y: 366,
                    },
                    {
                        x: 382,
                        y: 238,
                    },
                    {
                        x: 223,
                        y: 652,
                    },
                    {
                        x: 482,
                        y: 817,
                    },
                    {
                        x: 1087,
                        y: 795,
                    },
                    {
                        x: 1171,
                        y: 208,
                    },
                ]
            },
            幽名圣域: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                黑暗地带: {
                    x: [-120, -160],
                    y: [167, 187]
                },
                恐怖空间: { //注意和石墓阵冲突
                    x: [-120, -160],
                    y: [237, 257]
                },
                打怪点: [
                    {
                        x: 455,
                        y: 346,
                    },
                    {
                        x: 339,
                        y: 707,
                    },
                    {
                        x: 1246,
                        y: 773,
                    },
                    {
                        x: 878,
                        y: 323,
                    },
                    {
                        x: 1182,
                        y: 307,
                    }
                ]
            },
            传奇部落: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                黑暗地带: {
                    x: [-120, -160],
                    y: [167, 187]
                },
                邪恶势力: { //注意和石墓阵冲突
                    x: [-120, -160],
                    y: [237, 257]
                },
                打怪点: [
                    {
                        x: 1051,
                        y: 780,
                    },
                    {
                        x: 411,
                        y: 777,
                    },
                    {
                        x: 385,
                        y: 340,
                    },
                    {
                        x: 1168,
                        y: 345,
                    },
                ]
            },
            邪恶势力: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                传奇部落: {
                    x: [-120, -160],
                    y: [167, 187]
                },
                一线天: {
                    x: [-120, -160],
                    y: [237, 257]
                },
                打怪点: [
                    {
                        x: 774,
                        y: 763,
                    },
                    {
                        x: 367,
                        y: 752,
                    },
                    {
                        x: 412,
                        y: 317,
                    },
                    {
                        x: 1076,
                        y: 431,
                    },
                    {
                        x: 1134,
                        y: 717,
                    },
                ]
            },
            一线天: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                邪恶势力: {
                    x: [-120, -160],
                    y: [167, 187]
                },
                恐怖空间: { //注意和石墓阵冲突
                    x: [-120, -160],
                    y: [237, 257]
                },
                死亡棺材: {
                    x: [-120, -160],
                    y: [308, 328]
                },
                生死之间: {
                    x: [-120, -160],
                    y: [378, 398]
                },
                打怪点: [
                    {
                        x: 333,
                        y: 451,
                    },
                    {
                        x: 629,
                        y: 218,
                    },
                    {
                        x: 948,
                        y: 199,
                    },
                    {
                        x: 1212,
                        y: 325,
                    },
                    {
                        x: 1224,
                        y: 490,
                    },
                    {
                        x: 1133,
                        y: 827,
                    },
                    {
                        x: 398,
                        y: 827,
                    },
                    {
                        x: 541,
                        y: 373,
                    },
                ]
            },
            死亡棺材: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                一线天: {
                    x: [-120, -160],
                    y: [167, 187]
                },
                打怪点: [
                    {
                        x: 301,
                        y: 277,
                    },
                    {
                        x: 591,
                        y: 470,
                    },
                    {
                        x: 1290,
                        y: 566,
                    },
                    {
                        x: 639,
                        y: 785,
                    },
                ]
            },
            恐怖空间: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                一线天: {
                    x: [-120, -160],
                    y: [167, 187]
                },
                幽名圣域: {
                    x: [-120, -160],
                    y: [237, 257]
                },
                打怪点: [
                    {
                        x: 1108,
                        y: 256,
                    },
                    {
                        x: 1006,
                        y: 585,
                    },
                    {
                        x: 496,
                        y: 665,
                    },
                    {
                        x: 794,
                        y: 483,
                    }
                ]
            },
            生死之间: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                黑暗地带: {
                    x: [-120, -160],
                    y: [167, 187]
                },
                一线天: { //注意和石墓阵冲突
                    x: [-120, -160],
                    y: [237, 257]
                },
                打怪点: [
                    {
                        x: 518,
                        y: 252,
                    },
                    {
                        x: 923,
                        y: 492,
                    },
                    {
                        x: 1068,
                        y: 732,
                    },
                    {
                        x: 665,
                        y: 632,
                    },
                    {
                        x: 361,
                        y: 552,
                    },
                ]
            },
        }

    },
    苍月大地图偏移: {
        '720_1280': {
            苍月大城: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                苍月老兵: {
                    x: [-80, -120],
                    y: [374, 394]
                },
                骨魔洞一层: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                牛魔寺庙入口: {
                    x: [-80, -120],
                    y: [170, 190]
                },
                尸魔洞一层: {
                    x: [-80, -120],
                    y: [215, 235]
                },
            },
            骨魔洞一层: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                苍月岛: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                骨魔洞二层: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: [-910, -900],
                        y: [145, 155],
                        坐标范围: {
                            x: [60, 101],
                            y: [90, 124],
                            点击次数: 4
                        }
                    },
                    {
                        x: [-317, -327],
                        y: [107, 117],
                        坐标范围: {
                            x: [31, 47],
                            y: [22, 34],
                            点击次数: 4
                        }
                    },
                    {
                        x: [-407, -417],
                        y: [472, 482],
                        坐标范围: {
                            x: [178, 202],
                            y: [100, 129],
                            点击次数: 4
                        }
                    },
                    {
                        x: [-712, -722],
                        y: [436, 446],
                        坐标范围: {
                            x: [143, 173],
                            y: [39, 75],
                            点击次数: 4
                        }
                    },
                ]
            },
            骨魔洞二层: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                骨魔洞一层: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                骨魔洞三层: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: [-937, -941],
                        y: [124, 128],
                        坐标范围: {
                            x: [60, 101],
                            y: [90, 124],
                            点击次数: 4
                        }
                    },
                    {
                        x: [-833, -837],
                        y: [429, 433],
                        坐标范围: {
                            x: [31, 47],
                            y: [22, 34],
                            点击次数: 4
                        }
                    },
                    {
                        x: [-507, -511],
                        y: [335, 339],
                        坐标范围: {
                            x: [178, 202],
                            y: [100, 129],
                            点击次数: 4
                        }
                    },
                    {
                        x: [-347, -350],
                        y: [459, 493],
                        坐标范围: {
                            x: [143, 173],
                            y: [39, 75],
                            点击次数: 4
                        }
                    },

                    {
                        x: [-359, -363],
                        y: [287, 291],
                        坐标范围: {
                            x: [143, 173],
                            y: [39, 75],
                            点击次数: 4
                        }
                    },
                    {
                        x: [-371, -374],
                        y: [139, 143],
                        坐标范围: {
                            x: [143, 173],
                            y: [39, 75],
                            点击次数: 4
                        }
                    },
                    {
                        x: [-600, -604],
                        y: [151, 155],
                        坐标范围: {
                            x: [143, 173],
                            y: [39, 75],
                            点击次数: 4
                        }
                    }
                ]
            },
            骨魔洞三层: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                骨魔洞二层: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                骨魔洞四层: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: [-664, -668],
                        y: [496, 450],
                        坐标范围: {
                            x: [60, 101],
                            y: [90, 124],
                            点击次数: 4
                        }
                    },
                    {
                        x: [-483, -487],
                        y: [321, 324],
                        坐标范围: {
                            x: [31, 47],
                            y: [22, 34],
                            点击次数: 4
                        }
                    },
                    {
                        x: [-356, -360],
                        y: [158, 162],
                        坐标范围: {
                            x: [178, 202],
                            y: [100, 129],
                            点击次数: 4
                        }
                    },
                    {
                        x: [-658, -662],
                        y: [159, 163],
                        坐标范围: {
                            x: [143, 173],
                            y: [39, 75],
                            点击次数: 4
                        }
                    },

                    {
                        x: [-942, -946],
                        y: [191, 195],
                        坐标范围: {
                            x: [143, 173],
                            y: [39, 75],
                            点击次数: 4
                        }
                    },
                    {
                        x: [-852, -856],
                        y: [395, 399],
                        坐标范围: {
                            x: [143, 173],
                            y: [39, 75],
                            点击次数: 4
                        }
                    }
                ]
            },
            牛魔寺庙入口: {
                苍月岛: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                牛魔寺庙一层: {
                    x: [-80, -120],
                    y: [165, 185]
                }
            },
            牛魔寺庙一层: {
                牛魔寺庙入口: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                牛魔寺庙二层: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: 722,
                        y: 451,
                    },
                    {
                        x: 620,
                        y: 499,
                    },
                    {
                        x: 152,
                        y: 557,
                    },
                    {
                        x: 420,
                        y: 496,
                    },
                    {
                        x: 862,
                        y: 287,
                    },
                    {
                        x: 636,
                        y: 243,
                    },
                    {
                        x: 868,
                        y: 160,
                    },
                    {
                        x: 715,
                        y: 144,
                    },
                    {
                        x: 483,
                        y: 166,
                    },
                    {
                        x: 193,
                        y: 220,
                    }
                ]
            },
            牛魔寺庙二层: {
                牛魔寺庙一层: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                牛魔寺庙三层: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: 508,
                        y: 272,
                    },
                    {
                        x: 315,
                        y: 185,
                    },
                    {
                        x: 299,
                        y: 353,
                    },
                    {
                        x: 401,
                        y: 410,
                    },
                    {
                        x: 668,
                        y: 405,
                    },
                    {
                        x: 844,
                        y: 225,
                    },
                    {
                        x: 599,
                        y: 225,
                    },
                    {
                        x: 315,
                        y: 185,
                    },
                    {
                        x: 444,
                        y: 284,
                    },
                ]
            },
            牛魔寺庙三层: {
                牛魔寺庙二层: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                牛魔寺庙四层: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: 456,
                        y: 282
                    },
                    {
                        x: 543,
                        y: 426
                    },
                    {
                        x: 312,
                        y: 389
                    },
                    {
                        x: 172,
                        y: 360
                    },
                    {
                        x: 173,
                        y: 576,
                    },
                    {
                        x: 604,
                        y: 508,
                    },

                    {
                        x: 724,
                        y: 478,
                    },
                    {
                        x: 844,
                        y: 343,
                    },
                    {
                        x: 860,
                        y: 124,
                    },
                    {
                        x: 596,
                        y: 230,
                    },
                    {
                        x: 414,
                        y: 140,
                    },
                    {
                        x: 235,
                        y: 154,
                    },
                    {
                        x: 384,
                        y: 263,
                    },
                    {
                        x: 552,
                        y: 244,
                    },
                    {
                        x: 455,
                        y: 337,
                    }
                ]
            },
            牛魔寺庙四层: {
                牛魔寺庙三层: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                牛魔寺庙五层: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: 361,
                        y: 334,
                    },
                    {
                        x: 196,
                        y: 214,
                    },
                    {
                        x: 450,
                        y: 196,
                    },
                    {
                        x: 205,
                        y: 511,
                    },
                    {
                        x: 617,
                        y: 393,
                    },
                    {
                        x: 778,
                        y: 342,
                    },
                    {
                        x: 856,
                        y: 152,
                    },
                    {
                        x: 527,
                        y: 148,
                    },
                    {
                        x: 251,
                        y: 176,
                    },
                    {
                        x: 360,
                        y: 328,
                    },
                ]
            },
        }

    },
    背包格子偏移: {
        '720_1280': {
            "1_1": { x: -304, y: -272 },//针对整理按钮左上角的位置(格子中心)
            "1_1_左上": { x: -338, y: -300 },//针对整理按钮左上角的位置(格子左上)
            中心点偏移量X: 60,
            中心点偏移量Y: 58,
            背包宽度: 483,
            背包高度: 296
        },
        '1080_2248': {
            "1_1": { x: -455, y: -404 },//针对整理按钮左上角的位置(格子中心)
            "1_1_左上": { x: -501, y: -446 },//针对整理按钮左上角的位置(格子左上)
            中心点偏移量X: 91,
            中心点偏移量Y: 86,
            背包宽度: 740,
            背包高度: 453
        }
    },
    人物坐标范围: {
        '720_1280': {
            x1: 1187,
            x2: 1273,
            y1: 145,
            y2: 190
        },
        '1080_2248': {
            x1: 2016,
            x2: 2148,
            y1: 220,
            y2: 261
        }
    },
    人物坐标范围精确: {
        '720_1280': {
            x1: 1192,
            x2: 1270,
            y1: 157,
            y2: 172
        },
        '1080_2248': {
            x1: 2025,
            x2: 2146,
            y1: 230,
            y2: 260
        }
    },
    金币范围: {
        '720_1280': {
            x1: 810,
            x2: 910,
            y1: 680,
            y2: 720
        },
        '1080_2248': {
            x1: 1483,
            x2: 1617,
            y1: 1044,
            y2: 1069
        }
    },
    地点范围: {
        '1080_1920': { x1: 1656, x2: 1869, y1: 3, y2: 63 },
        '1080_2248': { x1: 1903, x2: 2096, y1: 10, y2: 50 },
        '720_1280': { x1: 1110, x2: 1243, y1: 4, y2: 40 }
    },
    小地图范围: {
        '1080_1920': { x1: 1675, x2: 1875, y1: 80, y2: 200 },
        '1080_2248': { x1: 1939, x2: 2098, y1: 92, y2: 213 },
        '720_1280': { x1: 1124, x2: 1247, y1: 55, y2: 148 }
    },
    小地图范围2: {
        '1080_2248': { x1: 2005, x2: 2163, y1: 217, y2: 278 },
        '720_1280': { x1: 1172, x2: 1280, y1: 137, y2: 180 }
    },
    购买物品页码: {
        金创药小: {
            页码: 1,
            顺序: 1,
            是否下翻: false
        },
        金创药中个: {
            页码: 1,
            顺序: 3,
            是否下翻: false
        },
        金创药中包: {
            页码: 1,
            顺序: 9,
            是否下翻: false
        },
        魔法药中个: {
            页码: 1,
            顺序: 4,
            是否下翻: false
        },
        魔法药中包: {
            页码: 1,
            顺序: 10,
            是否下翻: false
        },
        地牢: {
            页码: 2,
            顺序: 3,
            是否下翻: false
        },
        随机: {
            页码: 2,
            顺序: 4,
            是否下翻: false
        },
        修复油: {
            页码: 2,
            顺序: 6,
            是否下翻: false
        },
        护身符大: {
            页码: 2,
            顺序: 9,
            是否下翻: true
        },
        随机包: {
            页码: 2,
            顺序: 8,
            是否下翻: false
        },
        灰毒药: {
            页码: 3,
            顺序: 2,
            是否下翻: true
        },
    },
    购买物品位置: {
        '720_1280': {
            "1": {
                x: [138, 178],
                y: [170, 190]
            },
            "2": {
                x: [380, 420],
                y: [170, 190]
            },
            "3": {
                x: [138, 178],
                y: [249, 269]
            },
            "4": {
                x: [380, 420],
                y: [249, 269]
            },
            "5": {
                x: [138, 178],
                y: [330, 350]
            },
            "6": {
                x: [380, 420],
                y: [330, 350]
            },
            "7": {
                x: [138, 178],
                y: [412, 432]
            },
            "8": {
                x: [380, 420],
                y: [412, 432]
            },
            "9": {
                x: [138, 178],
                y: [490, 510]
            },
            "10": {
                x: [380, 420],
                y: [490, 510]
            },
        },
        '1080_2248': {
            "1": {
                x: [310, 330],
                y: [260, 280]
            },
            "2": {
                x: [680, 700],
                y: [260, 280]
            },
            "3": {
                x: [310, 330],
                y: [380, 400]
            },
            "4": {
                x: [680, 700],
                y: [380, 400]
            },
            "5": {
                x: [310, 330],
                y: [500, 520]
            },
            "6": {
                x: [680, 700],
                y: [500, 520]
            },
            "7": {
                x: [310, 330],
                y: [620, 640]
            },
            "8": {
                x: [680, 700],
                y: [620, 640]
            },
            "9": {
                x: [310, 330],
                y: [750, 770]
            },
            "10": {
                x: [680, 700],
                y: [750, 770]
            },
        }
    },
    人物面板: {
        '720_1280': {
            装备属性明细: { //(用于裁剪装备文字)
                x: -400,
                第一行h: 40,
                第三行h: 90,
                y偏移: -17
            }, //(用于裁剪装备文字)
            头盔: { x: 156, y: 94 },//人物头（中心点）相对rewumianbanBtn左上的距离
            衣服: { x: 157, y: 184 },
            项链: { x: 271, y: 80 },
            武器: { x: 67, y: 133 },
            手镯1: { x: 57, y: 236 },
            手镯2: { x: 264, y: 241 },
            戒指1: { x: 57, y: 313 },
            戒指2: { x: 264, y: 308 },
            护身符: { x: 57, y: 378 },
        },
        '1080_2248': {
            装备属性明细: {
                x: -600,
                第一行h: 50,
                第三行h: 130,
                y偏移: -23
            }, //(用于裁剪装备文字,针对按钮左上的位置)
            头盔: { x: 236, y: 147 },//人物头（中心点）相对rewumianbanBtn.png左上的距离
            衣服: { x: 240, y: 283 },
            项链: { x: 411, y: 124 },
            武器: { x: 96, y: 193 },
            手镯1: { x: 81, y: 368 },
            手镯2: { x: 405, y: 366 },
            戒指1: { x: 79, y: 466 },
            戒指2: { x: 401, y: 470 },
            护身符: { x: 83, y: 575 },
        }
    }
}
config.物品设置 = [
    [
        [1, 1],//金币
        [0, 0],
        [0, 0],
        [0, 0],
        [0, 0],
        [0, 0],
        [0, 0],
        [0, 0],
    ],
    [
        [0, 0],//青铜剑
        [0, 1],
        [0, 1],
        [0, 0],
        [0, 0],
        [1, 1],
        [0, 0],
        [0, 0],
    ],
    [
        [0, 0],//基本剑术
        [0, 0],
        [0, 0],
        [0, 0],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
    ]
    ,
    [
        [1, 1],//魔法长袍
        [1, 1],
        [0, 0],
        [0, 0],
        [0, 0],
        [0, 0],
        [1, 1],
        [1, 1],
    ],
    [
        [0, 1],//海魂
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [0, 0],
        [0, 0],
    ],
    [
        [0, 0],//食人树
        [0, 0],
        [0, 0],
        [0, 0],
        [0, 0],
        [0, 0],
        [0, 0],
        [0, 0],
    ],
    [
        [0, 0],//铁手
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [0, 0],
    ],
    [
        [1, 1],//魔杖
        [0, 1],
        [0, 0],
        [0, 0],
        [0, 0],
        [0, 0],
        [0, 0],
        [0, 0],
    ],
    [
        [0, 0],//黄色水晶
        [0, 0],
        [0, 0],
        [1, 1],
        [0, 1],
        [0, 0],
        [1, 1],
        [0, 1],
    ],
    [
        [0, 1],//生铁戒指
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [0, 0],
        [1, 1],
    ],
    [
        [1, 1],//躲避手
        [0, 0],
        [1, 1],
        [1, 1],
        [0, 0],
        [0, 0],
        [1, 1],
        [1, 1],
    ],
    [
        [1, 1],//锄头
        [1, 1],
        [0, 0],
        [0, 0],
        [0, 0],
        [0, 0],
        [0, 0],
        [0, 0],
    ],
    [
        [0, 0],//神圣战甲
        [0, 0],
        [0, 0],
        [0, 1],
        [0, 1],
        [1, 1],
        [1, 1],
        [0, 1],
    ],
    [
        [0, 0],//琥珀
        [0, 0],
        [1, 1],
        [0, 0],
        [1, 1],
        [1, 1],
        [0, 0],
        [1, 1],
    ],
    [
        [1, 1],//铂金戒指
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
    ],
    [
        [1, 1],//传送戒指
        [1, 1],
        [1, 1],
        [1, 1],
        [0, 0],
        [0, 1],
        [1, 1],
        [1, 1],
    ],
    [
        [1, 1],//黑檀手
        [1, 1],
        [1, 1],
        [0, 0],
        [0, 0],
        [0, 0],
        [0, 0],
        [0, 1],
    ],
    [
        [0, 0],//回城卷
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
    ],
    [
        [1, 1],//神力戒指
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [0, 0],
    ],
    [
        [0, 0],//召唤骷髅
        [0, 0],
        [0, 0],
        [0, 0],
        [0, 0],
        [0, 0],
        [0, 0],
        [0, 0],
    ],
    [ //半月弯刀
        [1, 1],
        [0, 0],
        [0, 0],
        [0, 0],
        [0, 1],
        [0, 0],
        [1, 1],
        [1, 1],
    ],
    [ //裁决之杖
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
    ],
    [//祈祷戒指
        [1, 1],
        [1, 1],
        [0, 0],
        [0, 0],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
    ],
    [ //黑铁头盔
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
    ],
    [ //冰咆哮
        [1, 1],
        [0, 1],
        [0, 1],
        [0, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
    ],
    [
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
    ],
    [
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [0, 0],
        [0, 0],
        [0, 0],
    ],
    [
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
    ],
    [
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
    ],
    [
        [1, 1],
        [1, 1],
        [1, 1],
        [0, 0],
        [0, 0],
        [0, 0],
        [0, 0],
        [1, 1],
    ],
    [
        [1, 1],
        [1, 1],
        [0, 0],
        [0, 0],
        [0, 0],
        [0, 0],
        [0, 0],
        [1, 1],
    ],
    [
        [1, 1],
        [1, 1],
        [0, 0],
        [0, 0],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
    ],
    [
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
    ],
    [
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
    ],
    [
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
    ],
    [
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
    ],
    [
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
    ],
    [
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
    ],
    [
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
    ],
    [
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
    ],
    [
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
    ],
    [
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
    ],
    [
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
    ],
    [
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [0, 0],
        [0, 0],
    ],
    [
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
    ],
    [
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
    ],
    [
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
    ],
    [
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [0, 0],
        [0, 0],
    ],
    [
        [0, 0],
        [0, 0],
        [0, 0],
        [0, 0],
        [0, 0],
        [0, 0],
        [0, 0],
        [0, 0],
    ],
    [
        [0, 0],
        [0, 0],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
    ],
    [
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
    ],
    [
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
    ],
    [
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
        [1, 1],
    ],
    [
        [1, 1],
        [1, 1],
        [1, 1],
        [0, 0],
        [0, 0],
        [1, 1],
        [1, 1],
        [1, 1],
    ],
]
config.物品坐标 = [
    {
        x1: 499,
        x2: 631,
        y: 242,
    }, {
        x1: 499,
        x2: 631,
        y: 268,
    }, {
        x1: 499,
        x2: 631,
        y: 297,
    }, {
        x1: 499,
        x2: 631,
        y: 325,
    }, {
        x1: 499,
        x2: 631,
        y: 356,
    }, {
        x1: 499,
        x2: 631,
        y: 381,
    }, {
        x1: 499,
        x2: 631,
        y: 409,
    }, {
        x1: 499,
        x2: 631,
        y: 438,
    }]

// https://blog.csdn.net/wangsheng5454/article/details/117119402
// 安卓API版本  29 安卓10
config.SDK_API_VERSION = android.os.Build.VERSION.SDK_INT
module.exports = config