let config = {}
// 公共脚本key
config.commonScriptKey = "zijiefeiwuCommon";
// 业务脚本key
config.serviceScriptKey = "zijiefeiwuBus";
// appKey
config.appKey = "宁波字节飞舞科技"
// 分辨率 以竖屏标准看
config.screenWidth = 1080
config.screenHeight = 2400
config.youxiaoFBL = [{
    w: 1080,
    h: 1920
}, {
    w: 720,
    h: 1280
}]
config.找色 = {
    '720_1280': {
        地牢: [{
            color: "#19407E"
        }, {
            color: "#BF7251",
            x: 21,
            y: -24
        }, {
            color: "#1E4CCB",
            x: 25,
            y: -27
        }],
        不能拾取: [{
            color: "#DC0000"
        }, {
            color: "#FADADA",
            x: 115,
            y: 0
        }, {
            color: "#DC0000",
            x: 212,
            y: 0
        }],
    }
}
config.地图跳转表 = {
    "苍月": {
        "回苍月老兵": [
            [
                ["苍月大城", "苍月老兵"],
            ]
        ],
        "骨魔洞一层": [
            [
                ["苍月大城", "骨魔洞一层"],
                ["骨魔洞一层", "打怪点", 0]
            ]
        ],
        "阴森石屋": [
            [
                ["盟重大城", "地牢一层东"],
                ["地牢一层东", "阴森石屋"],
            ]
        ],
        "地牢一层北1": [
            [
                ["盟重大城", "地牢一层东"],
                ["地牢一层东", "阴森石屋"]
            ],
            [
                ["阴森石屋", "地牢一层北1"]
            ]
        ],
        "武馆教头": [
            [
                ["盟重大城", "武馆教头"]
            ]
        ],
        "连接通道九": [
            [
                ["盟重大城", "地牢一层东"],
                ["地牢一层东", "连接通道九"],
                ["连接通道九", "打怪点", 0]
            ]
        ],
        "连接通道八": [
            [
                ["盟重大城", "地牢一层东"],
                ["地牢一层东", "连接通道九"],
                ["连接通道九", "连接通道八"],
                ["连接通道八", "打怪点", 0]
            ]
        ],
    },
    "骨魔洞一层": {
        "骨魔洞二层": [
            [
                ["骨魔洞一层", "骨魔洞二层"],
                ["骨魔洞二层", "打怪点", 0]
            ]
        ],
        "回苍月老兵": [
            [
                ["骨魔洞一层", "苍月岛"],
                ["苍月大城", "苍月老兵"],
            ]
        ],
    },
    "盟重": {
        "回盟重老兵": [
            [
                ["盟重大城", "盟重老兵"],
            ]
        ],
        "地牢一层东": [
            [
                ["盟重大城", "地牢一层东"],
                ["地牢一层东", "打怪点", 0]
            ]
        ],
        "阴森石屋": [
            [
                ["盟重大城", "地牢一层东"],
                ["地牢一层东", "阴森石屋"],
            ]
        ],
        "地牢一层北1": [
            [
                ["盟重大城", "地牢一层东"],
                ["地牢一层东", "阴森石屋"]
            ],
            [
                ["阴森石屋", "地牢一层北1"],
                ["地牢一层北1", "打怪点", 0]
            ]
        ],
        "武馆教头": [
            [
                ["盟重大城", "武馆教头"]
            ]
        ],
        "连接通道九": [
            [
                ["盟重大城", "地牢一层东"],
                ["地牢一层东", "连接通道九"],
                ["连接通道九", "打怪点", 0]
            ]
        ],
        "连接通道八": [
            [
                ["盟重大城", "地牢一层东"],
                ["地牢一层东", "连接通道九"],
                ["连接通道九", "连接通道八"],
                ["连接通道八", "打怪点", 0]
            ]
        ],
    },
    "比奇": {
        "兽人古墓一层": [
            [
                ["比奇大城", "兽人古墓一层"],
                ["兽人古墓一层", "打怪点", 0]
            ]
        ],
        "兽人古墓二层": [
            [
                ["比奇大城", "兽人古墓一层"],
                ["兽人古墓一层", "兽人古墓二层"],
                ["兽人古墓二层", "打怪点", 0]
            ]
        ],
        "兽人古墓三层": [
            [
                ["比奇大城", "兽人古墓一层"],
                ["兽人古墓一层", "兽人古墓二层"],
                ["兽人古墓二层", "兽人古墓三层"],
                ["兽人古墓三层", "打怪点", 0]
            ]
        ],
        "回比奇老兵": [
            [
                ["比奇大城", "比奇老兵"],
            ]
        ],
        "沃玛森林": [
            [
                ["比奇大城", "沃玛森林"]
            ]
        ],
        "沃玛寺庙入口": [
            [
                ["比奇大城", "沃玛森林"],
                ["沃玛森林", "沃玛寺庙入口"]
            ]
        ],
        "沃玛寺庙一层": [
            [
                ["比奇大城", "沃玛森林"],
                ["沃玛森林", "沃玛寺庙入口"]
            ],
            [
                ["沃玛寺庙入口", "沃玛寺庙一层"],
                ["沃玛寺庙一层", "打怪点", 0],
            ]
        ],
        "沃玛寺庙二层": [
            [
                ["比奇大城", "沃玛森林"],
                ["沃玛森林", "沃玛寺庙入口"],
            ],
            [
                ["沃玛寺庙入口", "沃玛寺庙一层"],
                ["沃玛寺庙一层", "沃玛寺庙二层"],
                ["沃玛寺庙二层", "打怪点", 0],
            ]
        ],
    },
    "地牢一层东": {
        "回盟重老兵": [
            [
                ["地牢一层东", "盟重省"],
                ["盟重大城", "盟重老兵"],
            ]
        ],
        "阴森石屋": [
            [
                ["地牢一层东", "阴森石屋"],
            ]
        ],
        "连接通道九": [
            [
                ["地牢一层东", "连接通道九"],
                ["连接通道九", "打怪点", 0]
            ]
        ],
        "地牢一层北1": [
            [
                ["地牢一层东", "阴森石屋"]
            ],
            [
                ["阴森石屋", "地牢一层北1"],
                ["地牢一层北1", "打怪点", 0]
            ]
        ],
    },
    "铁灯笼屋": {
        "地牢一层东": [
            [
                ["铁灯笼屋", "地牢一层东"],
                ["地牢一层东", "打怪点", 0],
            ]
        ]
    },
    "地牢一层北1": {
        "回盟重老兵": [
            [
                ["地牢一层北1", "阴森石屋"],
            ],
            [
                ["阴森石屋", "地牢一层东"],
                ["地牢一层东", "盟重省"],
                ["盟重大城", "盟重老兵"],
            ]
        ],
        "地牢一层东": [
            [
                ["阴森石屋", "地牢一层东"],
                ["地牢一层东", "打怪点", 0],
            ]
        ],
    },
    "阴森石屋": {
        "回盟重老兵": [
            [
                ["阴森石屋", "地牢一层东"],
                ["地牢一层东", "盟重省"],
                ["盟重大城", "盟重老兵"],
            ]
        ],
        "地牢一层东": [
            [
                ["阴森石屋", "地牢一层东"],
                ["地牢一层东", "打怪点", 0],
            ]
        ],
        "地牢一层北1": [
            [
                ["阴森石屋", "地牢一层北1"],
                ["地牢一层北1", "打怪点", 0]
            ]
        ],
    },
    "兽人古墓一层": {
        "兽人古墓二层": [
            [
                ["兽人古墓一层", "兽人古墓二层"],
                ["兽人古墓二层", "打怪点", 0]
            ]
        ],
        "兽人古墓三层": [
            [
                ["兽人古墓一层", "兽人古墓二层"],
                ["兽人古墓二层", "兽人古墓三层"],
                ["兽人古墓三层", "打怪点", 0]
            ]
        ],
        "回比奇老兵": [
            [
                ["兽人古墓一层", "比奇省"],
                ["比奇大城", "比奇老兵"],
            ]
        ]
    },
    "兽人古墓二层": {
        "兽人古墓一层": [
            [
                ["兽人古墓二层", "兽人古墓一层"],
                ["兽人古墓一层", "打怪点", 0]
            ]
        ],
        "兽人古墓三层": [
            [
                ["兽人古墓二层", "兽人古墓三层"],
                ["兽人古墓三层", "打怪点", 0]
            ]
        ],
        "回比奇老兵": [
            [
                ["兽人古墓二层", "兽人古墓一层"],
                ["兽人古墓一层", "比奇省"],
                ["比奇大城", "比奇老兵"],
            ]
        ]
    },
    "兽人古墓三层": {
        "兽人古墓二层": [
            [
                ["兽人古墓三层", "兽人古墓二层"],
                ["兽人古墓二层", "打怪点", 0]
            ]
        ],
        "兽人古墓一层": [
            [
                ["兽人古墓三层", "兽人古墓二层"],
                ["兽人古墓二层", "兽人古墓一层"],
                ["兽人古墓一层", "打怪点", 0]
            ]
        ],
        "回比奇老兵": [
            [
                ["兽人古墓三层", "兽人古墓二层"],
                ["兽人古墓二层", "兽人古墓一层"],
                ["兽人古墓一层", "比奇省"],
                ["比奇大城", "比奇老兵"],
            ]
        ]
    },
    "沃玛森林": {
        "回比奇老兵": [
            [
                ["沃玛森林", "比奇省"],
                ["比奇大城", "比奇老兵"]
            ]
        ],
        "沃玛寺庙入口": [
            [
                ["沃玛森林", "沃玛寺庙入口"]
            ]
        ],
        "沃玛寺庙一层": [
            [
                ["沃玛森林", "沃玛寺庙入口"],
            ],
            [
                ["沃玛寺庙入口", "沃玛寺庙一层"],
                ["沃玛寺庙一层", "打怪点", 0],
            ]
        ],
        "沃玛寺庙二层": [
            [
                ["沃玛森林", "沃玛寺庙入口"],
            ],
            [
                ["沃玛寺庙入口", "沃玛寺庙一层"],
                ["沃玛寺庙一层", "沃玛寺庙二层"],
                ["沃玛寺庙二层", "打怪点", 0],
            ]
        ],
    },
    "沃玛寺庙入口": {
        "回比奇老兵": [
            [
                ["沃玛寺庙入口", "沃玛森林"],
                ["沃玛森林", "比奇省"],
                ["比奇大城", "比奇老兵"]
            ]
        ],
        "沃玛森林": [
            [
                ["沃玛寺庙入口", "沃玛森林"]
            ]
        ],
        "沃玛寺庙一层": [
            [
                ["沃玛寺庙入口", "沃玛寺庙一层"],
                ["沃玛寺庙一层", "打怪点", 0],
            ]
        ],
        "沃玛寺庙二层": [
            [
                ["沃玛寺庙入口", "沃玛寺庙一层"],
                ["沃玛寺庙一层", "沃玛寺庙二层"],
                ["沃玛寺庙二层", "打怪点", 0],
            ]
        ],
    },
    "沃玛寺庙一层": {
        "回比奇老兵": [
            [
                ["沃玛寺庙一层", "沃玛寺庙入口"],
            ],
            [
                ["沃玛寺庙入口", "沃玛森林"],
                ["沃玛森林", "比奇省"],
                ["比奇大城", "比奇老兵"]
            ]
        ],
        "沃玛寺庙二层": [
            [
                ["沃玛寺庙一层", "沃玛寺庙二层"],
                ["沃玛寺庙二层", "打怪点", 0],
            ]
        ],
    },
    "沃玛寺庙二层": {
        "回比奇老兵": [
            [
                ["沃玛寺庙二层", "沃玛寺庙一层"],
                ["沃玛寺庙一层", "沃玛寺庙入口"],
            ],
            [
                ["沃玛寺庙入口", "沃玛森林"],
                ["沃玛森林", "比奇省"],
                ["比奇大城", "比奇老兵"]
            ]
        ],
        "沃玛寺庙一层": [
            [
                ["沃玛寺庙二层", "沃玛寺庙一层"],
                ["沃玛寺庙一层", "打怪点", 0],
            ]
        ],
    },
    "连接通道九": {
        "回盟重老兵": [
            ["连接通道九", "地牢一层东"],
            ["地牢一层东", "盟重省"],
            ["盟重大城", "盟重老兵"],
        ],
        "地牢一层东": [
            ["地牢一层东", "打怪点", 0]
        ]
    }
}
config.沿途打怪点 = ["兽人古墓一层","兽人古墓二层","兽人古墓三层","沃玛寺庙入口","沃玛寺庙一层","沃玛寺庙二层","地牢一层东","地牢一层北1",
"连接通道九","连接通道八","连接通道七","连接通道六","骨魔洞一层","骨魔洞二层"]
config.地图路由 = {
    "苍月岛": config.地图跳转表["苍月"],
    "比奇省": config.地图跳转表["比奇"],
    "比奇城": config.地图跳转表["比奇"],
    "银杏山谷": config.地图跳转表["比奇"],
    "边界村": config.地图跳转表["比奇"],
    "兽人古墓一层": config.地图跳转表["兽人古墓一层"],
    "兽人古墓二层": config.地图跳转表["兽人古墓二层"],
    "兽人古墓三层": config.地图跳转表["兽人古墓三层"],
    "沃玛森林": config.地图跳转表["沃玛森林"],
    "沃玛寺庙入口": config.地图跳转表["沃玛寺庙入口"],
    "沃玛寺庙一层": config.地图跳转表["沃玛寺庙一层"],
    "沃玛寺庙二层": config.地图跳转表["沃玛寺庙二层"],
    "土城": config.地图跳转表["盟重"],
    "盟重省": config.地图跳转表["盟重"],
    "红名村": config.地图跳转表["盟重"],
    "沙巴克": config.地图跳转表["盟重"],
    "祖玛寺庙": config.地图跳转表["盟重"],
    "地牢一层东": config.地图跳转表["地牢一层东"],
    "地牢一层北1": config.地图跳转表["地牢一层北1"],
    "铁灯笼屋": config.地图跳转表["铁灯笼屋"],
    "阴森石屋": config.地图跳转表["阴森石屋"],

    "连接通道九": config.地图跳转表["连接通道九"],
    "连接通道八": config.地图跳转表["连接通道八"],
    "连接通道七": config.地图跳转表["连接通道七"],
    "连接通道六": config.地图跳转表["连接通道六"],

    "骨魔洞一层": config.地图跳转表["骨魔洞一层"],
}
config.城市对应 = {
    "比奇": ["比奇省", "比奇城", "银杏山谷", "边界村", "兽人古墓一层", "兽人古墓二层", "兽人古墓三层"],
    "盟重": ["盟重省", "红名村", "沙巴克", "土城", "祖玛寺庙"],
}
config.需存仓库装备 = ["炼狱", "魔杖", "银蛇", "井中月", "血饮", "无极棍", "裁决", "骨玉", "龙纹", "放大镜", "幽灵项链", "生命", "思贝儿", "心灵手镯", "龙之", "红宝石", "铂金", "绿色", "铃铛", "灵魂项链", "骑士", "三眼", "力量", "紫碧", "泰坦", "组队", "经验加成"]
config.怪物集合 = {
    "兽人古墓": ["骷髅战士", "骷髅", "骷髅战将", "洞蛆", "掷斧骷髅"]
}
config.zuobiao = {
    人物中心: {
        '720_1280': {
            x: 639,
            y: 301
        }
    },
    地下秘密通道入口偏移: {
        '720_1280': {
            x: -350,
            y: 243
        }
    },
    遥感中心位置: {
        '720_1280': {
            x: 134,
            y: 542
        }
    },
    锁定怪物标识范围: {
        '720_1280': {
            x: [505, 760],
            y: [2, 62],
            找色: [{
                color: "#D6C9A1"
            }, {
                color: "#FF0B00",
                x: 54,
                y: 14
            }]
        }
    },
    左攻击面板: {
        '720_1280': {
            展开: {
                x: [10, 15],
                y: [210, 226]
            },
            切换: {
                x: [16, 26],
                y: [208, 228]
            },
            选择怪物: {
                x: [14, 24],
                y: [280, 302]
            },
            选择怪物攻击: {
                x: [142, 182],
                y: [130, 142]
            },
            怪物集合: {
                x: [40, 280],
                y: [113, 325],
                找色: [{
                    color: "#6E3817"
                }, {
                    color: "#FF4700",
                    x: 164,
                    y: 8
                }],
                找色非满血: [{
                    color: "#F8E888"
                }, {
                    color: "#FA0100",
                    x: -164,
                    y: -71
                }]
            },
            //findMultiColors(img, "#E1D6B7", [[43, 15, "#FF0600"]],{
        }
    },
    设置面板: {
        '720_1280': {
            随机保护: {
                x: [262, 304],
                y: [423, 462]
            },
            血量加药: {
                x: [262, 304],
                y: [222, 260]
            },
            高亮显血自己: {
                x: [268, 305],
                y: [268, 305]
            },
            高亮显血组队: {
                x: [268, 305],
                y: [305, 340]
            },
            //findMultiColors(img, "#E1D6B7", [[43, 15, "#FF0600"]],{
        }
    },
    按钮集合: {
        '720_1280': {
            拾取: {
                x: [950, 960],
                y: [360, 370]
            },
            普攻: {
                x: [1170, 1221],
                y: [580, 620]
            },
            组队: {
                x: [1153, 1179],
                y: [270, 296]
            },
            好友: {
                x: [1007, 1033],
                y: [270, 296]
            },
            打符: {
                x: [1211, 1246],
                y: [440, 470]
            },
            模式: {
                x: [1225, 1254],
                y: [206, 225],
                找色: [{
                    color: "#F1F0EE"
                }, {
                    color: "#706452",
                    x: 8,
                    y: -9
                }, {
                    color: "#69666A",
                    x: 9,
                    y: 10
                }, {
                    color: "#625E5C",
                    x: 18,
                    y: 1
                }]
            },
            模式2: {
                x: [1225, 1254],
                y: [206, 225],
                找色: [{
                    color: "#F1F0EE"
                }, {
                    color: "#F1F0EE",
                    x: 8,
                    y: -9
                }, {
                    color: "#69666A",
                    x: 9,
                    y: 10
                }, {
                    color: "#625E5C",
                    x: 18,
                    y: 1
                }]
            },
            左第一个怪: {
                x: [58, 74],
                y: [126, 144]
            },
            左上箭头: {
                x: [18, 22],
                y: [50, 60]
            },
            分身派遣: {
                x: [372, 466],
                y: [480, 500]
            },
            分身派遣2: {
                x: [327, 367],
                y: [484, 504]
            }
        },
    },
    苍月安全区坐标范围: {
        x1: 125,
        x2: 145,
        y1: 318,
        y2: 338
    },
    盟重安全区坐标范围: {
        x1: 321,
        x2: 340,
        y1: 321,
        y2: 340
    },
    比奇安全区坐标范围: {
        x1: 322,
        x2: 336,
        y1: 257,
        y2: 278
    },
    比奇老兵坐标: {
        x: 330,
        y: 270
    },
    比奇小贩坐标: {
        x: 326,
        y: 266
    },
    盟重小贩坐标: {
        x: 329,
        y: 325
    },
    苍月小贩坐标: {
        x: 137,
        y: 326
    },
    丢东西范围: {
        '720_1280': {
            x: [945, 1261],
            y: [472, 680]
        }
    },
    比奇小贩按钮: {
        '720_1280': {
            x1: 764,
            x2: 900,
            y1: 414,
            y2: 446
        }
    },
    比奇小贩面板: {
        购买物品: {
            '720_1280': {
                x1: 80,
                x2: 170,
                y1: 88,
                y2: 105
            }
        },
        出售物品: {
            '720_1280': {
                x1: 317,
                x2: 405,
                y1: 88,
                y2: 105
            }
        },
        普通修理: {
            '720_1280': {
                x1: 80,
                x2: 170,
                y1: 144,
                y2: 162
            }
        },
        特殊修理: {
            '720_1280': {
                x1: 317,
                x2: 405,
                y1: 144,
                y2: 162
            }
        },
        保存物品: {
            '720_1280': {
                x1: 80,
                x2: 170,
                y1: 202,
                y2: 217
            }
        }
    },
    药品格子面板: {
        '720_1280': {
            x1: 497,
            x2: 873,
            y1: 567,
            y2: 609
        }
    },
    聊天框面板: {
        '720_1280': {
            x1: 472,
            x2: 887,
            y1: 610,
            y2: 697
        }
    },
    聊天框最后一行: {
        '720_1280': {
            x1: 492,
            x2: 880,
            y1: 667,
            y2: 700,
        }
    },
    左侧大聊天框面板: {
        '720_1280': {
            x1: 110,
            x2: 472,
            y1: 11,
            y2: 550
        }
    },
    比奇大地图偏移_old: {
        '720_1280': {
            比奇大城: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                比奇老兵: {
                    x: [-80, -120],
                    y: [456, 476]
                },
                兽人古墓一层: {
                    x: [-80, -120],
                    y: [120, 140]
                },
                沃玛森林: {
                    x: [-80, -120],
                    y: [165, 185]
                },
            },
            沃玛森林: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                丛林迷宫: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                封魔谷: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                沃玛寺庙入口: {
                    x: [-80, -120],
                    y: [210, 230]
                }
            },
            沃玛寺庙入口: {
                是否沿途打怪: false,
                是否是断点: true,
                是否需要随机: false,
                沃玛森林: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                沃玛寺庙一层: {
                    x: [-80, -120],
                    y: [165, 185]
                }
            },
            沃玛寺庙一层: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                沃玛寺庙入口: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                沃玛寺庙二层: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: [-465, -460],
                        y: [402, 410],
                        坐标范围: {
                            点击次数: 5
                        }
                    },
                    {
                        x: [-605, -610],
                        y: [150, 155],
                        坐标范围: {
                            点击次数: 5
                        }
                    },
                    {
                        x: [-955, -945],
                        y: [260, 270],
                        坐标范围: {
                            点击次数: 5
                        }
                    },
                    {
                        x: [-636, -616],
                        y: [233, 253],
                        坐标范围: {
                            点击次数: 5
                        }
                    }
                ]
            },
            兽人古墓: {
                第一层: {
                    是否沿途打怪: false,
                    是否是断点: false,
                    是否需要随机: false,
                    比奇省: {
                        x: [-80, -120],
                        y: [120, 140]
                    },
                    兽人古墓二层: {
                        x: [-80, -120],
                        y: [165, 185]
                    },
                    打怪点: [
                        {
                            x: [-510, -540],
                            y: [356, 376],
                            坐标范围: {
                                x: [225, 267],
                                y: [226, 292],
                                点击次数: 10
                            }
                        },
                        {
                            x: [-285, -300],
                            y: [210, 230],
                            坐标范围: {
                                x: [356, 376],
                                y: [122, 160],
                                点击次数: 10
                            }
                        },
                        {
                            x: [-520, -580],
                            y: [140, 170],
                            坐标范围: {
                                x: [227, 264],
                                y: [66, 105],
                                点击次数: 10
                            }
                        },
                        {
                            x: [-828, -848],
                            y: [129, 149],
                            坐标范围: {
                                x: [86, 100],
                                y: [55, 82],
                                点击次数: 10
                            }
                        },
                        {
                            x: [-785, -800],
                            y: [420, 438],
                            坐标范围: {
                                x: [100, 126],
                                y: [272, 302],
                                点击次数: 10
                            }
                        },
                    ]
                },
                第二层: {
                    是否沿途打怪: false,
                    是否是断点: false,
                    是否需要随机: false,
                    兽人古墓一层: {
                        x: [-80, -120],
                        y: [120, 140],
                    },
                    兽人古墓三层: {
                        x: [-80, -120],
                        y: [165, 185]
                    },
                    打怪点: [
                        {
                            x: [-433, -453],
                            y: [402, 422],
                            坐标范围: {
                                x: [265, 320],
                                y: [254, 320],
                                点击次数: 10
                            }
                        },
                        {
                            x: [-564, -584],
                            y: [147, 167],
                            坐标范围: {
                                x: [214, 239],
                                y: [74, 99],
                                点击次数: 10
                            }
                        },
                        {
                            x: [-863, -883],
                            y: [357, 377],
                            坐标范围: {
                                x: [51, 95],
                                y: [229, 263],
                                点击次数: 10
                            }
                        }
                    ]
                },
                第三层: {
                    是否沿途打怪: false,
                    是否是断点: false,
                    是否需要随机: false,
                    兽人古墓二层: {
                        x: [-80, -120],
                        y: [120, 140]
                    },
                    打怪点: [
                        {
                            x: [-830, -930],
                            y: [235, 275]
                        },
                        {
                            x: [-600, -700],
                            y: [300, 350]
                        },
                        {
                            x: [-500, -585],
                            y: [410, 470]
                        },
                        {
                            x: [-800, -855],
                            y: [400, 450]
                        },
                    ]
                }
            },
            僵尸洞: {
                第一层: {
                    比奇老兵: {
                        x: [-80, -120],
                        y: [456, 476]
                    },
                    废墟入口: {
                        x: [-80, -120],
                        y: [303, 323]
                    }
                }
            }
        }

    },
    比奇大地图偏移: {
        '720_1280': {
            比奇大城: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                比奇老兵: {
                    x: [-80, -120],
                    y: [456, 476]
                },
                兽人古墓一层: {
                    x: [-80, -120],
                    y: [120, 140]
                },
                沃玛森林: {
                    x: [-80, -120],
                    y: [165, 185]
                },
            },
            沃玛森林: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                丛林迷宫: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                封魔谷: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                沃玛寺庙入口: {
                    x: [-80, -120],
                    y: [210, 230]
                },
                比奇省: {
                    x: [-80, -120],
                    y: [255, 275]
                }
            },
            沃玛寺庙入口: {
                是否沿途打怪: false,
                是否是断点: true,
                是否需要随机: false,
                沃玛森林: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                沃玛寺庙一层: {
                    x: [-80, -120],
                    y: [165, 185]
                }
            },
            沃玛寺庙一层: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                沃玛寺庙入口: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                沃玛寺庙二层: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: [-465, -460],
                        y: [402, 410],
                        坐标范围: {
                            点击次数: 5
                        }
                    },
                    {
                        x: [-605, -610],
                        y: [150, 155],
                        坐标范围: {
                            点击次数: 5
                        }
                    },
                    {
                        x: [-955, -945],
                        y: [260, 270],
                        坐标范围: {
                            点击次数: 5
                        }
                    },
                    {
                        x: [-636, -616],
                        y: [233, 253],
                        坐标范围: {
                            点击次数: 5
                        }
                    }
                ]
            },
            沃玛寺庙二层: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                沃玛寺庙一层: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                沃玛寺庙: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: [-580, -600],
                        y: [273, 293],
                        坐标范围: {
                            点击次数: 3
                        }
                    },
                    {
                        x: [-498, -492],
                        y: [523, 529],
                        坐标范围: {
                            点击次数: 5
                        }
                    },
                    {
                        x: [-630, -624],
                        y: [507, 513],
                        坐标范围: {
                            点击次数: 5
                        }
                    },
                    {
                        x: [-935, -931],
                        y: [503, 509],
                        坐标范围: {
                            点击次数: 25
                        }
                    }
                ]
            },
            兽人古墓一层: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                比奇省: {
                    x: [-80, -120],
                    y: [120, 140]
                },
                兽人古墓二层: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: [-679, -685],
                        y: [533, 539],
                        坐标范围: {
                            点击次数: 2
                        }
                    },
                    {
                        x: [-610, -620],
                        y: [530, 540],
                        坐标范围: {
                            点击次数: 2
                        }
                    },
                    {
                        x: [-335, -345],
                        y: [511, 521],
                        坐标范围: {
                            点击次数: 2
                        }
                    },
                    {
                        x: [-517, -527],
                        y: [367, 377],
                        坐标范围: {
                            点击次数: 4
                        }
                    },
                    {
                        x: [-272, -282],
                        y: [366, 376],
                        坐标范围: {
                            点击次数: 2
                        }
                    },
                    {
                        x: [-255, -265],
                        y: [282, 292],
                        坐标范围: {
                            点击次数: 2
                        }
                    },
                    {
                        x: [-270, -280],
                        y: [86, 96],
                        坐标范围: {
                            点击次数: 2
                        }
                    },
                    {
                        x: [-542, -552],
                        y: [136, 146],
                        坐标范围: {
                            点击次数: 4
                        }
                    },
                    {
                        x: [-475, -485],
                        y: [264, 274],
                        坐标范围: {
                            点击次数: 2
                        }
                    },
                    {
                        x: [-644, -654],
                        y: [216, 226],
                        坐标范围: {
                            点击次数: 4
                        }
                    },
                    {
                        x: [-972, -982],
                        y: [142, 152],
                        坐标范围: {
                            点击次数: 3
                        }
                    },
                    {
                        x: [-927, -937],
                        y: [359, 369],
                        坐标范围: {
                            点击次数: 3
                        }
                    },
                    {
                        x: [-762, -772],
                        y: [512, 522],
                        坐标范围: {
                            点击次数: 3
                        }
                    },
                    {
                        x: [-637, -647],
                        y: [384, 394],
                        坐标范围: {
                            点击次数: 2
                        }
                    },
                ]
            },
            兽人古墓二层: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                兽人古墓一层: {
                    x: [-80, -120],
                    y: [120, 140],
                },
                兽人古墓三层: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: [-433, -453],
                        y: [402, 422],
                        坐标范围: {
                            x: [265, 320],
                            y: [254, 320],
                            点击次数: 5
                        }
                    },
                    {
                        x: [-564, -584],
                        y: [147, 167],
                        坐标范围: {
                            x: [214, 239],
                            y: [74, 99],
                            点击次数: 5
                        }
                    },
                    {
                        x: [-863, -883],
                        y: [357, 377],
                        坐标范围: {
                            x: [51, 95],
                            y: [229, 263],
                            点击次数: 5
                        }
                    }
                ]
            },
            兽人古墓三层: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                兽人古墓二层: {
                    x: [-80, -120],
                    y: [120, 140]
                },
                打怪点: [
                    {
                        x: [-830, -930],
                        y: [235, 275],
                        坐标范围: {
                            x: [265, 320],
                            y: [254, 320],
                            点击次数: 5
                        }
                    },
                    {
                        x: [-600, -700],
                        y: [300, 350],
                        坐标范围: {
                            x: [265, 320],
                            y: [254, 320],
                            点击次数: 5
                        }
                    },
                    {
                        x: [-500, -585],
                        y: [410, 470],
                        坐标范围: {
                            x: [265, 320],
                            y: [254, 320],
                            点击次数: 5
                        }
                    },
                    {
                        x: [-800, -855],
                        y: [400, 450],
                        坐标范围: {
                            x: [265, 320],
                            y: [254, 320],
                            点击次数: 5
                        }
                    },
                ]
            },
            僵尸洞: {
                第一层: {
                    比奇老兵: {
                        x: [-80, -120],
                        y: [456, 476]
                    },
                    废墟入口: {
                        x: [-80, -120],
                        y: [303, 323]
                    }
                }
            }
        }

    },
    盟重大地图偏移: {
        '720_1280': {
            盟重大城: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                盟重老兵: {
                    x: [-80, -120],
                    y: [415, 435]
                },
                地牢一层东: {
                    x: [-80, -120],
                    y: [163, 183]
                },
                石墓入口: {
                    x: [-80, -120],
                    y: [251, 271]
                },
                武馆教头: {
                    x: [-80, -120],
                    y: [512, 532]
                },
            },
            地牢一层东: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                连接通道九: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                盟重省: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                铁灯笼屋: {
                    x: [-80, -120],
                    y: [210, 230]
                },
                阴森石屋: {
                    x: [-80, -120],
                    y: [260, 280]
                },
                打怪点: [
                    {
                        x: [-755, -800],
                        y: [247, 287],
                        坐标范围: {
                            x: [60, 101],
                            y: [90, 124],
                            点击次数: 4
                        }
                    },
                    {
                        x: [-894, -934],
                        y: [100, 108],
                        坐标范围: {
                            x: [31, 47],
                            y: [22, 34],
                            点击次数: 4
                        }
                    },
                    {
                        x: [-400, -430],
                        y: [265, 285],
                        坐标范围: {
                            x: [178, 202],
                            y: [100, 129],
                            点击次数: 4
                        }
                    },
                    {
                        x: [-494, -514],
                        y: [161, 181],
                        坐标范围: {
                            x: [143, 173],
                            y: [39, 75],
                            点击次数: 4
                        }
                    },
                ]
            },
            连接通道九: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                连接通道八: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                地牢一层东: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: [-567, -547],
                        y: [439, 453],
                        坐标范围: {
                            x: [52, 70],
                            y: [74, 88],
                            点击次数: 1
                        }
                    },
                    {
                        x: [-772, -753],
                        y: [111, 139],
                        坐标范围: {
                            x: [29, 39],
                            y: [2, 20],
                            点击次数: 1
                        }
                    }
                ]
            },
            连接通道八: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                连接通道七: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                连接通道九: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: [-969, -942],
                        y: [341, 356],
                        坐标范围: {
                            x: [3, 20],
                            y: [73, 100],
                            点击次数: 5
                        }
                    },
                    {
                        x: [-297, -279],
                        y: [253, 264],
                        坐标范围: {
                            x: [130, 144],
                            y: [52, 77],
                            点击次数: 5
                        }
                    },
                    {
                        x: [-537, -490],
                        y: [221, 236],
                        坐标范围: {
                            x: [78, 106],
                            y: [35, 73],
                            点击次数: 5
                        }
                    }
                ]
            },
            连接通道七: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                连接通道六: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                连接通道八: {
                    x: [-80, -120],
                    y: [165, 185]
                }
            },
            连接通道六: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                连接通道七: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                连接通道九: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: [-957, -944],
                        y: [306, 318],
                        坐标范围: {
                            x: [4, 25],
                            y: [69, 88],
                            点击次数: 3
                        }
                    },
                    {
                        x: [-385, -347],
                        y: [452, 482],
                        坐标范围: {
                            x: [105, 145],
                            y: [107, 141],
                            点击次数: 3
                        }
                    },
                    {
                        x: [-830, -835],
                        y: [421, 429],
                        坐标范围: {
                            x: [105, 145],
                            y: [107, 141],
                            点击次数: 2
                        }
                    },
                    {
                        x: [-840, -827],
                        y: [296, 316],
                        坐标范围: {
                            x: [56, 89],
                            y: [62, 93],
                            点击次数: 3
                        }
                    },
                    {
                        x: [-485, -494],
                        y: [195, 205],
                        坐标范围: {
                            x: [56, 89],
                            y: [62, 93],
                            点击次数: 3
                        }
                    }
                ]
            },
            阴森石屋: {
                是否沿途打怪: false,
                是否是断点: true,
                是否需要随机: false,
                地牢一层东: {
                    x: [-80, -120],
                    y: [117, 137]
                },
                地牢一层北1: {
                    x: [-80, -120],
                    y: [163, 183]
                },
            },
            铁灯笼屋: {
                是否沿途打怪: false,
                是否是断点: true,
                是否需要随机: false,
                地牢一层东: {
                    x: [-80, -120],
                    y: [117, 137]
                },
                地牢一层西1: {
                    x: [-80, -120],
                    y: [163, 183]
                }
            },
            地牢一层北1: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                紫水晶屋: {
                    x: [-80, -120],
                    y: [120, 140]
                },
                阴森石屋: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                阴森石路: {
                    x: [-80, -120],
                    y: [210, 230]
                },
                打怪点: [
                    {
                        x: [-562, -582],
                        y: [180, 200],
                        坐标范围: {
                            x: [126, 152],
                            y: [49, 83],
                            点击次数: 3
                        }
                    },
                    {
                        x: [-416, -436],
                        y: [277, 297],
                        坐标范围: {
                            x: [172, 204],
                            y: [93, 126],
                            点击次数: 3
                        }
                    },
                    {
                        x: [-724, -744],
                        y: [353, 373],
                        坐标范围: {
                            x: [75, 154],
                            y: [136, 174],
                            点击次数: 3
                        }
                    },
                    {
                        x: [-910, -925],
                        y: [430, 450],
                        坐标范围: {
                            x: [18, 47],
                            y: [183, 206],
                            点击次数: 3
                        }
                    },
                ]
            },
        }

    },
    苍月大地图偏移: {
        '720_1280': {
            苍月大城: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                苍月老兵: {
                    x: [-80, -120],
                    y: [374, 394]
                },
                骨魔洞一层: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                牛魔寺庙入口: {
                    x: [-80, -120],
                    y: [170, 190]
                },
                尸魔洞一层: {
                    x: [-80, -120],
                    y: [215, 235]
                },
            },
            骨魔洞一层: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                苍月岛: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                骨魔洞二层: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: [-910, -900],
                        y: [145, 155],
                        坐标范围: {
                            x: [60, 101],
                            y: [90, 124],
                            点击次数: 4
                        }
                    },
                    {
                        x: [-317, -327],
                        y: [107, 117],
                        坐标范围: {
                            x: [31, 47],
                            y: [22, 34],
                            点击次数: 4
                        }
                    },
                    {
                        x: [-407, -417],
                        y: [472, 482],
                        坐标范围: {
                            x: [178, 202],
                            y: [100, 129],
                            点击次数: 4
                        }
                    },
                    {
                        x: [-712, -722],
                        y: [436, 446],
                        坐标范围: {
                            x: [143, 173],
                            y: [39, 75],
                            点击次数: 4
                        }
                    },
                ]
            },
            骨魔洞二层: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                骨魔洞一层: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                骨魔洞三层: {
                    x: [-80, -120],
                    y: [165, 185]
                },
            },
        }

    },
    保存仓库包格子偏移量: {//这里是针对卖装备背包格子偏移量
        '720_1280': {
            x: -116,
            y: 0
        }//651,95
    },
    背包格子整体于面板偏移量: {
        '720_1280': {
            x: 507,
            y: 302
        }
    },
    背包格子于面板偏移量: {//这里是针对卖装备背包格子偏移量
        '720_1280': {
            "1_1": { x: -302, y: -271 },//第一行第一列中心点坐标
            "1_2": { x: -240, y: -271 },
            "1_3": { x: -185, y: -271 },
            "1_4": { x: -122, y: -271 },
            "1_5": { x: -62, y: -271 },
            "1_6": { x: -2, y: -271 },
            "1_7": { x: 58, y: -271 },
            "1_8": { x: 117, y: -271 },

            "2_1": { x: -302, y: -214 },//第二行第一列中心点坐标
            "2_2": { x: -240, y: -214 },
            "2_3": { x: -185, y: -214 },
            "2_4": { x: -122, y: -214 },
            "2_5": { x: -62, y: -214 },
            "2_6": { x: -2, y: -214 },
            "2_7": { x: 58, y: -214 },
            "2_8": { x: 117, y: -214 },

            "3_1": { x: -302, y: -152 },//第三行第一列中心点坐标
            "3_2": { x: -240, y: -152 },
            "3_3": { x: -185, y: -152 },
            "3_4": { x: -122, y: -152 },
            "3_5": { x: -62, y: -152 },
            "3_6": { x: -2, y: -152 },
            "3_7": { x: 58, y: -152 },
            "3_8": { x: 117, y: -152 },

            "4_1": { x: -302, y: -92 },//第四行第一列中心点坐标
            "4_2": { x: -240, y: -92 },
            "4_3": { x: -185, y: -92 },
            "4_4": { x: -122, y: -92 },
            "4_5": { x: -62, y: -92 },
            "4_6": { x: -2, y: -92 },
            "4_7": { x: 58, y: -92 },
            "4_8": { x: 117, y: -92 },

            "5_1": { x: -302, y: -33 },//第五行第一列中心点坐标
            "5_2": { x: -240, y: -33 },
            "5_3": { x: -185, y: -33 },
            "5_4": { x: -122, y: -33 },
            "5_5": { x: -62, y: -33 },
            "5_6": { x: -2, y: -33 },
            "5_7": { x: 58, y: -33 },
            "5_8": { x: 117, y: -33 },

        }//651,95
    },
    人物坐标范围: {
        '720_1280': {
            x1: 1187,
            x2: 1273,
            y1: 145,
            y2: 190
        }
    },
    人物坐标范围精确: {
        '720_1280': {
            x1: 1192,
            x2: 1270,
            y1: 157,
            y2: 172
        }
    },
    金币范围: {
        '720_1280': {
            x1: 880,
            x2: 972,
            y1: 690,
            y2: 720
        }
    },
    地点范围: {
        '1080_1920': { x1: 1656, x2: 1869, y1: 3, y2: 63 },
        '720_1280': { x1: 1110, x2: 1243, y1: 4, y2: 40 }
    },
    小地图范围: {
        '1080_1920': { x1: 1675, x2: 1875, y1: 80, y2: 200 },
        '720_1280': { x1: 1124, x2: 1247, y1: 55, y2: 148 }
    },
    小地图范围2: {
        '720_1280': { x1: 1105, x2: 1280, y1: 33, y2: 178 }
    },
    购买物品页码: {
        金创药小: {
            页码: 1,
            顺序: 1,
            是否下翻: false
        },
        金创药中个: {
            页码: 1,
            顺序: 3,
            是否下翻: false
        },
        金创药中包: {
            页码: 1,
            顺序: 9,
            是否下翻: false
        },
        魔法药中个: {
            页码: 1,
            顺序: 4,
            是否下翻: false
        },
        魔法药中包: {
            页码: 1,
            顺序: 10,
            是否下翻: false
        },
        地牢: {
            页码: 2,
            顺序: 3,
            是否下翻: false
        },
        随机: {
            页码: 2,
            顺序: 4,
            是否下翻: false
        },
        修复油: {
            页码: 2,
            顺序: 6,
            是否下翻: false
        },
        护身符大: {
            页码: 2,
            顺序: 9,
            是否下翻: true
        },
        随机包: {
            页码: 2,
            顺序: 8,
            是否下翻: false
        },
    },
    购买物品位置: {
        '720_1280': {
            "1": {//158,181    400,174
                x: [138, 178],
                y: [170, 190]
            },
            "2": {
                x: [380, 420],
                y: [170, 190]
            },
            "3": {
                x: [138, 178],
                y: [249, 269]
            },
            "4": {
                x: [380, 420],
                y: [249, 269]
            },
            "5": {
                x: [138, 178],
                y: [330, 350]
            },
            "6": {
                x: [380, 420],
                y: [330, 350]
            },
            "7": {
                x: [138, 178],
                y: [412, 432]
            },
            "8": {
                x: [380, 420],
                y: [412, 432]
            },
            "9": {
                x: [138, 178],
                y: [490, 510]
            },
            "10": {
                x: [380, 420],
                y: [490, 510]
            },
        }
    },
    人物面板: {
        '720_1280': {
            装备属性明细: { x: -280, y: 80 }, //(用于裁剪装备文字)
            头盔: { x: 194, y: 106 },//人物头（中心点）相对左边关闭按钮左上角的距离
            衣服: { x: 197, y: 180 },
            项链: { x: 296, y: 101 },
            武器: { x: 98, y: 123 },
            手镯1: { x: 84, y: 249 },
            手镯2: { x: 292, y: 249 },
            戒指1: { x: 84, y: 315 },
            戒指2: { x: 295, y: 311 },
            护身符: { x: 86, y: 375 },
        }
    }
}


// https://blog.csdn.net/wangsheng5454/article/details/117119402
// 安卓API版本  29 安卓10
config.SDK_API_VERSION = android.os.Build.VERSION.SDK_INT
module.exports = config