let config = {}
// 公共脚本key
config.commonScriptKey = "zijiefeiwuCommon";
// 业务脚本key
config.serviceScriptKey = "zijiefeiwuBus";
// appKey
config.appKey = "宁波字节飞舞科技"
// 分辨率 以竖屏标准看
config.screenWidth = 1080
config.screenHeight = 2400
config.youxiaoFBL = [{
    w: 1080,
    h: 1920
}, {
    w: 720,
    h: 1280
}]
config.找色 = {
    '720_1280': {
        地牢: [{
            color: "#19407E"
        }, {
            color: "#BF7251",
            x: 21,
            y: -24
        }, {
            color: "#1E4CCB",
            x: 25,
            y: -27
        }],
        随机: [{
            color: "#7B2EC8"
        }, {
            color: "#C97747",
            x: 21,
            y: -21
        }, {
            color: "#7937D0",
            x: 26,
            y: -26
        }],
        不能拾取: [{
            color: "#DC0000"
        }, {
            color: "#FADADA",
            x: 115,
            y: 0
        }, {
            color: "#DC0000",
            x: 212,
            y: 0
        }],
    }
}
config.地图跳转表 = {
    "苍月": {
        "回老兵": [
            [
                ["苍月大城", "苍月老兵"],
            ]
        ],
        "骨魔洞一层": [
            [
                ["苍月大城", "骨魔洞一层"],
                ["骨魔洞一层", "打怪点", 0]
            ]
        ],
        "骨魔洞二层": [
            [
                ["苍月大城", "骨魔洞一层"],
                ["骨魔洞一层", "骨魔洞二层"],
                ["骨魔洞二层", "打怪点", 0]
            ]
        ],
        "骨魔洞三层": [
            [
                ["苍月大城", "骨魔洞一层"],
                ["骨魔洞一层", "骨魔洞二层"],
                ["骨魔洞二层", "骨魔洞三层"],
                ["骨魔洞三层", "打怪点", 0]
            ]
        ],
        "牛魔寺庙一层": [
            [
                ["苍月大城", "牛魔寺庙入口"],
                ["牛魔寺庙入口", "牛魔寺庙一层"],
                ["牛魔寺庙一层", "打怪点", 0]
            ]
        ],
        "牛魔寺庙二层": [
            [
                ["苍月大城", "牛魔寺庙入口"],
                ["牛魔寺庙入口", "牛魔寺庙一层"],
                ["牛魔寺庙一层", "打怪点", 0]
            ]
        ],
        "牛魔寺庙三层": [
            [
                ["苍月大城", "牛魔寺庙入口"],
                ["牛魔寺庙入口", "牛魔寺庙一层"],
                ["牛魔寺庙一层", "打怪点", 0]
            ]
        ],
        "牛魔寺庙四层": [
            [
                ["苍月大城", "牛魔寺庙入口"],
                ["牛魔寺庙入口", "牛魔寺庙一层"],
                ["牛魔寺庙一层", "打怪点", 0]
            ]
        ],
    },
    "骨魔洞一层": {
        "骨魔洞二层": [
            [
                ["骨魔洞一层", "骨魔洞二层"],
                ["骨魔洞二层", "打怪点", 0]
            ]
        ],
        "骨魔洞三层": [
            [
                ["骨魔洞一层", "骨魔洞二层"],
                ["骨魔洞二层", "骨魔洞三层"],
                ["骨魔洞三层", "打怪点", 0]
            ]
        ],
        "骨魔洞四层": [
            [
                ["骨魔洞一层", "骨魔洞二层"],
                ["骨魔洞二层", "骨魔洞三层"],
                ["骨魔洞三层", "骨魔洞四层"],
                ["骨魔洞四层", "打怪点", 0]
            ]
        ],
        "回老兵": [
            [
                ["骨魔洞一层", "苍月岛"],
                ["苍月大城", "苍月老兵"],
            ]
        ],
    },
    "骨魔洞二层": {
        "骨魔洞一层": [
            [
                ["骨魔洞二层", "骨魔洞一层"],
                ["骨魔洞一层", "打怪点", 0]
            ]
        ],
        "骨魔洞三层": [
            [
                ["骨魔洞二层", "骨魔洞三层"],
                ["骨魔洞三层", "打怪点", 0]
            ]
        ],
        "骨魔洞四层": [
            [
                ["骨魔洞二层", "骨魔洞三层"],
                ["骨魔洞三层", "骨魔洞四层"],
                ["骨魔洞四层", "打怪点", 0]
            ]
        ],
        "回老兵": [
            [
                ["骨魔洞二层", "骨魔洞一层"],
                ["骨魔洞一层", "苍月岛"],
                ["苍月大城", "苍月老兵"],
            ]
        ],
    },
    "骨魔洞三层": {
        "骨魔洞一层": [
            [
                ["骨魔洞三层", "骨魔洞二层"],
                ["骨魔洞二层", "骨魔洞一层"],
                ["骨魔洞一层", "打怪点", 0]
            ]
        ],
        "骨魔洞二层": [
            [
                ["骨魔洞三层", "骨魔洞二层"],
                ["骨魔洞二层", "打怪点", 0]
            ]
        ],
        "回老兵": [
            [

                ["骨魔洞三层", "骨魔洞二层"],
                ["骨魔洞二层", "骨魔洞一层"],
                ["骨魔洞一层", "苍月岛"],
                ["苍月大城", "苍月老兵"],
            ]
        ],
    },
    "牛魔寺庙入口": {
        "回老兵": [
            [
                ["牛魔寺庙入口", "苍月岛"],
                ["苍月大城", "苍月老兵"],
            ]
        ],
        "牛魔寺庙一层": [
            [
                ["牛魔寺庙入口", "牛魔寺庙一层"],
                ["牛魔寺庙一层", "打怪点", 0]
            ]
        ],
        "牛魔寺庙二层": [
            [
                ["牛魔寺庙入口", "牛魔寺庙一层"],
                ["牛魔寺庙一层", "打怪点", 0]
            ]
        ],
        "牛魔寺庙三层": [
            [
                ["牛魔寺庙入口", "牛魔寺庙一层"],
                ["牛魔寺庙一层", "打怪点", 0]
            ]
        ],
        "牛魔寺庙四层": [
            [
                ["牛魔寺庙入口", "牛魔寺庙一层"],
                ["牛魔寺庙一层", "打怪点", 0]
            ]
        ],
    },
    "牛魔寺庙一层": {
        "回老兵": [
            [
                ["牛魔寺庙一层", "牛魔寺庙入口"],
                ["牛魔寺庙入口", "苍月岛"],
                ["苍月大城", "苍月老兵"],
            ]
        ],
        "牛魔寺庙二层": [
            [
                ["牛魔寺庙一层", "牛魔寺庙二层"],
                ["牛魔寺庙二层", "打怪点", 0]
            ]
        ],
        "牛魔寺庙三层": [
            [
                ["牛魔寺庙一层", "牛魔寺庙二层"],
                ["牛魔寺庙二层", "打怪点", 0]
            ]
        ],
        "牛魔寺庙四层": [
            [
                ["牛魔寺庙一层", "牛魔寺庙二层"],
                ["牛魔寺庙二层", "打怪点", 0]
            ]
        ],
    },
    "牛魔寺庙二层": {
        "回老兵": [
            [
                ["牛魔寺庙二层", "牛魔寺庙一层"],
                ["牛魔寺庙一层", "牛魔寺庙入口"],
                ["牛魔寺庙入口", "苍月岛"],
                ["苍月大城", "苍月老兵"],
            ]
        ],
        "牛魔寺庙一层": [
            [
                ["牛魔寺庙二层", "牛魔寺庙一层"],
                ["牛魔寺庙一层", "打怪点", 0]
            ]
        ],
        "牛魔寺庙三层": [
            [
                ["牛魔寺庙二层", "牛魔寺庙三层"],
                ["牛魔寺庙三层", "打怪点", 0]
            ]
        ],
        "牛魔寺庙四层": [
            [
                ["牛魔寺庙二层", "牛魔寺庙三层"],
                ["牛魔寺庙三层", "打怪点", 0]
            ]
        ],
    },
    "牛魔寺庙三层": {
        "回老兵": [
            [
                ["牛魔寺庙三层", "牛魔寺庙二层"],
                ["牛魔寺庙二层", "牛魔寺庙一层"],
                ["牛魔寺庙一层", "牛魔寺庙入口"],
                ["牛魔寺庙入口", "苍月岛"],
                ["苍月大城", "苍月老兵"],
            ]
        ],
        "牛魔寺庙一层": [
            [
                ["牛魔寺庙三层", "牛魔寺庙二层"],
                ["牛魔寺庙二层", "牛魔寺庙一层"],
                ["牛魔寺庙一层", "打怪点", 0]
            ]
        ],
        "牛魔寺庙二层": [
            [
                ["牛魔寺庙三层", "牛魔寺庙二层"],
                ["牛魔寺庙二层", "打怪点", 0]
            ]
        ],
        "牛魔寺庙四层": [
            [
                ["牛魔寺庙三层", "牛魔寺庙四层"],
                ["牛魔寺庙四层", "打怪点", 0]
            ]
        ],
    },
    "牛魔寺庙四层": {
        "回老兵": [
            [
                ["牛魔寺庙四层", "牛魔寺庙三层"],
                ["牛魔寺庙三层", "牛魔寺庙二层"],
                ["牛魔寺庙二层", "牛魔寺庙一层"],
                ["牛魔寺庙一层", "牛魔寺庙入口"],
                ["牛魔寺庙入口", "苍月岛"],
                ["苍月大城", "苍月老兵"],
            ]
        ],
        "牛魔寺庙一层": [
            [
                ["牛魔寺庙四层", "牛魔寺庙三层"],
                ["牛魔寺庙三层", "牛魔寺庙二层"],
                ["牛魔寺庙二层", "牛魔寺庙一层"],
                ["牛魔寺庙一层", "打怪点", 0]
            ]
        ],
        "牛魔寺庙二层": [
            [
                ["牛魔寺庙四层", "牛魔寺庙三层"],
                ["牛魔寺庙三层", "牛魔寺庙二层"],
                ["牛魔寺庙二层", "打怪点", 0]
            ]
        ],
        "牛魔寺庙三层": [
            [
                ["牛魔寺庙四层", "牛魔寺庙三层"],
                ["牛魔寺庙三层", "打怪点", 0]
            ]
        ],
    },
    "盟重": {
        "回老兵": [
            [
                ["盟重大城", "盟重老兵"],
            ]
        ],
        "地牢一层东": [
            [
                ["盟重大城", "地牢一层东"],
                ["地牢一层东", "打怪点", 0]
            ]
        ],
        "阴森石屋": [
            [
                ["盟重大城", "地牢一层东"],
                ["地牢一层东", "阴森石屋"],
            ]
        ],
        "地牢一层北1": [
            [
                ["盟重大城", "地牢一层东"],
                ["地牢一层东", "阴森石屋"]
            ],
            [
                ["阴森石屋", "地牢一层北1"],
                ["地牢一层北1", "打怪点", 0]
            ]
        ],
        "铁灯笼屋": [
            [
                ["盟重大城", "地牢一层东"],
                ["地牢一层东", "铁灯笼屋"],
            ]
        ],
        "地牢一层西1": [
            [
                ["盟重大城", "地牢一层东"],
                ["地牢一层东", "铁灯笼屋"]
            ],
            [
                ["铁灯笼屋", "地牢一层西1"],
                ["地牢一层西1", "打怪点", 0]
            ]
        ],
        "石墓入口": [
            [
                ["盟重大城", "石墓入口"]
            ]
        ],
        "石墓一层": [
            [
                ["盟重大城", "石墓入口"]
            ],
            [
                ["石墓入口", "石墓一层"],
                ["石墓一层", "打怪点", 0]
            ]
        ],
        "石墓二层": [
            [
                ["盟重大城", "石墓入口"]
            ],
            [
                ["石墓入口", "石墓一层"],
                ["石墓一层", "打怪点", 0]
            ]
        ],
        "石墓三层": [
            [
                ["盟重大城", "石墓入口"]
            ],
            [
                ["石墓入口", "石墓一层"],
                ["石墓一层", "打怪点", 0]
            ]
        ],
        "石墓四层": [
            [
                ["盟重大城", "石墓入口"]
            ],
            [
                ["石墓入口", "石墓一层"],
                ["石墓一层", "打怪点", 0]
            ]
        ],
        "石墓五层": [
            [
                ["盟重大城", "石墓入口"]
            ],
            [
                ["石墓入口", "石墓一层"],
                ["石墓一层", "打怪点", 0]
            ]
        ],
        "石墓阵": [
            [
                ["盟重大城", "石墓入口"]
            ],
            [
                ["石墓入口", "石墓一层"],
                ["石墓一层", "打怪点", 0]
            ]
        ],
        "武馆教头": [
            [
                ["盟重大城", "武馆教头"]
            ]
        ],
        "连接通道九": [
            [
                ["盟重大城", "地牢一层东"],
                ["地牢一层东", "连接通道九"],
                ["连接通道九", "打怪点", 0]
            ]
        ],
        "连接通道八": [
            [
                ["盟重大城", "地牢一层东"],
                ["地牢一层东", "连接通道九"],
                ["连接通道九", "连接通道八"],
                ["连接通道八", "打怪点", 0]
            ]
        ],
    },
    "石墓入口": {
        "回老兵": [
            [
                ["石墓入口", "盟重省"],
                ["盟重大城", "盟重老兵"],
            ]
        ],
        "石墓一层": [
            [
                ["石墓入口", "石墓一层"],
                ["石墓一层", "打怪点", 0],
            ]
        ],
        "石墓二层": [
            [
                ["石墓入口", "石墓一层"],
                ["石墓一层", "打怪点", 0],
            ]
        ],
        "石墓三层": [
            [
                ["石墓入口", "石墓一层"],
                ["石墓一层", "打怪点", 0],
            ]
        ],
        "石墓四层": [
            [
                ["石墓入口", "石墓一层"],
                ["石墓一层", "打怪点", 0],
            ]
        ],
        "石墓五层": [
            [
                ["石墓入口", "石墓一层"],
                ["石墓一层", "打怪点", 0],
            ]
        ],
        "石墓阵": [
            [
                ["石墓入口", "石墓一层"],
                ["石墓一层", "打怪点", 0],
            ]
        ],
    },
    "石墓一层": {
        "回老兵": [
            [
                ["石墓一层", "石墓入口"],
            ],
            [
                ["石墓入口", "盟重省"],
                ["盟重大城", "盟重老兵"],
            ]
        ],
        "石墓入口": [
            [
                ["石墓一层", "石墓入口"],
            ]
        ],
        "石墓二层": [
            [
                ["石墓一层", "石墓二层"],
                ["石墓二层", "打怪点", 0],
            ]
        ],
        "石墓三层": [
            [
                ["石墓一层", "石墓二层"],
                ["石墓二层", "打怪点", 0],
            ]
        ],
        "石墓四层": [
            [
                ["石墓一层", "石墓二层"],
                ["石墓二层", "打怪点", 0],
            ]
        ],
        "石墓五层": [
            [
                ["石墓一层", "石墓二层"],
                ["石墓二层", "打怪点", 0],
            ]
        ],
        "石墓阵": [
            [
                ["石墓一层", "石墓二层"],
                ["石墓二层", "打怪点", 0],
            ]
        ],
    },
    "石墓二层": {
        "回老兵": [
            [
                ["石墓二层", "石墓一层"],
                ["石墓一层", "石墓入口"],
            ],
            [
                ["石墓入口", "盟重省"],
                ["盟重大城", "盟重老兵"],
            ]
        ],
        "石墓入口": [
            [
                ["石墓二层", "石墓一层"],
                ["石墓一层", "石墓入口"],
            ]
        ],
        "石墓一层": [
            [
                ["石墓二层", "石墓一层"],
                ["石墓一层", "打怪点", 0],
            ]
        ],
        "石墓三层": [
            [
                ["石墓二层", "石墓三层"],
                ["石墓三层", "打怪点", 0],
            ]
        ],
        "石墓四层": [
            [
                ["石墓二层", "石墓三层"],
                ["石墓三层", "打怪点", 0],
            ]
        ],
        "石墓五层": [
            [
                ["石墓二层", "石墓三层"],
                ["石墓三层", "打怪点", 0],
            ]
        ],
        "石墓阵": [
            [
                ["石墓二层", "石墓三层"],
                ["石墓三层", "打怪点", 0],
            ]
        ],
    },
    "石墓三层": {
        "回老兵": [
            [
                ["石墓三层", "石墓二层"],
                ["石墓二层", "石墓一层"],
                ["石墓一层", "石墓入口"],
            ],
            [
                ["石墓入口", "盟重省"],
                ["盟重大城", "盟重老兵"],
            ]
        ],
        "石墓入口": [
            [
                ["石墓三层", "石墓二层"],
                ["石墓二层", "石墓一层"],
                ["石墓一层", "石墓入口"],
            ]
        ],
        "石墓一层": [
            [
                ["石墓三层", "石墓二层"],
                ["石墓二层", "石墓一层"],
                ["石墓一层", "打怪点", 0],
            ]
        ],
        "石墓二层": [
            [
                ["石墓三层", "石墓二层"],
                ["石墓二层", "打怪点", 0],
            ]
        ],
        "石墓四层": [
            [
                ["石墓三层", "石墓四层"],
                ["石墓四层", "打怪点", 0],
            ]
        ],
        "石墓五层": [
            [
                ["石墓三层", "石墓四层"],
                ["石墓四层", "打怪点", 0],
            ]
        ],
        "石墓阵": [
            [
                ["石墓三层", "石墓四层"],
                ["石墓四层", "打怪点", 0],
            ]
        ],
    },
    "石墓四层": {
        "回老兵": [
            [
                ["石墓四层", "石墓三层"],
                ["石墓三层", "石墓二层"],
                ["石墓二层", "石墓一层"],
                ["石墓一层", "石墓入口"],
            ],
            [
                ["石墓入口", "盟重省"],
                ["盟重大城", "盟重老兵"],
            ]
        ],
        "石墓入口": [
            [
                ["石墓四层", "石墓三层"],
                ["石墓三层", "石墓二层"],
                ["石墓二层", "石墓一层"],
                ["石墓一层", "石墓入口"],
            ]
        ],
        "石墓一层": [
            [
                ["石墓四层", "石墓三层"],
                ["石墓三层", "石墓二层"],
                ["石墓二层", "石墓一层"],
                ["石墓一层", "打怪点", 0],
            ]
        ],
        "石墓二层": [
            [
                ["石墓四层", "石墓三层"],
                ["石墓三层", "石墓二层"],
                ["石墓二层", "打怪点", 0],
            ]
        ],
        "石墓三层": [
            [
                ["石墓四层", "石墓三层"],
                ["石墓三层", "打怪点", 0],
            ]
        ],
        "石墓五层": [
            [
                ["石墓四层", "石墓五层"],
                ["石墓五层", "打怪点", 0],
            ]

        ],
        "石墓阵": [
            [
                ["石墓四层", "石墓五层"],
                ["石墓五层", "打怪点", 0],
            ]
        ],
    },
    "石墓五层": {
        "回老兵": [
            [
                ["石墓五层", "石墓四层"],
                ["石墓四层", "石墓三层"],
                ["石墓三层", "石墓二层"],
                ["石墓二层", "石墓一层"],
                ["石墓一层", "石墓入口"],
            ],
            [
                ["石墓入口", "盟重省"],
                ["盟重大城", "盟重老兵"],
            ]
        ],
        "石墓入口": [
            [
                ["石墓五层", "石墓四层"],
                ["石墓四层", "石墓三层"],
                ["石墓三层", "石墓二层"],
                ["石墓二层", "石墓一层"],
                ["石墓一层", "石墓入口"],
            ]
        ],
        "石墓一层": [
            [
                ["石墓五层", "石墓四层"],
                ["石墓四层", "石墓三层"],
                ["石墓三层", "石墓二层"],
                ["石墓二层", "石墓一层"],
                ["石墓一层", "打怪点", 0],
            ]
        ],
        "石墓二层": [
            [
                ["石墓五层", "石墓四层"],
                ["石墓四层", "石墓三层"],
                ["石墓三层", "石墓二层"],
                ["石墓二层", "打怪点", 0],
            ]
        ],
        "石墓三层": [
            [
                ["石墓五层", "石墓四层"],
                ["石墓四层", "石墓三层"],
                ["石墓三层", "打怪点", 0],
            ]
        ],
        "石墓四层": [
            [
                ["石墓五层", "石墓四层"],
                ["石墓四层", "打怪点", 0],
            ]
        ],
        "石墓阵": [
            [
                ["石墓阵", "打怪点", 0],
            ]
        ],
    },
    "地牢一层东": {
        "回老兵": [
            [
                ["地牢一层东", "盟重省"],
                ["盟重大城", "盟重老兵"],
            ]
        ],
        "阴森石屋": [
            [
                ["地牢一层东", "阴森石屋"],
            ]
        ],
        "连接通道九": [
            [
                ["地牢一层东", "连接通道九"],
                ["连接通道九", "打怪点", 0]
            ]
        ],
        "地牢一层北1": [
            [
                ["地牢一层东", "阴森石屋"]
            ],
            [
                ["阴森石屋", "地牢一层北1"],
                ["地牢一层北1", "打怪点", 0]
            ]
        ],
        "铁灯笼屋": [
            [
                ["地牢一层东", "铁灯笼屋"],
            ]
        ],
        "地牢一层西1": [
            [
                ["地牢一层东", "铁灯笼屋"],
            ]
        ],
    },
    "铁灯笼屋": {
        "回老兵": [
            [
                ["铁灯笼屋", "地牢一层东"],
                ["地牢一层东", "盟重省"],
                ["盟重大城", "盟重老兵"],
            ]
        ],
        "地牢一层东": [
            [
                ["铁灯笼屋", "地牢一层东"],
                ["地牢一层东", "打怪点", 0],
            ]
        ],
        "地牢一层西1": [
            [
                ["铁灯笼屋", "地牢一层西1"],
                ["地牢一层西1", "打怪点", 0],
            ]
        ],
        "地牢一层北2": [
            [
                ["铁灯笼屋", "地牢一层西1"],
                ["地牢一层西1", "打怪点", 0],
            ]
        ],
        "紫水晶屋": [
            [
                ["铁灯笼屋", "地牢一层西1"],
                ["地牢一层西1", "打怪点", 0],
            ]
        ]
    },
    "地牢一层北1": {
        "回老兵": [
            [
                ["地牢一层北1", "阴森石屋"],
            ],
            [
                ["阴森石屋", "地牢一层东"],
                ["地牢一层东", "盟重省"],
                ["盟重大城", "盟重老兵"],
            ]
        ],
        "阴森石屋": [
            [
                ["地牢一层北1", "阴森石屋"],
            ]
        ],
        "地牢一层东": [
            [
                ["阴森石屋", "地牢一层东"],
                ["地牢一层东", "打怪点", 0],
            ]
        ],
    },
    "地牢一层西1": {
        "回老兵": [
            [
                ["地牢一层西1", "铁灯笼屋"],
            ]
        ],
        "阴森石路": [
            [
                ["地牢一层西1", "阴森石路"],
            ]
        ],
        "地牢一层北2": [
            [
                ["地牢一层西1", "地牢一层北2"],
                ["地牢一层北2", "打怪点", 0],
            ]
        ],
        "紫水晶屋": [
            [
                ["地牢一层西1", "地牢一层北2"],
                ["地牢一层北2", "打怪点", 0],
            ]
        ],
    },
    "阴森石屋": {
        "回老兵": [
            [
                ["阴森石屋", "地牢一层东"],
                ["地牢一层东", "盟重省"],
                ["盟重大城", "盟重老兵"],
            ]
        ],
        "地牢一层东": [
            [
                ["阴森石屋", "地牢一层东"],
                ["地牢一层东", "打怪点", 0],
            ]
        ],
        "地牢一层北1": [
            [
                ["阴森石屋", "地牢一层北1"],
                ["地牢一层北1", "打怪点", 0]
            ]
        ],
    },
    "阴森石路": {
        "回老兵": [
            [
                ["阴森石路", "地牢一层北1"],
                ["地牢一层北1", "阴森石屋"],
            ], [
                ["阴森石屋", "地牢一层东"],
                ["地牢一层东", "盟重省"],
                ["盟重大城", "盟重老兵"],
            ]
        ],
        "地牢一层北1": [
            [
                ["阴森石路", "地牢一层北1"],
                ["地牢一层北1", "打怪点", 0]
            ]
        ],
    },
    "紫水晶屋": {
        "回老兵": [
            [
                ["紫水晶屋", "地牢一层北1"],
                ["地牢一层北1", "阴森石屋"],
            ]
        ],
        "地牢一层北2": [
            [
                ["紫水晶屋", "地牢一层北2"],
                ["地牢一层北2", "打怪点", 0],
            ]
        ],
    },
    "地牢一层北2": {
        "回老兵": [
            [
                ["地牢一层北2", "地牢一层西1"],
                ["地牢一层西1", "铁灯笼屋"],
            ]
        ],
        "石墓小溪": [
            [
                ["地牢一层北2", "石墓小溪"],
            ]
        ],
        "黑暗地带": [
            [
                ["地牢一层北2", "石墓小溪"],
            ]
        ],
        "传奇部落": [
            [
                ["地牢一层北2", "石墓小溪"],
            ]
        ],
        "邪恶势力": [
            [
                ["地牢一层北2", "石墓小溪"],
            ]
        ],
        "一线天": [
            [
                ["地牢一层北2", "石墓小溪"],
            ]
        ],
    },
    "石墓小溪": {
        "回老兵": [
            [
                ["石墓小溪", "地牢一层北2"],
                ["地牢一层北2", "地牢一层西1"],
                ["地牢一层西1", "铁灯笼屋"],
            ]
        ],
        "地牢一层北2": [
            [
                ["紫水晶屋", "地牢一层北2"],
                ["地牢一层北2", "打怪点", 0],
            ]
        ],
        "黑暗地带": [
            [
                ["石墓小溪", "黑暗地带"],
                ["黑暗地带", "打怪点", 0],
            ]
        ],
        "传奇部落": [
            [
                ["石墓小溪", "黑暗地带"],
                ["黑暗地带", "打怪点", 0],
            ]
        ],
        "邪恶势力": [
            [
                ["石墓小溪", "黑暗地带"],
                ["黑暗地带", "打怪点", 0],
            ]
        ],
        "一线天": [
            [
                ["石墓小溪", "黑暗地带"],
                ["黑暗地带", "打怪点", 0],
            ]
        ],
    },
    "黑暗地带": {
        "回老兵": [
            [
                ["黑暗地带", "石墓小溪"],
            ]
        ],
        "传奇部落": [
            [
                ["黑暗地带", "传奇部落"],
                ["传奇部落", "打怪点", 0],
            ]
        ],
        "邪恶势力": [
            [
                ["黑暗地带", "传奇部落"],
                ["传奇部落", "打怪点", 0],
            ]
        ],
        "一线天": [
            [
                ["黑暗地带", "传奇部落"],
                ["传奇部落", "打怪点", 0],
            ]
        ],
    },
    "传奇部落": {
        "回老兵": [
            [
                ["传奇部落", "黑暗地带"],
                ["黑暗地带", "石墓小溪"],
            ]
        ],
        "邪恶势力": [
            [
                ["传奇部落", "邪恶势力"],
                ["邪恶势力", "打怪点", 0],
            ]
        ],
        "一线天": [
            [
                ["传奇部落", "邪恶势力"],
                ["邪恶势力", "打怪点", 0],
            ]
        ],
    },
    "一线天": {
        "回老兵": [
            [
                ["一线天", "邪恶势力"],
                ["邪恶势力", "传奇部落"],
                ["传奇部落", "黑暗地带"],
                ["黑暗地带", "石墓小溪"],
            ]
        ]
    },
    "比奇": {
        "比奇野外": [
            [
                ["比奇野外", "打怪点", 0],
            ]
        ],
        "兽人古墓一层": [
            [
                ["比奇大城", "兽人古墓一层"],
                ["兽人古墓一层", "打怪点", 0]
            ]
        ],
        "兽人古墓二层": [
            [
                ["比奇大城", "兽人古墓一层"],
                ["兽人古墓一层", "兽人古墓二层"],
                ["兽人古墓二层", "打怪点", 0]
            ]
        ],
        "兽人古墓三层": [
            [
                ["比奇大城", "兽人古墓一层"],
                ["兽人古墓一层", "兽人古墓二层"],
                ["兽人古墓二层", "兽人古墓三层"],
                ["兽人古墓三层", "打怪点", 0]
            ]
        ],
        "回老兵": [
            [
                ["比奇大城", "比奇老兵"],
            ]
        ],
        "沃玛森林": [
            [
                ["比奇大城", "沃玛森林"]
            ]
        ],
        "沃玛寺庙入口": [
            [
                ["比奇大城", "沃玛森林"],
                ["沃玛森林", "沃玛寺庙入口"]
            ]
        ],
        "沃玛寺庙一层": [
            [
                ["比奇大城", "沃玛森林"],
                ["沃玛森林", "沃玛寺庙入口"]
            ],
            [
                ["沃玛寺庙入口", "沃玛寺庙一层"],
                ["沃玛寺庙一层", "打怪点", 0],
            ]
        ],
        "沃玛寺庙二层": [
            [
                ["比奇大城", "沃玛森林"],
                ["沃玛森林", "沃玛寺庙入口"],
            ],
            [
                ["沃玛寺庙入口", "沃玛寺庙一层"],
                ["沃玛寺庙一层", "沃玛寺庙二层"],
                ["沃玛寺庙二层", "打怪点", 0],
            ]
        ],
    },
    "比奇野外": {
        "回老兵": [
            [
                ["比奇大城", "比奇老兵"],
            ]
        ]
    },
    "兽人古墓一层": {
        "兽人古墓二层": [
            [
                ["兽人古墓一层", "兽人古墓二层"],
                ["兽人古墓二层", "打怪点", 0]
            ]
        ],
        "兽人古墓三层": [
            [
                ["兽人古墓一层", "兽人古墓二层"],
                ["兽人古墓二层", "兽人古墓三层"],
                ["兽人古墓三层", "打怪点", 0]
            ]
        ],
        "回老兵": [
            [
                ["兽人古墓一层", "比奇省"],
                ["比奇大城", "比奇老兵"],
            ]
        ]
    },
    "兽人古墓二层": {
        "兽人古墓一层": [
            [
                ["兽人古墓二层", "兽人古墓一层"],
                ["兽人古墓一层", "打怪点", 0]
            ]
        ],
        "兽人古墓三层": [
            [
                ["兽人古墓二层", "兽人古墓三层"],
                ["兽人古墓三层", "打怪点", 0]
            ]
        ],
        "回老兵": [
            [
                ["兽人古墓二层", "兽人古墓一层"],
                ["兽人古墓一层", "比奇省"],
                ["比奇大城", "比奇老兵"],
            ]
        ]
    },
    "兽人古墓三层": {
        "兽人古墓二层": [
            [
                ["兽人古墓三层", "兽人古墓二层"],
                ["兽人古墓二层", "打怪点", 0]
            ]
        ],
        "兽人古墓一层": [
            [
                ["兽人古墓三层", "兽人古墓二层"],
                ["兽人古墓二层", "兽人古墓一层"],
                ["兽人古墓一层", "打怪点", 0]
            ]
        ],
        "回老兵": [
            [
                ["兽人古墓三层", "兽人古墓二层"],
                ["兽人古墓二层", "兽人古墓一层"],
                ["兽人古墓一层", "比奇省"],
                ["比奇大城", "比奇老兵"],
            ]
        ]
    },
    "沃玛森林": {
        "回老兵": [
            [
                ["沃玛森林", "比奇省"],
                ["比奇大城", "比奇老兵"]
            ]
        ],
        "沃玛寺庙入口": [
            [
                ["沃玛森林", "沃玛寺庙入口"]
            ]
        ],
        "沃玛寺庙一层": [
            [
                ["沃玛森林", "沃玛寺庙入口"],
            ],
            [
                ["沃玛寺庙入口", "沃玛寺庙一层"],
                ["沃玛寺庙一层", "打怪点", 0],
            ]
        ],
        "沃玛寺庙二层": [
            [
                ["沃玛森林", "沃玛寺庙入口"],
            ],
            [
                ["沃玛寺庙入口", "沃玛寺庙一层"],
                ["沃玛寺庙一层", "沃玛寺庙二层"],
                ["沃玛寺庙二层", "打怪点", 0],
            ]
        ],
    },
    "沃玛寺庙入口": {
        "回老兵": [
            [
                ["沃玛寺庙入口", "沃玛森林"],
                ["沃玛森林", "比奇省"],
                ["比奇大城", "比奇老兵"]
            ]
        ],
        "沃玛森林": [
            [
                ["沃玛寺庙入口", "沃玛森林"]
            ]
        ],
        "沃玛寺庙一层": [
            [
                ["沃玛寺庙入口", "沃玛寺庙一层"],
                ["沃玛寺庙一层", "打怪点", 0],
            ]
        ],
        "沃玛寺庙二层": [
            [
                ["沃玛寺庙入口", "沃玛寺庙一层"],
                ["沃玛寺庙一层", "沃玛寺庙二层"],
                ["沃玛寺庙二层", "打怪点", 0],
            ]
        ],
    },
    "沃玛寺庙一层": {
        "回老兵": [
            [
                ["沃玛寺庙一层", "沃玛寺庙入口"],
            ],
            [
                ["沃玛寺庙入口", "沃玛森林"],
                ["沃玛森林", "比奇省"],
                ["比奇大城", "比奇老兵"]
            ]
        ],
        "沃玛寺庙二层": [
            [
                ["沃玛寺庙一层", "沃玛寺庙二层"],
                ["沃玛寺庙二层", "打怪点", 0],
            ]
        ],
    },
    "沃玛寺庙二层": {
        "回老兵": [
            [
                ["沃玛寺庙二层", "沃玛寺庙一层"],
                ["沃玛寺庙一层", "沃玛寺庙入口"],
            ],
            [
                ["沃玛寺庙入口", "沃玛森林"],
                ["沃玛森林", "比奇省"],
                ["比奇大城", "比奇老兵"]
            ]
        ],
        "沃玛寺庙一层": [
            [
                ["沃玛寺庙二层", "沃玛寺庙一层"],
                ["沃玛寺庙一层", "打怪点", 0],
            ]
        ],
    },
    "连接通道九": {
        "回老兵": [
            ["连接通道九", "地牢一层东"],
            ["地牢一层东", "盟重省"],
            ["盟重大城", "盟重老兵"],
        ],
        "地牢一层东": [
            ["地牢一层东", "打怪点", 0]
        ]
    }
}
config.沿途打怪点 = ["兽人古墓一层", "兽人古墓二层", "兽人古墓三层", "沃玛寺庙入口", "沃玛寺庙一层", "沃玛寺庙二层", "地牢一层东", "地牢一层北1",
    "连接通道九", "连接通道八", "连接通道七", "连接通道六", "骨魔洞一层", "骨魔洞二层", "骨魔洞三层", "石墓三层", "石墓四层", "石墓五层",
    "牛魔寺庙一层", "牛魔寺庙二层", "牛魔寺庙三层", "牛魔寺庙四层", "牛魔寺庙五层"]
config.地图路由 = {
    "苍月岛": config.地图跳转表["苍月"],
    "苍月岛渔村": config.地图跳转表["苍月"],
    "比奇省": config.地图跳转表["比奇"],
    "苍月岛 ": config.地图跳转表["苍月"],
    "比奇城": config.地图跳转表["比奇"],
    "银杏山谷": config.地图跳转表["比奇"],
    "边界村": config.地图跳转表["比奇"],
    "兽人古墓一层": config.地图跳转表["兽人古墓一层"],
    "兽人古墓二层": config.地图跳转表["兽人古墓二层"],
    "兽人古墓三层": config.地图跳转表["兽人古墓三层"],
    "沃玛森林": config.地图跳转表["沃玛森林"],
    "沃玛寺庙入口": config.地图跳转表["沃玛寺庙入口"],
    "沃玛寺庙一层": config.地图跳转表["沃玛寺庙一层"],
    "沃玛寺庙二层": config.地图跳转表["沃玛寺庙二层"],
    "土城": config.地图跳转表["盟重"],
    "盟重省": config.地图跳转表["盟重"],
    "红名村": config.地图跳转表["盟重"],
    "沙巴克": config.地图跳转表["盟重"],
    "祖玛寺庙": config.地图跳转表["盟重"],
    "地牢一层东": config.地图跳转表["地牢一层东"],
    "地牢一层北1": config.地图跳转表["地牢一层北1"],
    "铁灯笼屋": config.地图跳转表["铁灯笼屋"],
    "阴森石屋": config.地图跳转表["阴森石屋"],
    "阴森石路": config.地图跳转表["阴森石路"],
    "紫水晶屋": config.地图跳转表["紫水晶屋"],

    "连接通道九": config.地图跳转表["连接通道九"],
    "连接通道八": config.地图跳转表["连接通道八"],
    "连接通道七": config.地图跳转表["连接通道七"],
    "连接通道六": config.地图跳转表["连接通道六"],

    "骨魔洞一层": config.地图跳转表["骨魔洞一层"],
    "骨魔洞二层": config.地图跳转表["骨魔洞二层"],
    "骨魔洞三层": config.地图跳转表["骨魔洞三层"],

    "石墓入口": config.地图跳转表["石墓入口"],
    "石墓一层": config.地图跳转表["石墓一层"],
    "石墓二层": config.地图跳转表["石墓二层"],
    "石墓三层": config.地图跳转表["石墓三层"],
    "石墓四层": config.地图跳转表["石墓四层"],
    "石墓五层": config.地图跳转表["石墓五层"],

    "牛魔寺庙入口": config.地图跳转表["牛魔寺庙入口"],
    "牛魔寺庙一层": config.地图跳转表["牛魔寺庙一层"],
    "牛魔寺庙二层": config.地图跳转表["牛魔寺庙二层"],
    "牛魔寺庙三层": config.地图跳转表["牛魔寺庙三层"],
    "牛魔寺庙四层": config.地图跳转表["牛魔寺庙四层"],
    "牛魔寺庙五层": config.地图跳转表["牛魔寺庙五层"],
}
config.城市对应 = {
    "比奇": ["比奇省", "比奇城", "银杏山谷", "边界村", "兽人古墓一层", "兽人古墓二层", "兽人古墓三层"],
    "盟重": ["盟重省", "红名村", "沙巴克", "土城", "祖玛寺庙"],
}
config.需存仓库装备 = [
    "炼狱", "魔杖", "银蛇", "井中月", "血饮", "无极棍", "裁决", "骨玉", "龙纹", "幽灵项链",
    "生命", "思贝儿", "心灵手镯", "龙之", "红宝石", "铂金", "绿色", "铃铛", "祝福",
    "灵魂项链", "骑士", "三眼", "力量", "紫碧", "泰坦", "组队", "100"] //这里100 是雪霜读出来的可能性最大
config.怪物集合 = {
    "兽人古墓": ["骷髅战士", "骷髅", "骷髅战将", "洞蛆", "掷斧骷髅"]
}
config.zuobiao = {
    石墓阵: {
        右: {
            x: 37,
            y: 16
        },
        左: {
            x: 13,
            y: 37
        },
        上: {
            x: 17,
            y: 12
        },
        下: {
            x: 37,
            y: 35
        }
    },
    走一格像素: {
        '720_1280': {
            x: 64,
            y: 43
        }
    },
    身边怪物范围: {
        '720_1280': {
            x1: 550,
            y1: 250,
            x2: 730,
            y2: 365
        }
    },
    人物中心: {
        '720_1280': {
            x: 639,
            y: 296
        }
    },
    人物血量所在格数: {
        '720_1280': {
            x: 9,
            y: 4
        }
    },
    人物血量左上: {
        '720_1280': {
            x: 619,
            y: 245
        }
    },
    人物血量中心: {
        '720_1280': {
            x: 640,
            y: 246
        }
    },
    屏幕血条分布: {
        '720_1280': {
            文字距离血条高度: 51,
            血条宽度: 42,
            血条宽度间隔: 64,
            血条高度间隔: 42,
            x_max: 19,
            y_max: 15,
            x起点: 44,
            y起点: 32
        }
    },
    地下秘密通道入口偏移: {
        '720_1280': {
            x: -350,
            y: 243
        }
    },
    遥感中心位置: {
        '720_1280': {
            x: 134,
            y: 542
        }
    },
    锁定怪物标识范围: {
        '720_1280': {
            x: [505, 760],
            y: [2, 62],
            找色: [{
                color: "#C4B6A2"
            }, {
                color: "#FF0300",
                x: 35,
                y: 29
            }]
        }
    },
    左攻击面板: {
        '720_1280': {
            展开: {
                x: [10, 15],
                y: [210, 226]
            },
            切换: {
                x: [16, 26],
                y: [208, 228]
            },
            选择怪物: {
                x: [14, 24],
                y: [280, 302]
            },
            选择怪物攻击: {
                x: [142, 182],
                y: [130, 142]
            },
            怪物集合: {
                x: [45, 239],
                y: [115, 325],
                找色: [{
                    color: "#FF2300"
                }, {
                    color: "#FF4500",
                    x: 63,
                    y: 0
                }, {
                    color: "#C73600",
                    x: 72,
                    y: 0
                }],
                // 找色: [{
                //     color: "#6E3818"
                // }, {
                //     color: "#FF2300",
                //     x: 95,
                //     y: 8
                // }, {
                //     color: "#E73F00",
                //     x: 166,
                //     y: 8
                // }, {
                //     color: "#5D1A02",
                //     x: 168,
                //     y: 8
                // }],
                找色非满血: [{
                    color: "#C70000"
                }, {
                    color: "#FA0100",
                    x: 2,
                    y: 0
                }]
            }
            //findMultiColors(img, "#E1D6B7", [[43, 15, "#FF0600"]],{
        }
    },
    设置面板: {
        '720_1280': {
            随机保护: {
                x: [268, 305],
                y: [429, 459]
            },
            血量加药: {
                x: [262, 305],
                y: [222, 260]
            },
            高亮显血自己: {
                x: [268, 305],
                y: [268, 305]
            },
            高亮显血组队: {
                x: [268, 305],
                y: [305, 340]
            },
            //findMultiColors(img, "#E1D6B7", [[43, 15, "#FF0600"]],{
        }
    },
    存取范围: {
        '720_1280': {
            仓库: {
                x: 12,
                y: 30,
                w: 500,
                h: 340,
                中心: {
                    x: 230,
                    y: 230
                }
            },
            包袱: {
                x: 670,
                y: 8,
                w: 485,
                h: 303,
                中心: {
                    x: 894,
                    y: 160
                }
            }
        }
    },

    按钮集合: {
        '720_1280': {
            拾取: {
                x: [950, 960],
                y: [360, 370],
                默认: {
                    c1: "#E1EAFF",
                    x2: 14,
                    y2: 6,
                    c2: "#5674BD",
                    x3: 29,
                    y3: 23,
                    c3: "#557798",
                },
                激活: {
                    c1: "#F6FFFF",
                    x2: 14,
                    y2: 6,
                    c2: "#6EB9EB",
                    x3: 29,
                    y3: 23,
                    c3: "#92F1FC",
                }
            },
            宠物: {
                x: [940, 963],
                y: [276, 295],
            },
            普攻: {
                x: [1170, 1221],
                y: [580, 620]
            },
            组队: {
                x: [1153, 1179],
                y: [270, 296]
            },
            好友: {
                x: [1007, 1033],
                y: [270, 296]
            },
            打符: {
                x: [1211, 1246],
                y: [440, 470]
            },
            隐身: {
                x: [1110, 1158],
                y: [470, 499]
            },
            打防: {
                x: [950, 991],
                y: [532, 576]
            },
            打魔: {
                x: [1145, 1188],
                y: [351, 395]
            },
            施毒: {
                x: [1021, 1068],
                y: [620, 660]
            },
            召唤宝宝: {
                x: [1044, 1089],
                y: [529, 571]
            },
            技能冷却: {
                c1: "#FFFFFF",
                x2: 0,
                y2: 15,
                c2: "#FFFFFF",
                x3: 12,
                y3: 15,
                c3: "#FFFFFF",
            },
            模式: {
                x: [1225, 1254],
                y: [206, 225],
                找色: [{
                    color: "#F1F0EE"
                }, {
                    color: "#706452",
                    x: 8,
                    y: -9
                }, {
                    color: "#69666A",
                    x: 9,
                    y: 10
                }, {
                    color: "#625E5C",
                    x: 18,
                    y: 1
                }]
            },
            模式2: {
                x: [1225, 1254],
                y: [206, 225],
                找色: [{
                    color: "#F1F0EE"
                }, {
                    color: "#F1F0EE",
                    x: 8,
                    y: -9
                }, {
                    color: "#69666A",
                    x: 9,
                    y: 10
                }, {
                    color: "#625E5C",
                    x: 18,
                    y: 1
                }]
            },
            左第一个怪: {
                x: [58, 74],
                y: [126, 144]
            },
            左上箭头: {
                x: [18, 22],
                y: [50, 60]
            },
            分身派遣: {
                x: [130, 270],
                y: [460, 520]
            },
            分身派遣2: {
                x: [327, 367],
                y: [484, 504]
            },
            分身领取奖励: {
                x: [526, 645],
                y: [499, 558]
            },
            分身确定修炼: {
                x: [657, 798],
                y: [404, 472]
            },
            分身加时按钮: {
                x: [645, 760],
                y: [500, 555]
            },
            铺: {
                x: [910, 925],
                y: [660, 670]
            },
            铺关闭: {
                x: [1145, 1155],
                y: [64, 72]
            },
            捆药绳: {
                x: [550, 600],
                y: [415, 435]
            },
            购买物品: {
                x: [810, 850],
                y: [585, 595]
            },
            购买确定: {
                x: [700, 750],
                y: [430, 440]
            },
            万年雪霜包: {
                x: [260, 290],
                y: [90, 100]
            }
        },
    },
    苍月安全区坐标范围: {
        x1: 125,
        x2: 145,
        y1: 318,
        y2: 338
    },
    盟重安全区坐标范围: {
        x1: 321,
        x2: 340,
        y1: 321,
        y2: 340
    },
    比奇安全区坐标范围: {
        x1: 322,
        x2: 336,
        y1: 257,
        y2: 278
    },
    比奇老兵坐标: {
        x: 330,
        y: 270
    },
    比奇小贩坐标: {
        x: 326,
        y: 266
    },
    盟重小贩坐标: {
        x: 329,
        y: 325
    },
    苍月小贩坐标: {
        x: 137,
        y: 326
    },
    丢东西范围: {
        '720_1280': {
            x: [945, 1261],
            y: [472, 680]
        }
    },
    比奇小贩按钮: {
        '720_1280': {
            x1: 764,
            x2: 900,
            y1: 414,
            y2: 446
        }
    },
    比奇小贩面板: {
        购买物品: {
            '720_1280': {
                x1: 80,
                x2: 170,
                y1: 88,
                y2: 105
            }
        },
        出售物品: {
            '720_1280': {
                x1: 317,
                x2: 405,
                y1: 88,
                y2: 105
            }
        },
        普通修理: {
            '720_1280': {
                x1: 80,
                x2: 170,
                y1: 144,
                y2: 162
            }
        },
        特殊修理: {
            '720_1280': {
                x1: 317,
                x2: 405,
                y1: 144,
                y2: 162
            }
        },
        保存物品: {
            '720_1280': {
                x1: 80,
                x2: 170,
                y1: 202,
                y2: 217
            }
        }
    },
    药品格子面板: {
        '720_1280': {
            x1: 497,
            x2: 873,
            y1: 567,
            y2: 609
        }
    },
    聊天框面板: {
        '720_1280': {
            x1: 472,
            x2: 887,
            y1: 610,
            y2: 697
        }
    },
    聊天框最后一行: {
        '720_1280': {
            x1: 492,
            x2: 880,
            y1: 667,
            y2: 700,
        }
    },
    左侧大聊天框面板: {
        '720_1280': {
            x1: 110,
            x2: 472,
            y1: 11,
            y2: 550
        }
    },
    比奇大地图偏移_old: {
        '720_1280': {
            比奇大城: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                比奇老兵: {
                    x: [-80, -120],
                    y: [456, 476]
                },
                兽人古墓一层: {
                    x: [-80, -120],
                    y: [120, 140]
                },
                沃玛森林: {
                    x: [-80, -120],
                    y: [165, 185]
                },
            },
            沃玛森林: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                丛林迷宫: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                封魔谷: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                沃玛寺庙入口: {
                    x: [-80, -120],
                    y: [210, 230]
                }
            },
            沃玛寺庙入口: {
                是否沿途打怪: false,
                是否是断点: true,
                是否需要随机: false,
                沃玛森林: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                沃玛寺庙一层: {
                    x: [-80, -120],
                    y: [165, 185]
                }
            },
            沃玛寺庙一层: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                沃玛寺庙入口: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                沃玛寺庙二层: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: [-465, -460],
                        y: [402, 410],
                        坐标范围: {
                            点击次数: 5
                        }
                    },
                    {
                        x: [-605, -610],
                        y: [150, 155],
                        坐标范围: {
                            点击次数: 5
                        }
                    },
                    {
                        x: [-955, -945],
                        y: [260, 270],
                        坐标范围: {
                            点击次数: 5
                        }
                    },
                    {
                        x: [-636, -616],
                        y: [233, 253],
                        坐标范围: {
                            点击次数: 5
                        }
                    }
                ]
            },
            兽人古墓: {
                第一层: {
                    是否沿途打怪: false,
                    是否是断点: false,
                    是否需要随机: false,
                    比奇省: {
                        x: [-80, -120],
                        y: [120, 140]
                    },
                    兽人古墓二层: {
                        x: [-80, -120],
                        y: [165, 185]
                    },
                    打怪点: [
                        {
                            x: [-510, -540],
                            y: [356, 376],
                            坐标范围: {
                                x: [225, 267],
                                y: [226, 292],
                                点击次数: 10
                            }
                        },
                        {
                            x: [-285, -300],
                            y: [210, 230],
                            坐标范围: {
                                x: [356, 376],
                                y: [122, 160],
                                点击次数: 10
                            }
                        },
                        {
                            x: [-520, -580],
                            y: [140, 170],
                            坐标范围: {
                                x: [227, 264],
                                y: [66, 105],
                                点击次数: 10
                            }
                        },
                        {
                            x: [-828, -848],
                            y: [129, 149],
                            坐标范围: {
                                x: [86, 100],
                                y: [55, 82],
                                点击次数: 10
                            }
                        },
                        {
                            x: [-785, -800],
                            y: [420, 438],
                            坐标范围: {
                                x: [100, 126],
                                y: [272, 302],
                                点击次数: 10
                            }
                        },
                    ]
                },
                第二层: {
                    是否沿途打怪: false,
                    是否是断点: false,
                    是否需要随机: false,
                    兽人古墓一层: {
                        x: [-80, -120],
                        y: [120, 140],
                    },
                    兽人古墓三层: {
                        x: [-80, -120],
                        y: [165, 185]
                    },
                    打怪点: [
                        {
                            x: [-433, -453],
                            y: [402, 422],
                            坐标范围: {
                                x: [265, 320],
                                y: [254, 320],
                                点击次数: 10
                            }
                        },
                        {
                            x: [-564, -584],
                            y: [147, 167],
                            坐标范围: {
                                x: [214, 239],
                                y: [74, 99],
                                点击次数: 10
                            }
                        },
                        {
                            x: [-863, -883],
                            y: [357, 377],
                            坐标范围: {
                                x: [51, 95],
                                y: [229, 263],
                                点击次数: 10
                            }
                        }
                    ]
                },
                第三层: {
                    是否沿途打怪: false,
                    是否是断点: false,
                    是否需要随机: false,
                    兽人古墓二层: {
                        x: [-80, -120],
                        y: [120, 140]
                    },
                    打怪点: [
                        {
                            x: [-830, -930],
                            y: [235, 275]
                        },
                        {
                            x: [-600, -700],
                            y: [300, 350]
                        },
                        {
                            x: [-500, -585],
                            y: [410, 470]
                        },
                        {
                            x: [-800, -855],
                            y: [400, 450]
                        },
                    ]
                }
            },
            僵尸洞: {
                第一层: {
                    比奇老兵: {
                        x: [-80, -120],
                        y: [456, 476]
                    },
                    废墟入口: {
                        x: [-80, -120],
                        y: [303, 323]
                    }
                }
            }
        }

    },
    打怪点偏移: {
        '720_1280': {
            x: 1137,
            y: 39
        }
    },
    比奇大地图偏移: {
        '720_1280': {
            比奇大城: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                比奇老兵: {
                    x: [-80, -120],
                    y: [456, 476]
                },
                兽人古墓一层: {
                    x: [-80, -120],
                    y: [120, 140]
                },
                沃玛森林: {
                    x: [-80, -120],
                    y: [165, 185]
                },
            },
            沃玛森林: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                丛林迷宫: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                封魔谷: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                沃玛寺庙入口: {
                    x: [-80, -120],
                    y: [210, 230]
                },
                比奇省: {
                    x: [-80, -120],
                    y: [255, 275]
                }
            },
            比奇野外: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                打怪点: [
                    {
                        x: 567,
                        y: 348
                    },
                    {
                        x: 535,
                        y: 367,
                    },
                    {
                        x: 538,
                        y: 421,
                    },
                    {
                        x: 566,
                        y: 508,
                    },

                    {
                        x: 589,
                        y: 567,
                    },
                    {
                        x: 725,
                        y: 557,
                    },
                    {
                        x: 792,
                        y: 547,
                    },
                    {
                        x: 843,
                        y: 491,
                    },
                    {
                        x: 867,
                        y: 373,
                    },
                    {
                        x: 812,
                        y: 183,
                    },
                    {
                        x: 692,
                        y: 189,
                    },
                    {
                        x: 595,
                        y: 169,
                    },
                    {
                        x: 669,
                        y: 247,
                    },
                    {
                        x: 647,
                        y: 291,
                    },
                    {
                        x: 589,
                        y: 332,
                    }
                ]
            },
            沃玛寺庙入口: {
                是否沿途打怪: false,
                是否是断点: true,
                是否需要随机: false,
                沃玛森林: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                沃玛寺庙一层: {
                    x: [-80, -120],
                    y: [165, 185]
                }
            },
            沃玛寺庙一层: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                沃玛寺庙入口: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                沃玛寺庙二层: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: [-465, -460],
                        y: [402, 410],
                        坐标范围: {
                            点击次数: 5
                        }
                    },
                    {
                        x: [-605, -610],
                        y: [150, 155],
                        坐标范围: {
                            点击次数: 5
                        }
                    },
                    {
                        x: [-955, -945],
                        y: [260, 270],
                        坐标范围: {
                            点击次数: 5
                        }
                    },
                    {
                        x: [-636, -616],
                        y: [233, 253],
                        坐标范围: {
                            点击次数: 5
                        }
                    }
                ]
            },
            沃玛寺庙二层: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                沃玛寺庙一层: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                沃玛寺庙: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: [-580, -600],
                        y: [273, 293],
                        坐标范围: {
                            点击次数: 3
                        }
                    },
                    {
                        x: [-498, -492],
                        y: [523, 529],
                        坐标范围: {
                            点击次数: 5
                        }
                    },
                    {
                        x: [-630, -624],
                        y: [507, 513],
                        坐标范围: {
                            点击次数: 5
                        }
                    },
                    {
                        x: [-935, -931],
                        y: [503, 509],
                        坐标范围: {
                            点击次数: 25
                        }
                    }
                ]
            },
            兽人古墓一层: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                比奇省: {
                    x: [-80, -120],
                    y: [120, 140]
                },
                兽人古墓二层: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: 420,
                        y: 533,
                    },
                    {
                        x: 543,
                        y: 535,
                    },
                    {
                        x: 619,
                        y: 412,
                    },
                    {
                        x: 856,
                        y: 408,
                    },
                    {
                        x: 887,
                        y: 364,
                    },
                    {
                        x: 830,
                        y: 227,
                    },
                    {
                        x: 579,
                        y: 204,
                    },
                    {
                        x: 466,
                        y: 115,
                    },
                    {
                        x: 299,
                        y: 178,
                    },
                    {
                        x: 316,
                        y: 262,
                    },
                    {
                        x: 344,
                        y: 462,
                    },
                    {
                        x: 496,
                        y: 427,
                    }
                ]
            },
            兽人古墓二层: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                兽人古墓一层: {
                    x: [-80, -120],
                    y: [120, 140],
                },
                兽人古墓三层: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: 296,
                        y: 473,
                    },
                    {
                        x: 527,
                        y: 451,
                    },
                    {
                        x: 506,
                        y: 342,
                    },
                    {
                        x: 620,
                        y: 448,
                    },
                    {
                        x: 800,
                        y: 533,
                    },
                    {
                        x: 763,
                        y: 358,
                    },
                    {
                        x: 710,
                        y: 282,
                    },
                    {
                        x: 807,
                        y: 170,
                    },
                    {
                        x: 647,
                        y: 159,
                    },
                    {
                        x: 434,
                        y: 126,
                    },
                    {
                        x: 388,
                        y: 219,
                    },
                    {
                        x: 267,
                        y: 415,
                    },
                ]
            },
            兽人古墓三层: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                兽人古墓二层: {
                    x: [-80, -120],
                    y: [120, 140]
                },
                打怪点: [
                    {
                        x: [-830, -930],
                        y: [235, 275],
                        坐标范围: {
                            x: [265, 320],
                            y: [254, 320],
                            点击次数: 5
                        }
                    },
                    {
                        x: [-600, -700],
                        y: [300, 350],
                        坐标范围: {
                            x: [265, 320],
                            y: [254, 320],
                            点击次数: 5
                        }
                    },
                    {
                        x: [-500, -585],
                        y: [410, 470],
                        坐标范围: {
                            x: [265, 320],
                            y: [254, 320],
                            点击次数: 5
                        }
                    },
                    {
                        x: [-800, -855],
                        y: [400, 450],
                        坐标范围: {
                            x: [265, 320],
                            y: [254, 320],
                            点击次数: 5
                        }
                    },
                ]
            },
            僵尸洞: {
                第一层: {
                    比奇老兵: {
                        x: [-80, -120],
                        y: [456, 476]
                    },
                    废墟入口: {
                        x: [-80, -120],
                        y: [303, 323]
                    }
                }
            }
        }

    },
    盟重大地图偏移: {
        '720_1280': {
            盟重大城: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                盟重老兵: {
                    x: [-80, -120],
                    y: [415, 435]
                },
                地牢一层东: {
                    x: [-80, -120],
                    y: [163, 183]
                },
                石墓入口: {
                    x: [-80, -120],
                    y: [251, 271]
                },
                武馆教头: {
                    x: [-80, -120],
                    y: [512, 532]
                },
            },
            石墓入口: {
                是否沿途打怪: false,
                是否是断点: true,
                是否需要随机: false,
                盟重省: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                石墓一层: {
                    x: [-80, -120],
                    y: [165, 185]
                },
            },
            石墓一层: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                石墓入口: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                石墓二层: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: [-534, -540],
                        y: [243, 248],
                        坐标范围: {
                            x: [60, 101],
                            y: [90, 124],
                            点击次数: 3
                        }
                    }
                ]
            },
            石墓二层: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                石墓一层: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                石墓三层: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: [-304, -314],
                        y: [222, 232],
                        坐标范围: {
                            x: [60, 101],
                            y: [90, 124],
                            点击次数: 3
                        }
                    },
                    {
                        x: [-322, -332],
                        y: [146, 156],
                        坐标范围: {
                            x: [31, 47],
                            y: [22, 34],
                            点击次数: 3
                        }
                    },
                    {
                        x: [-510, -519],
                        y: [91, 111],
                        坐标范围: {
                            x: [178, 202],
                            y: [100, 129],
                            点击次数: 3
                        }
                    },
                    {
                        x: [-930, -939],
                        y: [262, 272],
                        坐标范围: {
                            x: [143, 173],
                            y: [39, 75],
                            点击次数: 3
                        }
                    },

                    {
                        x: [-800, -810],
                        y: [293, 303],
                        坐标范围: {
                            x: [143, 173],
                            y: [39, 75],
                            点击次数: 3
                        }
                    },

                    {
                        x: [-667, -677],
                        y: [430, 440],
                        坐标范围: {
                            x: [143, 173],
                            y: [39, 75],
                            点击次数: 3
                        }
                    },

                    {
                        x: [-889, -899],
                        y: [342, 352],
                        坐标范围: {
                            x: [143, 173],
                            y: [39, 75],
                            点击次数: 3
                        }
                    },

                    {
                        x: [-675, -685],
                        y: [486, 496],
                        坐标范围: {
                            x: [143, 173],
                            y: [39, 75],
                            点击次数: 3
                        }
                    },


                    {
                        x: [-610, -618],
                        y: [150, 155],
                        坐标范围: {
                            x: [143, 173],
                            y: [39, 75],
                            点击次数: 3
                        }
                    },

                    {
                        x: [-528, -532],
                        y: [240, 245],
                        坐标范围: {
                            x: [143, 173],
                            y: [39, 75],
                            点击次数: 3
                        }
                    },

                    {
                        x: [-510, -515],
                        y: [372, 378],
                        坐标范围: {
                            x: [143, 173],
                            y: [39, 75],
                            点击次数: 3
                        }
                    },
                ]
            },
            石墓三层: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                石墓二层: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                石墓四层: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: [-543, -548],
                        y: [110, 113],
                        坐标范围: {
                            x: [60, 101],
                            y: [90, 124],
                            点击次数: 3
                        }
                    },
                    {
                        x: [-534, -539],
                        y: [270, 275],
                        坐标范围: {
                            x: [31, 47],
                            y: [22, 34],
                            点击次数: 3
                        }
                    },
                    {
                        x: [-534, -539],
                        y: [365, 370],
                        坐标范围: {
                            x: [178, 202],
                            y: [100, 129],
                            点击次数: 3
                        }
                    },
                    {
                        x: [-437, -442],
                        y: [443, 448],
                        坐标范围: {
                            x: [143, 173],
                            y: [39, 75],
                            点击次数: 3
                        }
                    },

                    {
                        x: [-732, -737],
                        y: [448, 453],
                        坐标范围: {
                            x: [143, 173],
                            y: [39, 75],
                            点击次数: 3
                        }
                    },

                ]
            },
            石墓四层: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                石墓三层: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                石墓五层: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: [-640, -645],
                        y: [434, 439],
                        坐标范围: {
                            x: [60, 101],
                            y: [90, 124],
                            点击次数: 3
                        }
                    },
                    {
                        x: [-603, -608],
                        y: [280, 285],
                        坐标范围: {
                            x: [31, 47],
                            y: [22, 34],
                            点击次数: 3
                        }
                    },
                    {
                        x: [-713, -718],
                        y: [229, 234],
                        坐标范围: {
                            x: [178, 202],
                            y: [100, 129],
                            点击次数: 3
                        }
                    },
                    {
                        x: [-834, -839],
                        y: [186, 191],
                        坐标范围: {
                            x: [143, 173],
                            y: [39, 75],
                            点击次数: 3
                        }
                    },
                ]
            },
            石墓五层: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                石墓四层: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                打怪点偏移: {
                    x: 1137,
                    y: 39
                },
                打怪点: [
                    {
                        x: 227,
                        y: 454
                    },
                    {
                        x: 698,
                        y: 478
                    },
                    {
                        x: 870,
                        y: 331
                    },
                    {
                        x: 611,
                        y: 286
                    },
                    {
                        x: 284,
                        y: 359
                    },
                    {
                        x: 342,
                        y: 224
                    },
                    {
                        x: 275,
                        y: 168
                    },
                    {
                        x: 221,
                        y: 213
                    },
                    {
                        x: 454,
                        y: 140
                    },
                    {
                        x: 476,
                        y: 181
                    },
                    {
                        x: 518,
                        y: 204
                    },
                    {
                        x: 668,
                        y: 207
                    },
                    {
                        x: 283,
                        y: 188
                    },
                ]
            },
            石墓阵: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                打怪点: [
                    {
                        x: 283,
                        y: 188
                    },
                ]
            },
            地牢一层东: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                连接通道九: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                盟重省: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                铁灯笼屋: {
                    x: [-80, -120],
                    y: [210, 230]
                },
                阴森石屋: {
                    x: [-80, -120],
                    y: [260, 280]
                },
                打怪点: [
                    {
                        x: [-755, -800],
                        y: [247, 287],
                        坐标范围: {
                            x: [60, 101],
                            y: [90, 124],
                            点击次数: 8
                        }
                    },
                    {
                        x: [-900, -902],
                        y: [96, 98],
                        坐标范围: {
                            x: [31, 47],
                            y: [22, 34],
                            点击次数: 2
                        }
                    },
                    {
                        x: [-967, -971],
                        y: [447, 451],
                        坐标范围: {
                            x: [31, 47],
                            y: [22, 34],
                            点击次数: 2
                        }
                    },

                    {
                        x: [-433, -437],
                        y: [273, 277],
                        坐标范围: {
                            x: [178, 202],
                            y: [100, 129],
                            点击次数: 4
                        }
                    },
                    {
                        x: [-463, -467],
                        y: [120, 124],
                        坐标范围: {
                            x: [143, 173],
                            y: [39, 75],
                            点击次数: 5
                        }
                    },
                ]
            },
            连接通道九: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                连接通道八: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                地牢一层东: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: [-567, -547],
                        y: [439, 453],
                        坐标范围: {
                            x: [52, 70],
                            y: [74, 88],
                            点击次数: 1
                        }
                    },
                    {
                        x: [-772, -753],
                        y: [111, 139],
                        坐标范围: {
                            x: [29, 39],
                            y: [2, 20],
                            点击次数: 1
                        }
                    }
                ]
            },
            连接通道八: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                连接通道七: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                连接通道九: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: [-969, -942],
                        y: [341, 356],
                        坐标范围: {
                            x: [3, 20],
                            y: [73, 100],
                            点击次数: 5
                        }
                    },
                    {
                        x: [-297, -279],
                        y: [253, 264],
                        坐标范围: {
                            x: [130, 144],
                            y: [52, 77],
                            点击次数: 5
                        }
                    },
                    {
                        x: [-537, -490],
                        y: [221, 236],
                        坐标范围: {
                            x: [78, 106],
                            y: [35, 73],
                            点击次数: 5
                        }
                    }
                ]
            },
            连接通道七: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                连接通道六: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                连接通道八: {
                    x: [-80, -120],
                    y: [165, 185]
                }
            },
            连接通道六: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                连接通道七: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                连接通道九: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: [-957, -944],
                        y: [306, 318],
                        坐标范围: {
                            x: [4, 25],
                            y: [69, 88],
                            点击次数: 3
                        }
                    },
                    {
                        x: [-385, -347],
                        y: [452, 482],
                        坐标范围: {
                            x: [105, 145],
                            y: [107, 141],
                            点击次数: 3
                        }
                    },
                    {
                        x: [-830, -835],
                        y: [421, 429],
                        坐标范围: {
                            x: [105, 145],
                            y: [107, 141],
                            点击次数: 2
                        }
                    },
                    {
                        x: [-840, -827],
                        y: [296, 316],
                        坐标范围: {
                            x: [56, 89],
                            y: [62, 93],
                            点击次数: 3
                        }
                    },
                    {
                        x: [-485, -494],
                        y: [195, 205],
                        坐标范围: {
                            x: [56, 89],
                            y: [62, 93],
                            点击次数: 3
                        }
                    }
                ]
            },
            阴森石屋: {
                地牢一层东: {
                    x: [-80, -120],
                    y: [117, 137]
                },
                地牢一层北1: {
                    x: [-80, -120],
                    y: [163, 183]
                }
            },
            阴森石路: {
                地牢一层西2: {
                    x: [-80, -120],
                    y: [120, 140]
                },
                黑暗地带: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                地牢一层西1: {
                    x: [-80, -120],
                    y: [200, 220]
                },
                地牢一层北1: {
                    x: [-80, -120],
                    y: [260, 280]
                },
            },
            铁灯笼屋: {
                是否沿途打怪: false,
                是否是断点: true,
                是否需要随机: false,
                地牢一层东: {
                    x: [-80, -120],
                    y: [117, 137]
                },
                地牢一层西1: {
                    x: [-80, -120],
                    y: [163, 183]
                }
            },
            紫水晶屋: {
                是否沿途打怪: false,
                是否是断点: true,
                是否需要随机: false,
                地牢一层北2: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                地牢一层北1: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                地牢一层西2: {
                    x: [-80, -120],
                    y: [205, 225]
                }
            },
            地牢一层北1: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                紫水晶屋: {
                    x: [-80, -120],
                    y: [120, 140]
                },
                阴森石屋: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                阴森石路: {
                    x: [-80, -120],
                    y: [210, 230]
                },
                打怪点: [
                    {
                        x: 326,
                        y: 255,
                    },
                    {
                        x: 340,
                        y: 342,
                    },
                    {
                        x: 224,
                        y: 488,
                    },
                    {
                        x: 409,
                        y: 409,
                    },
                    {
                        x: 685,
                        y: 429,
                    },
                    {
                        x: 700,
                        y: 320,
                    },
                    {
                        x: 562,
                        y: 228,
                    },
                    {
                        x: 546,
                        y: 325,
                    },
                    {
                        x: 407,
                        y: 409,
                    },
                    {
                        x: 220,
                        y: 485,
                    },
                    {
                        x: 328,
                        y: 252,
                    },
                ]
            },
            地牢一层西1: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                铁灯笼屋: {
                    x: [-80, -120],
                    y: [120, 140]
                },
                地牢一层北2: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                阴森石路: {
                    x: [-80, -120],
                    y: [210, 230]
                },
                打怪点: [
                    {
                        x: 457,
                        y: 332,
                    },
                    {
                        x: 260,
                        y: 415,
                    },
                    {
                        x: 480,
                        y: 447,
                    },
                    {
                        x: 632,
                        y: 464,
                    },
                    {
                        x: 593,
                        y: 358,
                    },
                    {
                        x: 691,
                        y: 175,
                    },
                    {
                        x: 475,
                        y: 200,
                    },
                    {
                        x: 257,
                        y: 151,
                    },
                ]
            },
            地牢一层北2: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                地牢一层西1: {
                    x: [-80, -120],
                    y: [120, 140]
                },
                石墓小溪: { //注意和石墓阵冲突
                    x: [-80, -120],
                    y: [165, 185]
                },
                紫水晶屋: {
                    x: [-80, -120],
                    y: [210, 230]
                },
                打怪点: [
                    {
                        x: 871,
                        y: 270,
                    },
                    {
                        x: 822,
                        y: 395,
                    },
                    {
                        x: 612,
                        y: 157,
                    },
                    {
                        x: 321,
                        y: 455,
                    },
                    {
                        x: 316,
                        y: 156,
                    },
                ]
            },
            地牢一层西2: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                紫水晶屋: {
                    x: [-80, -120],
                    y: [120, 140]
                },
                阴森石路: { //注意和石墓阵冲突
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: 696,
                        y: 210,
                    },
                    {
                        x: 227,
                        y: 166,
                    },
                    {
                        x: 266,
                        y: 483,
                    },
                    {
                        x: 528,
                        y: 417,
                    },
                ]
            },
            黑暗地带: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                阴森石路: {
                    x: [-80, -120],
                    y: [120, 140]
                },
                石墓小溪: { //注意和石墓阵冲突
                    x: [-80, -120],
                    y: [165, 185]
                },
                传奇部落: {
                    x: [-80, -120],
                    y: [210, 230]
                },
                生死之间: {
                    x: [-80, -120],
                    y: [255, 275]
                },
                幽名圣域: {
                    x: [-80, -120],
                    y: [300, 320]
                },
                打怪点: [
                    {
                        x: 276,
                        y: 155,
                    },
                    {
                        x: 688,
                        y: 184,
                    },
                    {
                        x: 720,
                        y: 536,
                    },
                    {
                        x: 327,
                        y: 548,
                    },
                    {
                        x: 339,
                        y: 250,
                    },
                    {
                        x: 698,
                        y: 320,
                    },
                    {
                        x: 650,
                        y: 479,
                    },
                ]
            },
            传奇部落: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                黑暗地带: {
                    x: [-80, -120],
                    y: [120, 140]
                },
                邪恶势力: { //注意和石墓阵冲突
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: 702,
                        y: 525,
                    },
                    {
                        x: 772,
                        y: 232,
                    },
                    {
                        x: 273,
                        y: 212,
                    },
                    {
                        x: 249,
                        y: 532,
                    },
                ]
            },
            邪恶势力: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                传奇部落: {
                    x: [-80, -120],
                    y: [120, 140]
                },
                一线天: { //注意和石墓阵冲突
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: 540,
                        y: 524,
                    },
                    {
                        x: 242,
                        y: 388,
                    },
                    {
                        x: 507,
                        y: 189,
                    },
                    {
                        x: 814,
                        y: 516,
                    },
                ]
            },
            一线天: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                邪恶势力: {
                    x: [-80, -120],
                    y: [120, 140]
                },
                恐怖空间: { //注意和石墓阵冲突
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: 217,
                        y: 303,
                    },
                    {
                        x: 423,
                        y: 145,
                    },
                    {
                        x: 781,
                        y: 213,
                    },
                    {
                        x: 819,
                        y: 331,
                    },
                    {
                        x: 223,
                        y: 572,
                    },
                    {
                        x: 356,
                        y: 252,
                    },
                ]
            },
        }

    },
    苍月大地图偏移: {
        '720_1280': {
            苍月大城: {
                是否沿途打怪: false,
                是否是断点: false,
                是否需要随机: false,
                苍月老兵: {
                    x: [-80, -120],
                    y: [374, 394]
                },
                骨魔洞一层: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                牛魔寺庙入口: {
                    x: [-80, -120],
                    y: [170, 190]
                },
                尸魔洞一层: {
                    x: [-80, -120],
                    y: [215, 235]
                },
            },
            骨魔洞一层: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                苍月岛: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                骨魔洞二层: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: [-910, -900],
                        y: [145, 155],
                        坐标范围: {
                            x: [60, 101],
                            y: [90, 124],
                            点击次数: 4
                        }
                    },
                    {
                        x: [-317, -327],
                        y: [107, 117],
                        坐标范围: {
                            x: [31, 47],
                            y: [22, 34],
                            点击次数: 4
                        }
                    },
                    {
                        x: [-407, -417],
                        y: [472, 482],
                        坐标范围: {
                            x: [178, 202],
                            y: [100, 129],
                            点击次数: 4
                        }
                    },
                    {
                        x: [-712, -722],
                        y: [436, 446],
                        坐标范围: {
                            x: [143, 173],
                            y: [39, 75],
                            点击次数: 4
                        }
                    },
                ]
            },
            骨魔洞二层: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                骨魔洞一层: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                骨魔洞三层: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: [-937, -941],
                        y: [124, 128],
                        坐标范围: {
                            x: [60, 101],
                            y: [90, 124],
                            点击次数: 4
                        }
                    },
                    {
                        x: [-833, -837],
                        y: [429, 433],
                        坐标范围: {
                            x: [31, 47],
                            y: [22, 34],
                            点击次数: 4
                        }
                    },
                    {
                        x: [-507, -511],
                        y: [335, 339],
                        坐标范围: {
                            x: [178, 202],
                            y: [100, 129],
                            点击次数: 4
                        }
                    },
                    {
                        x: [-347, -350],
                        y: [459, 493],
                        坐标范围: {
                            x: [143, 173],
                            y: [39, 75],
                            点击次数: 4
                        }
                    },

                    {
                        x: [-359, -363],
                        y: [287, 291],
                        坐标范围: {
                            x: [143, 173],
                            y: [39, 75],
                            点击次数: 4
                        }
                    },
                    {
                        x: [-371, -374],
                        y: [139, 143],
                        坐标范围: {
                            x: [143, 173],
                            y: [39, 75],
                            点击次数: 4
                        }
                    },
                    {
                        x: [-600, -604],
                        y: [151, 155],
                        坐标范围: {
                            x: [143, 173],
                            y: [39, 75],
                            点击次数: 4
                        }
                    }
                ]
            },
            骨魔洞三层: {
                是否沿途打怪: true,
                是否是断点: false,
                是否需要随机: false,
                骨魔洞二层: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                骨魔洞四层: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: [-664, -668],
                        y: [496, 450],
                        坐标范围: {
                            x: [60, 101],
                            y: [90, 124],
                            点击次数: 4
                        }
                    },
                    {
                        x: [-483, -487],
                        y: [321, 324],
                        坐标范围: {
                            x: [31, 47],
                            y: [22, 34],
                            点击次数: 4
                        }
                    },
                    {
                        x: [-356, -360],
                        y: [158, 162],
                        坐标范围: {
                            x: [178, 202],
                            y: [100, 129],
                            点击次数: 4
                        }
                    },
                    {
                        x: [-658, -662],
                        y: [159, 163],
                        坐标范围: {
                            x: [143, 173],
                            y: [39, 75],
                            点击次数: 4
                        }
                    },

                    {
                        x: [-942, -946],
                        y: [191, 195],
                        坐标范围: {
                            x: [143, 173],
                            y: [39, 75],
                            点击次数: 4
                        }
                    },
                    {
                        x: [-852, -856],
                        y: [395, 399],
                        坐标范围: {
                            x: [143, 173],
                            y: [39, 75],
                            点击次数: 4
                        }
                    }
                ]
            },
            牛魔寺庙入口: {
                苍月岛: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                牛魔寺庙一层: {
                    x: [-80, -120],
                    y: [165, 185]
                }
            },
            牛魔寺庙一层: {
                牛魔寺庙入口: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                牛魔寺庙二层: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: 722,
                        y: 451,
                    },
                    {
                        x: 620,
                        y: 499,
                    },
                    {
                        x: 152,
                        y: 557,
                    },
                    {
                        x: 420,
                        y: 496,
                    },
                    {
                        x: 862,
                        y: 287,
                    },
                    {
                        x: 636,
                        y: 243,
                    },
                    {
                        x: 868,
                        y: 160,
                    },
                    {
                        x: 715,
                        y: 144,
                    },
                    {
                        x: 483,
                        y: 166,
                    },
                    {
                        x: 193,
                        y: 220,
                    }
                ]
            },
            牛魔寺庙二层: {
                牛魔寺庙一层: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                牛魔寺庙三层: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: 508,
                        y: 272,
                    },
                    {
                        x: 315,
                        y: 185,
                    },
                    {
                        x: 299,
                        y: 353,
                    },
                    {
                        x: 401,
                        y: 410,
                    },
                    {
                        x: 668,
                        y: 405,
                    },
                    {
                        x: 844,
                        y: 225,
                    },
                    {
                        x: 599,
                        y: 225,
                    },
                    {
                        x: 315,
                        y: 185,
                    },
                    {
                        x: 444,
                        y: 284,
                    },
                ]
            },
            牛魔寺庙三层: {
                牛魔寺庙二层: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                牛魔寺庙四层: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: 456,
                        y: 282
                    },
                    {
                        x: 543,
                        y: 426
                    },
                    {
                        x: 312,
                        y: 389
                    },
                    {
                        x: 172,
                        y: 360
                    },
                    {
                        x: 173,
                        y: 576,
                    },
                    {
                        x: 604,
                        y: 508,
                    },

                    {
                        x: 724,
                        y: 478,
                    },
                    {
                        x: 844,
                        y: 343,
                    },
                    {
                        x: 860,
                        y: 124,
                    },
                    {
                        x: 596,
                        y: 230,
                    },
                    {
                        x: 414,
                        y: 140,
                    },
                    {
                        x: 235,
                        y: 154,
                    },
                    {
                        x: 384,
                        y: 263,
                    },
                    {
                        x: 552,
                        y: 244,
                    },
                    {
                        x: 455,
                        y: 337,
                    }
                ]
            },
            牛魔寺庙四层: {
                牛魔寺庙三层: {
                    x: [-80, -120],
                    y: [125, 145]
                },
                牛魔寺庙五层: {
                    x: [-80, -120],
                    y: [165, 185]
                },
                打怪点: [
                    {
                        x: 361,
                        y: 334,
                    },
                    {
                        x: 196,
                        y: 214,
                    },
                    {
                        x: 450,
                        y: 196,
                    },
                    {
                        x: 205,
                        y: 511,
                    },
                    {
                        x: 617,
                        y: 393,
                    },
                    {
                        x: 778,
                        y: 342,
                    },
                    {
                        x: 856,
                        y: 152,
                    },
                    {
                        x: 527,
                        y: 148,
                    },
                    {
                        x: 251,
                        y: 176,
                    },
                    {
                        x: 360,
                        y: 328,
                    },
                ]
            },
        }

    },
    保存仓库包格子偏移量: {//这里是针对卖装备背包格子偏移量
        '720_1280': {
            x: -116,
            y: 0
        }//651,95
    },
    背包格子偏移: {
        '720_1280': {
            "1_1": { x: -304, y: -272 },//针对整理按钮左上角的位置(格子中心)
            "1_1_左上": { x: -338, y: -300 },//针对整理按钮左上角的位置(格子左上)
            中心点偏移量X: 60,
            中心点偏移量Y: 58,
            背包宽度: 483,
            背包高度: 296
        }
    },
    背包格子于面板偏移量: {//这里是针对卖装备背包格子偏移量
        '720_1280': {
            "1_1": { x: -302, y: -271 },//第一行第一列中心点坐标
            "1_2": { x: -240, y: -271 },
            "1_3": { x: -185, y: -271 },
            "1_4": { x: -122, y: -271 },
            "1_5": { x: -62, y: -271 },
            "1_6": { x: -2, y: -271 },
            "1_7": { x: 58, y: -271 },
            "1_8": { x: 117, y: -271 },

            "2_1": { x: -302, y: -214 },//第二行第一列中心点坐标
            "2_2": { x: -240, y: -214 },
            "2_3": { x: -185, y: -214 },
            "2_4": { x: -122, y: -214 },
            "2_5": { x: -62, y: -214 },
            "2_6": { x: -2, y: -214 },
            "2_7": { x: 58, y: -214 },
            "2_8": { x: 117, y: -214 },

            "3_1": { x: -302, y: -152 },//第三行第一列中心点坐标
            "3_2": { x: -240, y: -152 },
            "3_3": { x: -185, y: -152 },
            "3_4": { x: -122, y: -152 },
            "3_5": { x: -62, y: -152 },
            "3_6": { x: -2, y: -152 },
            "3_7": { x: 58, y: -152 },
            "3_8": { x: 117, y: -152 },

            "4_1": { x: -302, y: -92 },//第四行第一列中心点坐标
            "4_2": { x: -240, y: -92 },
            "4_3": { x: -185, y: -92 },
            "4_4": { x: -122, y: -92 },
            "4_5": { x: -62, y: -92 },
            "4_6": { x: -2, y: -92 },
            "4_7": { x: 58, y: -92 },
            "4_8": { x: 117, y: -92 },

            "5_1": { x: -302, y: -33 },//第五行第一列中心点坐标
            "5_2": { x: -240, y: -33 },
            "5_3": { x: -185, y: -33 },
            "5_4": { x: -122, y: -33 },
            "5_5": { x: -62, y: -33 },
            "5_6": { x: -2, y: -33 },
            "5_7": { x: 58, y: -33 },
            "5_8": { x: 117, y: -33 },

        }//651,95
    },
    人物坐标范围: {
        '720_1280': {
            x1: 1187,
            x2: 1273,
            y1: 145,
            y2: 190
        }
    },
    人物坐标范围精确: {
        '720_1280': {
            x1: 1192,
            x2: 1270,
            y1: 157,
            y2: 172
        }
    },
    被攻击怪物血量: {
        '720_1280': {
            x1: 617,
            x2: 665,
            y1: 34,
            y2: 48
        }
    },
    金币范围: {
        '720_1280': {
            x1: 880,
            x2: 972,
            y1: 690,
            y2: 720
        }
    },
    血量范围: {
        '720_1280': {
            x1: 260,
            x2: 315,
            y1: 638,
            y2: 688
            // y2: 710
        }
    },
    地点范围: {
        '1080_1920': { x1: 1656, x2: 1869, y1: 3, y2: 63 },
        '720_1280': { x1: 1110, x2: 1243, y1: 4, y2: 40 }
    },
    小地图范围: {
        '1080_1920': { x1: 1675, x2: 1875, y1: 80, y2: 200 },
        '720_1280': { x1: 1124, x2: 1247, y1: 55, y2: 148 }
    },
    小地图范围2: {
        '720_1280': { x1: 1172, x2: 1280, y1: 137, y2: 180 }
    },
    大地图拖动相对位置: {
        '720_1280': {
            x: 34,
            y: 42
        }
    },
    购买物品页码: {
        金创药小: {
            页码: 1,
            顺序: 1,
            是否下翻: false
        },
        金创药中个: {
            页码: 1,
            顺序: 3,
            是否下翻: false
        },
        金创药中包: {
            页码: 1,
            顺序: 9,
            是否下翻: false
        },
        魔法药中个: {
            页码: 1,
            顺序: 4,
            是否下翻: false
        },
        魔法药中包: {
            页码: 1,
            顺序: 10,
            是否下翻: false
        },
        地牢: {
            页码: 2,
            顺序: 3,
            是否下翻: false
        },
        随机: {
            页码: 2,
            顺序: 4,
            是否下翻: false
        },
        修复油: {
            页码: 2,
            顺序: 6,
            是否下翻: false
        },
        护身符大: {
            页码: 2,
            顺序: 9,
            是否下翻: true
        },
        随机包: {
            页码: 2,
            顺序: 8,
            是否下翻: false
        },
    },
    购买物品位置: {
        '720_1280': {
            "1": {//158,181    400,174
                x: [138, 178],
                y: [170, 190]
            },
            "2": {
                x: [380, 420],
                y: [170, 190]
            },
            "3": {
                x: [138, 178],
                y: [249, 269]
            },
            "4": {
                x: [380, 420],
                y: [249, 269]
            },
            "5": {
                x: [138, 178],
                y: [330, 350]
            },
            "6": {
                x: [380, 420],
                y: [330, 350]
            },
            "7": {
                x: [138, 178],
                y: [412, 432]
            },
            "8": {
                x: [380, 420],
                y: [412, 432]
            },
            "9": {
                x: [138, 178],
                y: [490, 510]
            },
            "10": {
                x: [380, 420],
                y: [490, 510]
            },
        }
    },
    人物面板: {
        '720_1280': {
            //装备属性明细: { x: -280, y: 80 }, //(用于裁剪装备文字)
            装备属性明细: { x: -400, y: 80 }, //(用于裁剪装备文字)
            头盔: { x: 156, y: 94 },//人物头（中心点）相对rewumianbanBtn.png左上的距离
            衣服: { x: 157, y: 184 },
            项链: { x: 271, y: 80 },
            武器: { x: 67, y: 133 },
            手镯1: { x: 57, y: 236 },
            手镯2: { x: 264, y: 241 },
            戒指1: { x: 57, y: 313 },
            戒指2: { x: 264, y: 308 },
            护身符: { x: 57, y: 378 },
        }
    }
}


// https://blog.csdn.net/wangsheng5454/article/details/117119402
// 安卓API版本  29 安卓10
config.SDK_API_VERSION = android.os.Build.VERSION.SDK_INT
module.exports = config