let config = {}
// 公共脚本key
config.commonScriptKey = "zijiefeiwuCommon";
// 业务脚本key
config.serviceScriptKey = "zijiefeiwuBus";
// appKey
config.appKey = "宁波字节飞舞科技"
// 分辨率 以竖屏标准看
config.screenWidth = 1080
config.screenHeight = 2400
config.youxiaoFBL = [{
    w: 1080,
    h: 1920
}, {
    w: 720,
    h: 1280
}]
config.地图跳转表 = {
    "比奇": {
        "兽人古墓一层": [
            ["比奇大城", "兽人古墓一层"],
            ["兽人古墓", "第一层", "打怪点", 0]
        ],
        "兽人古墓二层": [
            ["比奇大城", "兽人古墓一层"],
            ["兽人古墓", "第一层", "兽人古墓二层"],
            ["兽人古墓", "第二层", "打怪点", 0]
        ],
        "兽人古墓三层": [
            ["比奇大城", "兽人古墓一层"],
            ["兽人古墓", "第一层", "兽人古墓二层"],
            ["兽人古墓", "第二层", "兽人古墓三层"],
            ["兽人古墓", "第三层", "打怪点", 0]
        ],
        "回比奇老兵":[
            ["比奇大城", "比奇老兵"],
        ]
    },
    "兽人古墓一层": {
        "兽人古墓二层": [
            ["兽人古墓", "第一层", "兽人古墓二层"],
            ["兽人古墓", "第二层", "打怪点", 0]
        ],
        "兽人古墓三层": [
            ["兽人古墓", "第一层", "兽人古墓二层"],
            ["兽人古墓", "第二层", "兽人古墓三层"],
            ["兽人古墓", "第三层", "打怪点", 0]
        ],
        "回比奇老兵":[
            ["兽人古墓", "第一层", "比奇省"],
            ["比奇大城", "比奇老兵"],
        ]
    },
    "兽人古墓二层": {
        "兽人古墓一层": [
            ["兽人古墓", "第二层", "兽人古墓一层"],
            ["兽人古墓", "第一层", "打怪点", 0]
        ],
        "兽人古墓三层": [
            ["兽人古墓", "第二层", "兽人古墓三层"],
            ["兽人古墓", "第三层", "打怪点", 0]
        ],
        "回比奇老兵":[
            ["兽人古墓", "第二层", "兽人古墓一层"],
            ["兽人古墓", "第一层", "比奇省"],
            ["比奇大城", "比奇老兵"],
        ]
    },
    "兽人古墓三层": {
        "兽人古墓二层": [
            ["兽人古墓", "第三层", "兽人古墓二层"],
            ["兽人古墓", "第二层", "打怪点", 0]
        ],
        "兽人古墓一层": [
            ["兽人古墓", "第三层", "兽人古墓二层"],
            ["兽人古墓", "第二层", "兽人古墓一层"],
            ["兽人古墓", "第一层", "打怪点", 0]
        ],
        "回比奇老兵":[
            ["兽人古墓", "第三层", "兽人古墓二层"],
            ["兽人古墓", "第二层", "兽人古墓一层"],
            ["兽人古墓", "第一层", "比奇省"],
            ["比奇大城", "比奇老兵"],
        ]
    }
}
config.地图路由 = {
    "比奇省": config.地图跳转表["比奇"],
    "比奇城": config.地图跳转表["比奇"],
    "银杏山谷": config.地图跳转表["比奇"],
    "边界村": config.地图跳转表["比奇"],
    "兽人古墓一层": config.地图跳转表["兽人古墓一层"],
    "兽人古墓二层": config.地图跳转表["兽人古墓二层"],
    "兽人古墓三层": config.地图跳转表["兽人古墓三层"],
}
config.需存仓库装备 = ["炼狱", "魔杖", "银蛇", "井中月", "血饮", "无极棍", "裁决", "骨玉", "龙纹", "放大镜", "幽灵", "生命", "思贝儿", "心灵", "龙之", "红宝石", "铂金", "绿色", "铃铛", "灵魂项链", "骑士", "三眼", "力量", "紫碧", "泰坦", "组队", "经验加成"]
config.怪物集合 = {
    "兽人古墓": ["骷髅战士", "骷髅", "骷髅战将", "洞蛆", "掷斧骷髅"]
}
config.zuobiao = {
    遥感中心位置: {
        '720_1280': {
            x: 134,
            y: 542
        }
    },
    锁定怪物标识范围: {
        '720_1280': {
            x: [505, 760],
            y: [2, 62]
        }
    },
    左攻击面板: {
        '720_1280': {
            展开: {
                x: [10, 15],
                y: [210, 226]
            },
            切换: {
                x: [16, 26],
                y: [208, 228]
            },
            选择怪物: {
                x: [14, 24],
                y: [280, 302]
            },
            选择怪物攻击: {
                x: [142, 182],
                y: [130, 142]
            }
        }
    },
    按钮集合: {
        '720_1280': {
            拾取: {
                x: [950, 960],
                y: [360, 370]
            },
            普攻: {
                x: [1170, 1221],
                y: [580, 620]
            }
        },
    },
    比奇安全区坐标范围: {
        x1: 322,
        x2: 336,
        y1: 257,
        y2: 278
    },
    比奇老兵坐标: {
        x: 330,
        y: 270
    },
    比奇小贩坐标: {
        x: 326,
        y: 266
    },
    比奇丢东西范围: {
        '720_1280': {
            x: [1067, 1261],
            y: [532, 666]
        }
    },
    比奇小贩按钮: {
        '720_1280': {
            x1: 763,
            x2: 892,
            y1: 414,
            y2: 446
        }
    },
    比奇小贩面板: {
        购买物品: {
            '720_1280': {
                x1: 80,
                x2: 170,
                y1: 88,
                y2: 105
            }
        },
        出售物品: {
            '720_1280': {
                x1: 317,
                x2: 405,
                y1: 88,
                y2: 105
            }
        },
        普通修理: {
            '720_1280': {
                x1: 80,
                x2: 170,
                y1: 144,
                y2: 162
            }
        },
        特殊修理: {
            '720_1280': {
                x1: 317,
                x2: 405,
                y1: 144,
                y2: 162
            }
        },
        保存物品: {
            '720_1280': {
                x1: 80,
                x2: 170,
                y1: 202,
                y2: 217
            }
        }
    },
    药品格子面板: {
        '720_1280': {
            x1: 497,
            x2: 873,
            y1: 567,
            y2: 609
        }
    },
    聊天框面板: {
        '720_1280': {
            x1: 472,
            x2: 887,
            y1: 610,
            y2: 697
        }
    },
    左侧大聊天框面板: {
        '720_1280': {
            x1: 110,
            x2: 472,
            y1: 11,
            y2: 550
        }
    },
    比奇大地图偏移: {
        '720_1280': {
            比奇大城: {
                比奇老兵: {
                    x: [-80, -120],
                    y: [456, 476]
                },
                兽人古墓一层: {
                    x: [-80, -120],
                    y: [120, 140]
                },
            },
            兽人古墓: {
                第一层: {
                    比奇省: {
                        x: [-80, -120],
                        y: [120, 140]
                    },
                    兽人古墓二层: {
                        x: [-80, -120],
                        y: [165, 185]
                    },
                    打怪点: [
                        {
                            x: [-510, -540],
                            y: [356, 376],
                            坐标范围: {
                                x: [225, 267],
                                y: [226, 292]
                            }
                        },
                        {
                            x: [-285, -300],
                            y: [210, 230],
                            坐标范围: {
                                x: [356, 376],
                                y: [122, 160]
                            }
                        },
                        {
                            x: [-520, -580],
                            y: [140, 170],
                            坐标范围: {
                                x: [227, 264],
                                y: [66, 105]
                            }
                        },
                        {
                            x: [-828, -848],
                            y: [129, 149],
                            坐标范围: {
                                x: [86, 100],
                                y: [55, 82]
                            }
                        },
                        {
                            x: [-785, -800],
                            y: [420, 438],
                            坐标范围: {
                                x: [100, 126],
                                y: [272, 302]
                            }
                        },
                    ]
                },
                第二层: {
                    兽人古墓一层: {
                        x: [-80, -120],
                        y: [120, 140]
                    },
                    兽人古墓三层: {
                        x: [-80, -120],
                        y: [165, 185]
                    },
                    打怪点: [
                        {
                            x: [-850, -900],
                            y: [300, 400]
                        },
                        {
                            x: [-600, -650],
                            y: [280, 320]
                        },
                        {
                            x: [-400, -480],
                            y: [380, 420]
                        },
                        {
                            x: [-350, -400],
                            y: [300, 350]
                        },
                        {
                            x: [-550, -600],
                            y: [130, 180]
                        },
                    ]
                },
                第三层: {
                    兽人古墓二层: {
                        x: [-80, -120],
                        y: [120, 140]
                    },
                    打怪点: [
                        {
                            x: [-830, -930],
                            y: [235, 275]
                        },
                        {
                            x: [-600, -700],
                            y: [300, 350]
                        },
                        {
                            x: [-500, -585],
                            y: [410, 470]
                        },
                        {
                            x: [-800, -855],
                            y: [400, 450]
                        },
                    ]
                }
            },
            僵尸洞: {
                第一层: {
                    比奇老兵: {
                        x: [-80, -120],
                        y: [456, 476]
                    },
                    废墟入口: {
                        x: [-80, -120],
                        y: [303, 323]
                    }
                }
            }
        }

    },
    保存仓库包格子偏移量: {//这里是针对卖装备背包格子偏移量
        '720_1280': {
            x: -116,
            y: 0
        }//651,95
    },
    背包格子于面板偏移量: {//这里是针对卖装备背包格子偏移量
        '720_1280': {
            "1_1": { x: 45, y: 37 },//第一行第一列中心点坐标
            "1_2": { x: 105, y: 37 },
            "1_3": { x: 165, y: 37 },
            "1_4": { x: 225, y: 37 },
            "1_5": { x: 285, y: 37 },
            "1_6": { x: 345, y: 37 },
            "1_7": { x: 405, y: 37 },
            "1_8": { x: 465, y: 37 },

            "2_1": { x: 45, y: 90 },//第二行第一列中心点坐标
            "2_2": { x: 105, y: 90 },
            "2_3": { x: 165, y: 90 },
            "2_4": { x: 225, y: 90 },
            "2_5": { x: 285, y: 90 },
            "2_6": { x: 345, y: 90 },
            "2_7": { x: 405, y: 90 },
            "2_8": { x: 465, y: 90 },

            "3_1": { x: 45, y: 143 },//第三行第一列中心点坐标
            "3_2": { x: 105, y: 143 },
            "3_3": { x: 165, y: 143 },
            "3_4": { x: 225, y: 143 },
            "3_5": { x: 285, y: 143 },
            "3_6": { x: 345, y: 143 },
            "3_7": { x: 405, y: 143 },
            "3_8": { x: 465, y: 143 },

            "4_1": { x: 45, y: 193 },//第四行第一列中心点坐标
            "4_2": { x: 105, y: 193 },
            "4_3": { x: 165, y: 193 },
            "4_4": { x: 225, y: 193 },
            "4_5": { x: 285, y: 193 },
            "4_6": { x: 345, y: 193 },
            "4_7": { x: 405, y: 193 },
            "4_8": { x: 465, y: 193 },

            "5_1": { x: 45, y: 246 },//第五行第一列中心点坐标
            "5_2": { x: 105, y: 246 },
            "5_3": { x: 165, y: 246 },
            "5_4": { x: 225, y: 246 },
            "5_5": { x: 285, y: 246 },
            "5_6": { x: 345, y: 246 },
            "5_7": { x: 405, y: 246 },
            "5_8": { x: 465, y: 246 },

        }//651,95
    },
    卖装备背包格子: {
        '720_1280': {
            "1_1": { x: 767, y: 90 },//第一行第一列中心点坐标
            "1_2": { x: 833, y: 90 },
            "1_3": { x: 891, y: 90 },
            "1_4": { x: 949, y: 90 },
            "1_5": { x: 1010, y: 90 },
            "1_6": { x: 1070, y: 90 },
            "1_7": { x: 1128, y: 90 },
            "1_8": { x: 1190, y: 90 },
            "2_1": { x: 767, y: 148 },//第二行第一列中心点坐标
            "2_2": { x: 833, y: 148 },
            "2_3": { x: 891, y: 148 },
            "2_4": { x: 949, y: 148 },
            "2_5": { x: 1010, y: 148 },
            "2_6": { x: 1070, y: 148 },
            "2_7": { x: 1128, y: 148 },
            "2_8": { x: 1190, y: 148 },
            "3_1": { x: 767, y: 201 },//第三行第一列中心点坐标
            "3_2": { x: 833, y: 201 },
            "3_3": { x: 891, y: 201 },
            "3_4": { x: 949, y: 201 },
            "3_5": { x: 1010, y: 201 },
            "3_6": { x: 1070, y: 201 },
            "3_7": { x: 1128, y: 201 },
            "3_8": { x: 1190, y: 201 },
            "4_1": { x: 767, y: 249 },//第四行第一列中心点坐标
            "4_2": { x: 833, y: 249 },
            "4_3": { x: 891, y: 249 },
            "4_4": { x: 949, y: 249 },
            "4_5": { x: 1010, y: 249 },
            "4_6": { x: 1070, y: 249 },
            "4_7": { x: 1128, y: 249 },
            "4_8": { x: 1190, y: 249 },
            "5_1": { x: 767, y: 307 },//第五行第一列中心点坐标
            "5_2": { x: 833, y: 307 },
            "5_3": { x: 891, y: 307 },
            "5_4": { x: 949, y: 307 },
            "5_5": { x: 1010, y: 307 },
            "5_6": { x: 1070, y: 307 },
            "5_7": { x: 1128, y: 307 },
            "5_8": { x: 1190, y: 307 },
            "最底部": 465,
            "整理按钮": {
                x1: 1092,
                x2: 1150,
                y1: 350,
                y2: 365
            }
        }
    },
    人物坐标范围: {
        '720_1280': {
            x1: 1192,
            x2: 1280,
            y1: 140,
            y2: 185
        }
    },
    地点范围: {
        '1080_1920': { x1: 1656, x2: 1869, y1: 3, y2: 63 },
        '720_1280': { x1: 1110, x2: 1243, y1: 4, y2: 40 }
    },
    小地图范围: {
        '1080_1920': { x1: 1675, x2: 1875, y1: 80, y2: 200 },
        '720_1280': { x1: 1118, x2: 1256, y1: 46, y2: 148 }
    },
    购买物品页码: {
        金创药小: {
            页码: 1,
            顺序: 1,
            是否下翻: false
        },
        金创药中包: {
            页码: 2,
            顺序: 4,
            是否下翻: false
        },
        魔法药中包: {
            页码: 2,
            顺序: 5,
            是否下翻: false
        },
        地牢: {
            页码: 3,
            顺序: 3,
            是否下翻: false
        },
        随机: {
            页码: 3,
            顺序: 4,
            是否下翻: false
        },
        修复油: {
            页码: 3,
            顺序: 6,
            是否下翻: false
        },
        护身符大: {
            页码: 4,
            顺序: 4,
            是否下翻: true
        },
        随机包: {
            页码: 4,
            顺序: 3,
            是否下翻: false
        },
    },
    购买物品位置: {
        '720_1280': {
            "1": {
                x: [45, 100],
                y: [290, 300]
            },
            "2": {
                x: [45, 100],
                y: [325, 335]
            },
            "3": {
                x: [45, 100],
                y: [365, 370]
            },
            "4": {
                x: [45, 100],
                y: [400, 410]
            },
            "5": {
                x: [45, 100],
                y: [435, 445]
            },
            "6": {
                x: [45, 100],
                y: [470, 480]
            }
        }
    },
    人物面板: {
        装备属性明细: { //装备属性明细
            '720_1280': {
                x: -300,
                y: 200
            }
        },
        头盔: { //人物头（中心点）相对左边关闭按钮的距离
            '720_1280': { x: 194, y: 106 }
        },
        衣服: { //人物头（中心点）相对左边关闭按钮的距离
            '720_1280': { x: 197, y: 180 }
        },
        项链: { //人物项链（中心点）相对左边关闭按钮的距离
            '720_1280': { x: 296, y: 101 }
        },
        武器: { //人物武器(中心点)相对左边关闭按钮的距离
            '720_1280': { x: 98, y: 123 }
        },
        手镯1: { //人物左手镯(中心点)相对左边关闭按钮的距离
            '720_1280': { x: 84, y: 249 }
        },
        手镯2: { //人物右手镯(中心点)相对左边关闭按钮的距离
            '720_1280': { x: 292, y: 249 }
        },
        戒指1: { //人物左戒指(中心点)相对左边关闭按钮的距离
            '720_1280': { x: 84, y: 315 }
        },
        戒指2: { //人物右戒指(中心点)相对左边关闭按钮的距离
            '720_1280': { x: 295, y: 311 }
        },
    }

    // 1674,78,#000000
    // 1872,84,#000000
    // 1683,206,#000000
    // 1884,206,#000000


}


// https://blog.csdn.net/wangsheng5454/article/details/117119402
// 安卓API版本  29 安卓10
config.SDK_API_VERSION = android.os.Build.VERSION.SDK_INT
module.exports = config